

/* automatically generated by rust-bindgen */

#![allow(non_camel_case_types)]
#![allow(non_upper_case_globals)]
#![allow(non_snake_case)]
#![allow(dead_code)]

pub mod lang_items {
    pub enum c_void {}
    pub type c_char = u8;
    pub type c_int = i32;
    pub type c_long = i64;
    pub type c_longlong = i64;
    pub type c_schar = i8;
    pub type c_short = i16;
    pub type c_uchar = u8;
    pub type c_uint = u32;
    pub type c_ulong = u64;
    pub type c_ulonglong = u64;
    pub type c_ushort = u16;
    pub type size_t = u64;
    pub type ssize_t = i64;
    pub type c_float = f32;
    pub type c_double = f64;
}

#[repr(C)]
#[derive(Copy, Clone, Debug, Default, Eq, Hash, Ord, PartialEq, PartialOrd)]
pub struct __BindgenBitfieldUnit<Storage, Align>
where
    Storage: AsRef<[u8]> + AsMut<[u8]>,
{
    storage: Storage,
    align: [Align; 0],
}

impl<Storage, Align> __BindgenBitfieldUnit<Storage, Align>
where
    Storage: AsRef<[u8]> + AsMut<[u8]>,
{
    #[inline]
    pub fn new(storage: Storage) -> Self {
        Self { storage, align: [] }
    }

    #[inline]
    pub fn get_bit(&self, index: usize) -> bool {
        debug_assert!(index / 8 < self.storage.as_ref().len());

        let byte_index = index / 8;
        let byte = self.storage.as_ref()[byte_index];

        let bit_index = if cfg!(target_endian = "big") {
            7 - (index % 8)
        } else {
            index % 8
        };

        let mask = 1 << bit_index;

        byte & mask == mask
    }


    pub fn avutil_version() -> lang_items::c_uint;
}
extern "C" {
    /// Return an informative version string. This usually is the actual release
    /// version number or a git commit description. This string has no fixed format
    /// and can change any time. It should never be parsed by code.
    pub fn av_version_info() -> *const lang_items::c_char;
}
extern "C" {
    /// Return the libavutil build-time configuration.
    pub fn avutil_configuration() -> *const lang_items::c_char;
}
extern "C" {
    /// Return the libavutil license.
    pub fn avutil_license() -> *const lang_items::c_char;
}
/// < Usually treated as AVMEDIA_TYPE_DATA
pub const AVMediaType_AVMEDIA_TYPE_UNKNOWN: AVMediaType = -1;
pub const AVMediaType_AVMEDIA_TYPE_VIDEO: AVMediaType = 0;
pub const AVMediaType_AVMEDIA_TYPE_AUDIO: AVMediaType = 1;
/// < Opaque data information usually continuous
pub const AVMediaType_AVMEDIA_TYPE_DATA: AVMediaType = 2;
pub const AVMediaType_AVMEDIA_TYPE_SUBTITLE: AVMediaType = 3;
/// < Opaque data information usually sparse
pub const AVMediaType_AVMEDIA_TYPE_ATTACHMENT: AVMediaType = 4;
pub const AVMediaType_AVMEDIA_TYPE_NB: AVMediaType = 5;
/// @addtogroup lavu_media Media Type
/// @brief Media Type
pub type AVMediaType = i32;
extern "C" {
    /// Return a string describing the media_type enum, NULL if media_type
    /// is unknown.
    pub fn av_get_media_type_string(media_type: AVMediaType) -> *const lang_items::c_char;
}
/// < Undefined
pub const AVPictureType_AV_PICTURE_TYPE_NONE: AVPictureType = 0;
/// < Intra
pub const AVPictureType_AV_PICTURE_TYPE_I: AVPictureType = 1;
/// < Predicted
pub const AVPictureType_AV_PICTURE_TYPE_P: AVPictureType = 2;
/// < Bi-dir predicted
pub const AVPictureType_AV_PICTURE_TYPE_B: AVPictureType = 3;
/// < S(GMC)-VOP MPEG-4
pub const AVPictureType_AV_PICTURE_TYPE_S: AVPictureType = 4;
/// < Switching Intra
pub const AVPictureType_AV_PICTURE_TYPE_SI: AVPictureType = 5;
/// < Switching Predicted
pub const AVPictureType_AV_PICTURE_TYPE_SP: AVPictureType = 6;
/// < BI type
pub const AVPictureType_AV_PICTURE_TYPE_BI: AVPictureType = 7;
/// @}
/// @}
/// @defgroup lavu_picture Image related
///
/// AVPicture types, pixel formats and basic image planes manipulation.
///
/// @{
pub type AVPictureType = u32;
extern "C" {
    /// Return a single letter to describe the given picture type
    /// pict_type.
    ///
    /// @param[in] pict_type the picture type @return a single character
    /// representing the picture type, '?' if pict_type is unknown
    pub fn av_get_picture_type_char(pict_type: AVPictureType) -> lang_items::c_char;
}
pub type error_t = lang_items::c_int;
pub type wchar_t = lang_items::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct max_align_t {
    pub __max_align_ll: lang_items::c_longlong,
    pub __bindgen_padding_0: u64,
    pub __max_align_ld: f64,
}
#[test]
fn bindgen_test_layout_max_align_t() {
    assert_eq!(
        std::mem::size_of::<max_align_t>(),
        32usize,
        concat!("Size of: ", stringify!(max_align_t))
    );
    assert_eq!(
        std::mem::align_of::<max_align_t>(),
        16usize,
        concat!("Alignment of ", stringify!(max_align_t))
    );
    assert_eq!(
        unsafe { &(*(std::ptr::null::<max_align_t>())).__max_align_ll as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(max_align_t),
            "::",
            stringify!(__max_align_ll)
        )
    );
    assert_eq!(
        unsafe { &(*(std::ptr::null::<max_align_t>())).__max_align_ld as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(max_align_t),
            "::",
            stringify!(__max_align_ld)
        )
    );
}
pub type __int8_t = lang_items::c_schar;
pub type __uint8_t = lang_items::c_uchar;
pub type __int16_t = lang_items::c_short;
pub type __uint16_t = lang_items::c_ushort;
pub type __int32_t = lang_items::c_int;
pub type __uint32_t = lang_items::c_uint;
pub type __int64_t = lang_items::c_long;
pub type __uint64_t = lang_items::c_ulong;
pub type __int_least8_t = lang_items::c_schar;
pub type __uint_least8_t = lang_items::c_uchar;
pub type __int_least16_t = lang_items::c_short;
pub type __uint_least16_t = lang_items::c_ushort;
pub type __int_least32_t = lang_items::c_int;
pub type __uint_least32_t = lang_items::c_uint;
pub type __int_least64_t = lang_items::c_long;
pub type __uint_least64_t = lang_items::c_ulong;
pub type __intmax_t = lang_items::c_long;
pub type __uintmax_t = lang_items::c_ulong;
pub type __intptr_t = lang_items::c_long;
pub type __uintptr_t = lang_items::c_ulong;
pub type _ssize_t = lang_items::c_long;
pub type intmax_t = __intmax_t;
pub type uintmax_t = __uintmax_t;
pub type int_least8_t = __int_least8_t;
pub type uint_least8_t = __uint_least8_t;
pub type int_least16_t = __int_least16_t;
pub type uint_least16_t = __uint_least16_t;
pub type int_least32_t = __int_least32_t;
pub type uint_least32_t = __uint_least32_t;
pub type int_least64_t = __int_least64_t;
pub type uint_least64_t = __uint_least64_t;
pub type int_fast8_t = lang_items::c_schar;
pub type uint_fast8_t = lang_items::c_uchar;
pub type int_fast16_t = lang_items::c_short;
pub type uint_fast16_t = lang_items::c_ushort;
pub type int_fast32_t = lang_items::c_int;
pub type uint_fast32_t = lang_items::c_uint;
pub type int_fast64_t = lang_items::c_long;
pub type uint_fast64_t = lang_items::c_ulong;
pub type _LOCK_T = i32;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __lock_t {
    pub lock: _LOCK_T,
    pub thread_tag: u32,
    pub counter: u32,
}
#[test]
fn bindgen_test_layout___lock_t() {
    assert_eq!(
        std::mem::size_of::<__lock_t>(),
        12usize,
        concat!("Size of: ", stringify!(__lock_t))
    );
    assert_eq!(
        std::mem::align_of::<__lock_t>(),
        4usize,
        concat!("Alignment of ", stringify!(__lock_t))
    );
    assert_eq!(
        unsafe { &(*(std::ptr::null::<__lock_t>())).lock as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__lock_t),
            "::",
            stringify!(lock)
        )
    );
    assert_eq!(
        unsafe { &(*(std::ptr::null::<__lock_t>())).thread_tag as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(__lock_t),
            "::",
            stringify!(thread_tag)
        )
    );
    assert_eq!(
        unsafe { &(*(std::ptr::null::<__lock_t>())).counter as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(__lock_t),
            "::",
            stringify!(counter)
        )
    );
}
pub type _LOCK_RECURSIVE_T = __lock_t;
extern "C" {
    pub fn __libc_lock_init(lock: *mut _LOCK_T);
}
extern "C" {
    pub fn __libc_lock_init_recursive(lock: *mut _LOCK_RECURSIVE_T);
}
extern "C" {
    pub fn __libc_lock_close(lock: *mut _LOCK_T);
}
extern "C" {
    pub fn __libc_lock_close_recursive(lock: *mut _LOCK_RECURSIVE_T);
}
extern "C" {
    pub fn __libc_lock_acquire(lock: *mut _LOCK_T);
}
extern "C" {
    pub fn __libc_lock_acquire_recursive(lock: *mut _LOCK_RECURSIVE_T);
}
extern "C" {
    pub fn __libc_lock_release(lock: *mut _LOCK_T);
}
extern "C" {
    pub fn __libc_lock_release_recursive(lock: *mut _LOCK_RECURSIVE_T);
}
extern "C" {
    pub fn __libc_lock_try_acquire(lock: *mut _LOCK_T) -> lang_items::c_int;
}
extern "C" {
    pub fn __libc_lock_try_acquire_recursive(lock: *mut _LOCK_RECURSIVE_T) -> lang_items::c_int;
}
pub type __blkcnt_t = lang_items::c_long;
pub type __blksize_t = lang_items::c_long;
pub type __fsblkcnt_t = __uint64_t;
pub type __fsfilcnt_t = __uint32_t;
pub type _off_t = lang_items::c_long;
pub type __pid_t = lang_items::c_int;
pub type __dev_t = lang_items::c_short;
pub type __uid_t = lang_items::c_ushort;
pub type __gid_t = lang_items::c_ushort;
pub type __id_t = __uint32_t;
pub type __ino_t = lang_items::c_ushort;
pub type __mode_t = __uint32_t;
pub type _off64_t = lang_items::c_longlong;
pub type __off_t = _off_t;
pub type __loff_t = _off64_t;
pub type __key_t = lang_items::c_long;
pub type _fpos_t = lang_items::c_long;
pub type __size_t = lang_items::c_ulong;
pub type __ssize_t = _ssize_t;
pub type wint_t = lang_items::c_int;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _mbstate_t {
    pub __count: lang_items::c_int,
    pub __value: _mbstate_t__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union _mbstate_t__bindgen_ty_1 {
    pub __wch: wint_t,
    pub __wchb: [lang_items::c_uchar; 4usize],
    _bindgen_union_align: u32,
}
#[test]
fn bindgen_test_layout__mbstate_t__bindgen_ty_1() {
    assert_eq!(
        std::mem::size_of::<_mbstate_t__bindgen_ty_1>(),
        4usize,
        concat!("Size of: ", stringify!(_mbstate_t__bindgen_ty_1))
    );
    assert_eq!(
        std::mem::align_of::<_mbstate_t__bindgen_ty_1>(),
        4usize,
        concat!("Alignment of ", stringify!(_mbstate_t__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { &(*(std::ptr::null::<_mbstate_t__bindgen_ty_1>())).__wch as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_mbstate_t__bindgen_ty_1),
            "::",
            stringify!(__wch)
        )
    );
    assert_eq!(
        unsafe {
            &(*(std::ptr::null::<_mbstate_t__bindgen_ty_1>())).__wchb as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_mbstate_t__bindgen_ty_1),
            "::",
            stringify!(__wchb)
        )
    );
}
#[test]
fn bindgen_test_layout__mbstate_t() {
    assert_eq!(
        std::mem::size_of::<_mbstate_t>(),
        8usize,
        concat!("Size of: ", stringify!(_mbstate_t))
    );
    assert_eq!(
        std::mem::align_of::<_mbstate_t>(),
        4usize,
        concat!("Alignment of ", stringify!(_mbstate_t))
    );
    assert_eq!(
        unsafe { &(*(std::ptr::null::<_mbstate_t>())).__count as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_mbstate_t),
            "::",
            stringify!(__count)
        )
    );
    assert_eq!(
        unsafe { &(*(std::ptr::null::<_mbstate_t>())).__value as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_mbstate_t),
            "::",
            stringify!(__value)
        )
    );
}
pub type _flock_t = _LOCK_RECURSIVE_T;
pub type _iconv_t = *mut lang_items::c_void;
pub type __clock_t = lang_items::c_ulong;
pub type __time_t = lang_items::c_long;
pub type __clockid_t = lang_items::c_ulong;
pub type __timer_t = lang_items::c_ulong;
pub type __sa_family_t = __uint8_t;
pub type __socklen_t = __uint32_t;
pub type __nlink_t = lang_items::c_ushort;
pub type __suseconds_t = lang_items::c_long;
pub type __useconds_t = lang_items::c_ulong;
//pub type __va_list = *mut lang_items::c_char;
pub type __ULong = lang_items::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __locale_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _Bigint {
    pub _next: *mut _Bigint,
    pub _k: lang_items::c_int,
    pub _maxwds: lang_items::c_int,
    pub _sign: lang_items::c_int,
    pub _wds: lang_items::c_int,
    pub _x: [__ULong; 1usize],
}
#[test]
fn bindgen_test_layout__Bigint() {
    assert_eq!(
        std::mem::size_of::<_Bigint>(),
        32usize,
        concat!("Size of: ", stringify!(_Bigint))
    );
    assert_eq!(
        std::mem::align_of::<_Bigint>(),
        8usize,
        concat!("Alignment of ", stringify!(_Bigint))
    );
    assert_eq!(
        unsafe { &(*(std::ptr::null::<_Bigint>()))._next as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_Bigint),
            "::",
            stringify!(_next)
        )
    );
    assert_eq!(
        unsafe { &(*(std::ptr::null::<_Bigint>()))._k as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_Bigint),
            "::",
            stringify!(_k)
        )
    );
    assert_eq!(
        unsafe { &(*(std::ptr::null::<_Bigint>()))._maxwds as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(_Bigint),
            "::",
            stringify!(_maxwds)
        )
    );
    assert_eq!(
        unsafe { &(*(std::ptr::null::<_Bigint>()))._sign as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_Bigint),
            "::",
            stringify!(_sign)
        )
    );
    assert_eq!(
        unsafe { &(*(std::ptr::null::<_Bigint>()))._wds as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(_Bigint),
            "::",
            stringify!(_wds)
        )
    );
    assert_eq!(
        unsafe { &(*(std::ptr::null::<_Bigint>()))._x as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_Bigint),
            "::",
            stringify!(_x)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __tm {
    pub __tm_sec: lang_items::c_int,
    pub __tm_min: lang_items::c_int,
    pub __tm_hour: lang_items::c_int,
    pub __tm_mday: lang_items::c_int,
    pub __tm_mon: lang_items::c_int,
    pub __tm_year: lang_items::c_int,
    pub __tm_wday: lang_items::c_int,
    pub __tm_yday: lang_items::c_int,
    pub __tm_isdst: lang_items::c_int,
}
#[test]
fn bindgen_test_layout___tm() {
    assert_eq!(
        std::mem::size_of::<__tm>(),
        36usize,
        concat!("Size of: ", stringify!(__tm))
    );
    assert_eq!(
        std::mem::align_of::<__tm>(),
        4usize,
        concat!("Alignment of ", stringify!(__tm))
    );
    assert_eq!(
        unsafe { &(*(std::ptr::null::<__tm>())).__tm_sec as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__tm),
            "::",
            stringify!(__tm_sec)
        )
    );
    assert_eq!(
        unsafe { &(*(std::ptr::null::<__tm>())).__tm_min as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(__tm),
            "::",
            stringify!(__tm_min)
        )
    );
    assert_eq!(
        unsafe { &(*(std::ptr::null::<__tm>())).__tm_hour as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(__tm),
            "::",
            stringify!(__tm_hour)
        )
    );
    assert_eq!(
        unsafe { &(*(std::ptr::null::<__tm>())).__tm_mday as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(__tm),
            "::",
            stringify!(__tm_mday)
        )
    );
    assert_eq!(
        unsafe { &(*(std::ptr::null::<__tm>())).__tm_mon as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(__tm),
            "::",
            stringify!(__tm_mon)
        )
    );
    assert_eq!(
        unsafe { &(*(std::ptr::null::<__tm>())).__tm_year as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(__tm),
            "::",
            stringify!(__tm_year)
        )
    );
    assert_eq!(
        unsafe { &(*(std::ptr::null::<__tm>())).__tm_wday as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(__tm),
            "::",
            stringify!(__tm_wday)
        )
    );
    assert_eq!(
        unsafe { &(*(std::ptr::null::<__tm>())).__tm_yday as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(__tm),
            "::",
            stringify!(__tm_yday)
        )
    );
    assert_eq!(
        unsafe { &(*(std::ptr::null::<__tm>())).__tm_isdst as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(__tm),
            "::",
            stringify!(__tm_isdst)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _on_exit_args {
    pub _fnargs: [*mut lang_items::c_void; 32usize],
    pub _dso_handle: [*mut lang_items::c_void; 32usize],
    pub _fntypes: __ULong,
    pub _is_cxa: __ULong,
}
#[test]
fn bindgen_test_layout__on_exit_args() {
    assert_eq!(
        std::mem::size_of::<_on_exit_args>(),
        520usize,
        concat!("Size of: ", stringify!(_on_exit_args))
    );
    assert_eq!(
        std::mem::align_of::<_on_exit_args>(),
        8usize,
        concat!("Alignment of ", stringify!(_on_exit_args))
    );
    assert_eq!(
        unsafe { &(*(std::ptr::null::<_on_exit_args>()))._fnargs as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_on_exit_args),
            "::",
            stringify!(_fnargs)
        )
    );
    assert_eq!(
        unsafe { &(*(std::ptr::null::<_on_exit_args>()))._dso_handle as *const _ as usize },
        256usize,
        concat!(
            "Offset of field: ",
            stringify!(_on_exit_args),
            "::",
            stringify!(_dso_handle)
        )
    );
    assert_eq!(
        unsafe { &(*(std::ptr::null::<_on_exit_args>()))._fntypes as *const _ as usize },
        512usize,
        concat!(
            "Offset of field: ",
            stringify!(_on_exit_args),
            "::",
            stringify!(_fntypes)
        )
    );
    assert_eq!(
        unsafe { &(*(std::ptr::null::<_on_exit_args>()))._is_cxa as *const _ as usize },
        516usize,
        concat!(
            "Offset of field: ",
            stringify!(_on_exit_args),
            "::",
            stringify!(_is_cxa)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _atexit {
    pub _next: *mut _atexit,
    pub _ind: lang_items::c_int,
    pub _fns: [std::option::Option<unsafe extern "C" fn()>; 32usize],
    pub _on_exit_args: _on_exit_args,
}
#[test]
fn bindgen_test_layout__atexit() {
    assert_eq!(
        std::mem::size_of::<_atexit>(),
        792usize,
        concat!("Size of: ", stringify!(_atexit))
    );
    assert_eq!(
        std::mem::align_of::<_atexit>(),
        8usize,
        concat!("Alignment of ", stringify!(_atexit))
    );
    assert_eq!(
        unsafe { &(*(std::ptr::null::<_atexit>()))._next as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_atexit),
            "::",
            stringify!(_next)
        )
    );
    assert_eq!(
        unsafe { &(*(std::ptr::null::<_atexit>()))._ind as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_atexit),
            "::",
            stringify!(_ind)
        )
    );
    assert_eq!(
        unsafe { &(*(std::ptr::null::<_atexit>()))._fns as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_atexit),
            "::",
            stringify!(_fns)
        )
    );
    assert_eq!(
        unsafe { &(*(std::ptr::null::<_atexit>()))._on_exit_args as *const _ as usize },
        272usize,
        concat!(
            "Offset of field: ",
            stringify!(_atexit),
            "::",
            stringify!(_on_exit_args)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __sbuf {
    pub _base: *mut lang_items::c_uchar,
    pub _size: lang_items::c_int,
}
#[test]
fn bindgen_test_layout___sbuf() {
    assert_eq!(
        std::mem::size_of::<__sbuf>(),
        16usize,
        concat!("Size of: ", stringify!(__sbuf))
    );
    assert_eq!(
        std::mem::align_of::<__sbuf>(),
        8usize,
        concat!("Alignment of ", stringify!(__sbuf))
    );
    assert_eq!(
        unsafe { &(*(std::ptr::null::<__sbuf>()))._base as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__sbuf),
            "::",
            stringify!(_base)
        )
    );
    assert_eq!(
        unsafe { &(*(std::ptr::null::<__sbuf>()))._size as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(__sbuf),
            "::",
            stringify!(_size)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct __sFILE {
    pub _p: *mut lang_items::c_uchar,
    pub _r: lang_items::c_int,
    pub _w: lang_items::c_int,
    pub _flags: lang_items::c_short,
    pub _file: lang_items::c_short,
    pub _bf: __sbuf,
    pub _lbfsize: lang_items::c_int,
    pub _cookie: *mut lang_items::c_void,
    pub _read: std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut _reent,
            arg2: *mut lang_items::c_void,
            arg3: *mut lang_items::c_char,
            arg4: lang_items::c_int,
        ) -> lang_items::c_int,
    >,
    pub _write: std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut _reent,
            arg2: *mut lang_items::c_void,
            arg3: *const lang_items::c_char,
            arg4: lang_items::c_int,
        ) -> lang_items::c_int,
    >,
    pub _seek: std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut _reent,
            arg2: *mut lang_items::c_void,
            arg3: _fpos_t,
            arg4: lang_items::c_int,
        ) -> _fpos_t,
    >,
    pub _close: std::option::Option<
        unsafe extern "C" fn(arg1: *mut _reent, arg2: *mut lang_items::c_void) -> lang_items::c_int,
    >,
    pub _ub: __sbuf,
    pub _up: *mut lang_items::c_uchar,
    pub _ur: lang_items::c_int,
    pub _ubuf: [lang_items::c_uchar; 3usize],
    pub _nbuf: [lang_items::c_uchar; 1usize],
    pub _lb: __sbuf,
    pub _blksize: lang_items::c_int,
    pub _offset: _off_t,
    pub _data: *mut _reent,
    pub _lock: _flock_t,
    pub _mbstate: _mbstate_t,
    pub _flags2: lang_items::c_int,
}
#[test]
fn bindgen_test_layout___sFILE() {
    assert_eq!(
        std::mem::size_of::<__sFILE>(),
        184usize,
        concat!("Size of: ", stringify!(__sFILE))
    );
    assert_eq!(
        std::mem::align_of::<__sFILE>(),
        8usize,
        concat!("Alignment of ", stringify!(__sFILE))
    );
    assert_eq!(
        unsafe { &(*(std::ptr::null::<__sFILE>()))._p as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__sFILE),
            "::",
            stringify!(_p)
        )
    );
    assert_eq!(
        unsafe { &(*(std::ptr::null::<__sFILE>()))._r as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(__sFILE),
            "::",
            stringify!(_r)
        )
    );
    assert_eq!(
        unsafe { &(*(std::ptr::null::<__sFILE>()))._w as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(__sFILE),
            "::",
            stringify!(_w)
        )
    );
    assert_eq!(
        unsafe { &(*(std::ptr::null::<__sFILE>()))._flags as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(__sFILE),
            "::",
            stringify!(_flags)
        )
    );
    assert_eq!(
        unsafe { &(*(std::ptr::null::<__sFILE>()))._file as *const _ as usize },
        18usize,
        concat!(
            "Offset of field: ",
            stringify!(__sFILE),
            "::",
            stringify!(_file)
        )
    );
    assert_eq!(
        unsafe { &(*(std::ptr::null::<__sFILE>()))._bf as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(__sFILE),
            "::",
            stringify!(_bf)
        )
    );
    assert_eq!(
        unsafe { &(*(std::ptr::null::<__sFILE>()))._lbfsize as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(__sFILE),
            "::",
            stringify!(_lbfsize)
        )
    );
    assert_eq!(
        unsafe { &(*(std::ptr::null::<__sFILE>()))._cookie as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(__sFILE),
            "::",
            stringify!(_cookie)
        )
    );
    assert_eq!(
        unsafe { &(*(std::ptr::null::<__sFILE>()))._read as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(__sFILE),
            "::",
            stringify!(_read)
        )
    );
    assert_eq!(
        unsafe { &(*(std::ptr::null::<__sFILE>()))._write as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(__sFILE),
            "::",
            stringify!(_write)
        )
    );
    assert_eq!(
        unsafe { &(*(std::ptr::null::<__sFILE>()))._seek as *const _ as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(__sFILE),
            "::",
            stringify!(_seek)
        )
    );
    assert_eq!(
        unsafe { &(*(std::ptr::null::<__sFILE>()))._close as *const _ as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(__sFILE),
            "::",
            stringify!(_close)
        )
    );
    assert_eq!(
        unsafe { &(*(std::ptr::null::<__sFILE>()))._ub as *const _ as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(__sFILE),
            "::",
            stringify!(_ub)
        )
    );
    assert_eq!(
        unsafe { &(*(std::ptr::null::<__sFILE>()))._up as *const _ as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(__sFILE),
            "::",
            stringify!(_up)
        )
    );
    assert_eq!(
        unsafe { &(*(std::ptr::null::<__sFILE>()))._ur as *const _ as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(__sFILE),
            "::",
            stringify!(_ur)
        )
    );
    assert_eq!(
        unsafe { &(*(std::ptr::null::<__sFILE>()))._ubuf as *const _ as usize },
        116usize,
        concat!(
            "Offset of field: ",
            stringify!(__sFILE),
            "::",
            stringify!(_ubuf)
        )
    );
    assert_eq!(
        unsafe { &(*(std::ptr::null::<__sFILE>()))._nbuf as *const _ as usize },
        119usize,
        concat!(
            "Offset of field: ",
            stringify!(__sFILE),
            "::",
            stringify!(_nbuf)
        )
    );
    assert_eq!(
        unsafe { &(*(std::ptr::null::<__sFILE>()))._lb as *const _ as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(__sFILE),
            "::",
            stringify!(_lb)
        )
    );
    assert_eq!(
        unsafe { &(*(std::ptr::null::<__sFILE>()))._blksize as *const _ as usize },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(__sFILE),
            "::",
            stringify!(_blksize)
        )
    );
    assert_eq!(
        unsafe { &(*(std::ptr::null::<__sFILE>()))._offset as *const _ as usize },
        144usize,
        concat!(
            "Offset of field: ",
            stringify!(__sFILE),
            "::",
            stringify!(_offset)
        )
    );
    assert_eq!(
        unsafe { &(*(std::ptr::null::<__sFILE>()))._data as *const _ as usize },
        152usize,
        concat!(
            "Offset of field: ",
            stringify!(__sFILE),
            "::",
            stringify!(_data)
        )
    );
    assert_eq!(
        unsafe { &(*(std::ptr::null::<__sFILE>()))._lock as *const _ as usize },
        160usize,
        concat!(
            "Offset of field: ",
            stringify!(__sFILE),
            "::",
            stringify!(_lock)
        )
    );
    assert_eq!(
        unsafe { &(*(std::ptr::null::<__sFILE>()))._mbstate as *const _ as usize },
        172usize,
        concat!(
            "Offset of field: ",
            stringify!(__sFILE),
            "::",
            stringify!(_mbstate)
        )
    );
    assert_eq!(
        unsafe { &(*(std::ptr::null::<__sFILE>()))._flags2 as *const _ as usize },
        180usize,
        concat!(
            "Offset of field: ",
            stringify!(__sFILE),
            "::",
            stringify!(_flags2)
        )
    );
}
pub type __FILE = __sFILE;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _glue {
    pub _next: *mut _glue,
    pub _niobs: lang_items::c_int,
    pub _iobs: *mut __FILE,
}
#[test]
fn bindgen_test_layout__glue() {
    assert_eq!(
        std::mem::size_of::<_glue>(),
        24usize,
        concat!("Size of: ", stringify!(_glue))
    );
    assert_eq!(
        std::mem::align_of::<_glue>(),
        8usize,
        concat!("Alignment of ", stringify!(_glue))
    );
    assert_eq!(
        unsafe { &(*(std::ptr::null::<_glue>()))._next as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_glue),
            "::",
            stringify!(_next)
        )
    );
    assert_eq!(
        unsafe { &(*(std::ptr::null::<_glue>()))._niobs as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_glue),
            "::",
            stringify!(_niobs)
        )
    );
    assert_eq!(
        unsafe { &(*(std::ptr::null::<_glue>()))._iobs as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_glue),
            "::",
            stringify!(_iobs)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _rand48 {
    pub _seed: [lang_items::c_ushort; 3usize],
    pub _mult: [lang_items::c_ushort; 3usize],
    pub _add: lang_items::c_ushort,
}
#[test]
fn bindgen_test_layout__rand48() {
    assert_eq!(
        std::mem::size_of::<_rand48>(),
        14usize,
        concat!("Size of: ", stringify!(_rand48))
    );
    assert_eq!(
        std::mem::align_of::<_rand48>(),
        2usize,
        concat!("Alignment of ", stringify!(_rand48))
    );
    assert_eq!(
        unsafe { &(*(std::ptr::null::<_rand48>()))._seed as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_rand48),
            "::",
            stringify!(_seed)
        )
    );
    assert_eq!(
        unsafe { &(*(std::ptr::null::<_rand48>()))._mult as *const _ as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(_rand48),
            "::",
            stringify!(_mult)
        )
    );
    assert_eq!(
        unsafe { &(*(std::ptr::null::<_rand48>()))._add as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(_rand48),
            "::",
            stringify!(_add)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _reent {
    pub _errno: lang_items::c_int,
    pub _stdin: *mut __FILE,
    pub _stdout: *mut __FILE,
    pub _stderr: *mut __FILE,
    pub _inc: lang_items::c_int,
    pub _emergency: [lang_items::c_char; 25usize],
    pub _unspecified_locale_info: lang_items::c_int,
    pub _locale: *mut __locale_t,
    pub __sdidinit: lang_items::c_int,
    pub __cleanup: std::option::Option<unsafe extern "C" fn(arg1: *mut _reent)>,
    pub _result: *mut _Bigint,
    pub _result_k: lang_items::c_int,
    pub _p5s: *mut _Bigint,
    pub _freelist: *mut *mut _Bigint,
    pub _cvtlen: lang_items::c_int,
    pub _cvtbuf: *mut lang_items::c_char,
    pub _new: _reent__bindgen_ty_1,
    pub _atexit: *mut _atexit,
    pub _atexit0: _atexit,
    pub _sig_func: *mut std::option::Option<unsafe extern "C" fn(arg1: lang_items::c_int)>,
    pub __sglue: _glue,
    pub __sf: [__FILE; 3usize],
    pub deviceData: *mut lang_items::c_void,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union _reent__bindgen_ty_1 {
    pub _reent: _reent__bindgen_ty_1__bindgen_ty_1,
    pub _unused: _reent__bindgen_ty_1__bindgen_ty_2,
    _bindgen_union_align: [u64; 45usize],
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _reent__bindgen_ty_1__bindgen_ty_1 {
    pub _unused_rand: lang_items::c_uint,
    pub _strtok_last: *mut lang_items::c_char,
    pub _asctime_buf: [lang_items::c_char; 26usize],
    pub _localtime_buf: __tm,
    pub _gamma_signgam: lang_items::c_int,
    pub _rand_next: lang_items::c_ulonglong,
    pub _r48: _rand48,
    pub _mblen_state: _mbstate_t,
    pub _mbtowc_state: _mbstate_t,
    pub _wctomb_state: _mbstate_t,
    pub _l64a_buf: [lang_items::c_char; 8usize],
    pub _signal_buf: [lang_items::c_char; 24usize],
    pub _getdate_err: lang_items::c_int,
    pub _mbrlen_state: _mbstate_t,
    pub _mbrtowc_state: _mbstate_t,
    pub _mbsrtowcs_state: _mbstate_t,
    pub _wcrtomb_state: _mbstate_t,
    pub _wcsrtombs_state: _mbstate_t,
    pub _h_errno: lang_items::c_int,
}
#[test]
fn bindgen_test_layout__reent__bindgen_ty_1__bindgen_ty_1() {
    assert_eq!(
        std::mem::size_of::<_reent__bindgen_ty_1__bindgen_ty_1>(),
        216usize,
        concat!("Size of: ", stringify!(_reent__bindgen_ty_1__bindgen_ty_1))
    );
    assert_eq!(
        std::mem::align_of::<_reent__bindgen_ty_1__bindgen_ty_1>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(_reent__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(std::ptr::null::<_reent__bindgen_ty_1__bindgen_ty_1>()))._unused_rand as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_reent__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(_unused_rand)
        )
    );
    assert_eq!(
        unsafe {
            &(*(std::ptr::null::<_reent__bindgen_ty_1__bindgen_ty_1>()))._strtok_last as *const _
                as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_reent__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(_strtok_last)
        )
    );
    assert_eq!(
        unsafe {
            &(*(std::ptr::null::<_reent__bindgen_ty_1__bindgen_ty_1>()))._asctime_buf as *const _
                as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_reent__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(_asctime_buf)
        )
    );
    assert_eq!(
        unsafe {
            &(*(std::ptr::null::<_reent__bindgen_ty_1__bindgen_ty_1>()))._localtime_buf
                as *const _ as usize
        },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(_reent__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(_localtime_buf)
        )
    );
    assert_eq!(
        unsafe {
            &(*(std::ptr::null::<_reent__bindgen_ty_1__bindgen_ty_1>()))._gamma_signgam
                as *const _ as usize
        },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(_reent__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(_gamma_signgam)
        )
    );
    assert_eq!(
        unsafe {
            &(*(std::ptr::null::<_reent__bindgen_ty_1__bindgen_ty_1>()))._rand_next as *const _
                as usize
        },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(_reent__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(_rand_next)
        )
    );
    assert_eq!(
        unsafe {
            &(*(std::ptr::null::<_reent__bindgen_ty_1__bindgen_ty_1>()))._r48 as *const _
                as usize
        },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(_reent__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(_r48)
        )
    );
    assert_eq!(
        unsafe {
            &(*(std::ptr::null::<_reent__bindgen_ty_1__bindgen_ty_1>()))._mblen_state as *const _
                as usize
        },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(_reent__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(_mblen_state)
        )
    );
    assert_eq!(
        unsafe {
            &(*(std::ptr::null::<_reent__bindgen_ty_1__bindgen_ty_1>()))._mbtowc_state
                as *const _ as usize
        },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(_reent__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(_mbtowc_state)
        )
    );
    assert_eq!(
        unsafe {
            &(*(std::ptr::null::<_reent__bindgen_ty_1__bindgen_ty_1>()))._wctomb_state
                as *const _ as usize
        },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(_reent__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(_wctomb_state)
        )
    );
    assert_eq!(
        unsafe {
            &(*(std::ptr::null::<_reent__bindgen_ty_1__bindgen_ty_1>()))._l64a_buf as *const _
                as usize
        },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(_reent__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(_l64a_buf)
        )
    );
    assert_eq!(
        unsafe {
            &(*(std::ptr::null::<_reent__bindgen_ty_1__bindgen_ty_1>()))._signal_buf as *const _
                as usize
        },
        144usize,
        concat!(
            "Offset of field: ",
            stringify!(_reent__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(_signal_buf)
        )
    );
    assert_eq!(
        unsafe {
            &(*(std::ptr::null::<_reent__bindgen_ty_1__bindgen_ty_1>()))._getdate_err as *const _
                as usize
        },
        168usize,
        concat!(
            "Offset of field: ",
            stringify!(_reent__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(_getdate_err)
        )
    );
    assert_eq!(
        unsafe {
            &(*(std::ptr::null::<_reent__bindgen_ty_1__bindgen_ty_1>()))._mbrlen_state
                as *const _ as usize
        },
        172usize,
        concat!(
            "Offset of field: ",
            stringify!(_reent__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(_mbrlen_state)
        )
    );
    assert_eq!(
        unsafe {
            &(*(std::ptr::null::<_reent__bindgen_ty_1__bindgen_ty_1>()))._mbrtowc_state
                as *const _ as usize
        },
        180usize,
        concat!(
            "Offset of field: ",
            stringify!(_reent__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(_mbrtowc_state)
        )
    );
    assert_eq!(
        unsafe {
            &(*(std::ptr::null::<_reent__bindgen_ty_1__bindgen_ty_1>()))._mbsrtowcs_state
                as *const _ as usize
        },
        188usize,
        concat!(
            "Offset of field: ",
            stringify!(_reent__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(_mbsrtowcs_state)
        )
    );
    assert_eq!(
        unsafe {
            &(*(std::ptr::null::<_reent__bindgen_ty_1__bindgen_ty_1>()))._wcrtomb_state
                as *const _ as usize
        },
        196usize,
        concat!(
            "Offset of field: ",
            stringify!(_reent__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(_wcrtomb_state)
        )
    );
    assert_eq!(
        unsafe {
            &(*(std::ptr::null::<_reent__bindgen_ty_1__bindgen_ty_1>()))._wcsrtombs_state
                as *const _ as usize
        },
        204usize,
        concat!(
            "Offset of field: ",
            stringify!(_reent__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(_wcsrtombs_state)
        )
    );
    assert_eq!(
        unsafe {
            &(*(std::ptr::null::<_reent__bindgen_ty_1__bindgen_ty_1>()))._h_errno as *const _
                as usize
        },
        212usize,
        concat!(
            "Offset of field: ",
            stringify!(_reent__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(_h_errno)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _reent__bindgen_ty_1__bindgen_ty_2 {
    pub _nextf: [*mut lang_items::c_uchar; 30usize],
    pub _nmalloc: [lang_items::c_uint; 30usize],
}
#[test]
fn bindgen_test_layout__reent__bindgen_ty_1__bindgen_ty_2() {
    assert_eq!(
        std::mem::size_of::<_reent__bindgen_ty_1__bindgen_ty_2>(),
        360usize,
        concat!("Size of: ", stringify!(_reent__bindgen_ty_1__bindgen_ty_2))
    );
    assert_eq!(
        std::mem::align_of::<_reent__bindgen_ty_1__bindgen_ty_2>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(_reent__bindgen_ty_1__bindgen_ty_2)
        )
    );
    assert_eq!(
        unsafe {
            &(*(std::ptr::null::<_reent__bindgen_ty_1__bindgen_ty_2>()))._nextf as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_reent__bindgen_ty_1__bindgen_ty_2),
            "::",
            stringify!(_nextf)
        )
    );
    assert_eq!(
        unsafe {
            &(*(std::ptr::null::<_reent__bindgen_ty_1__bindgen_ty_2>()))._nmalloc as *const _
                as usize
        },
        240usize,
        concat!(
            "Offset of field: ",
            stringify!(_reent__bindgen_ty_1__bindgen_ty_2),
            "::",
            stringify!(_nmalloc)
        )
    );
}
#[test]
fn bindgen_test_layout__reent__bindgen_ty_1() {
    assert_eq!(
        std::mem::size_of::<_reent__bindgen_ty_1>(),
        360usize,
        concat!("Size of: ", stringify!(_reent__bindgen_ty_1))
    );
    assert_eq!(
        std::mem::align_of::<_reent__bindgen_ty_1>(),
        8usize,
        concat!("Alignment of ", stringify!(_reent__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { &(*(std::ptr::null::<_reent__bindgen_ty_1>()))._reent as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_reent__bindgen_ty_1),
            "::",
            stringify!(_reent)
        )
    );
    assert_eq!(
        unsafe { &(*(std::ptr::null::<_reent__bindgen_ty_1>()))._unused as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_reent__bindgen_ty_1),
            "::",
            stringify!(_unused)
        )
    );
}
#[test]
fn bindgen_test_layout__reent() {
    assert_eq!(
        std::mem::size_of::<_reent>(),
        1896usize,
        concat!("Size of: ", stringify!(_reent))
    );
    assert_eq!(
        std::mem::align_of::<_reent>(),
        8usize,
        concat!("Alignment of ", stringify!(_reent))
    );
    assert_eq!(
        unsafe { &(*(std::ptr::null::<_reent>()))._errno as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_reent),
            "::",
            stringify!(_errno)
        )
    );
    assert_eq!(
        unsafe { &(*(std::ptr::null::<_reent>()))._stdin as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_reent),
            "::",
            stringify!(_stdin)
        )
    );
    assert_eq!(
        unsafe { &(*(std::ptr::null::<_reent>()))._stdout as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_reent),
            "::",
            stringify!(_stdout)
        )
    );
    assert_eq!(
        unsafe { &(*(std::ptr::null::<_reent>()))._stderr as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_reent),
            "::",
            stringify!(_stderr)
        )
    );
    assert_eq!(
        unsafe { &(*(std::ptr::null::<_reent>()))._inc as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(_reent),
            "::",
            stringify!(_inc)
        )
    );
    assert_eq!(
        unsafe { &(*(std::ptr::null::<_reent>()))._emergency as *const _ as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(_reent),
            "::",
            stringify!(_emergency)
        )
    );
    assert_eq!(
        unsafe {
            &(*(std::ptr::null::<_reent>()))._unspecified_locale_info as *const _ as usize
        },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(_reent),
            "::",
            stringify!(_unspecified_locale_info)
        )
    );
    assert_eq!(
        unsafe { &(*(std::ptr::null::<_reent>()))._locale as *const _ as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(_reent),
            "::",
            stringify!(_locale)
        )
    );
    assert_eq!(
        unsafe { &(*(std::ptr::null::<_reent>())).__sdidinit as *const _ as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(_reent),
            "::",
            stringify!(__sdidinit)
        )
    );
    assert_eq!(
        unsafe { &(*(std::ptr::null::<_reent>())).__cleanup as *const _ as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(_reent),
            "::",
            stringify!(__cleanup)
        )
    );
    assert_eq!(
        unsafe { &(*(std::ptr::null::<_reent>()))._result as *const _ as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(_reent),
            "::",
            stringify!(_result)
        )
    );
    assert_eq!(
        unsafe { &(*(std::ptr::null::<_reent>()))._result_k as *const _ as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(_reent),
            "::",
            stringify!(_result_k)
        )
    );
    assert_eq!(
        unsafe { &(*(std::ptr::null::<_reent>()))._p5s as *const _ as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(_reent),
            "::",
            stringify!(_p5s)
        )
    );
    assert_eq!(
        unsafe { &(*(std::ptr::null::<_reent>()))._freelist as *const _ as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(_reent),
            "::",
            stringify!(_freelist)
        )
    );
    assert_eq!(
        unsafe { &(*(std::ptr::null::<_reent>()))._cvtlen as *const _ as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(_reent),
            "::",
            stringify!(_cvtlen)
        )
    );
    assert_eq!(
        unsafe { &(*(std::ptr::null::<_reent>()))._cvtbuf as *const _ as usize },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(_reent),
            "::",
            stringify!(_cvtbuf)
        )
    );
    assert_eq!(
        unsafe { &(*(std::ptr::null::<_reent>()))._new as *const _ as usize },
        144usize,
        concat!(
            "Offset of field: ",
            stringify!(_reent),
            "::",
            stringify!(_new)
        )
    );
    assert_eq!(
        unsafe { &(*(std::ptr::null::<_reent>()))._atexit as *const _ as usize },
        504usize,
        concat!(
            "Offset of field: ",
            stringify!(_reent),
            "::",
            stringify!(_atexit)
        )
    );
    assert_eq!(
        unsafe { &(*(std::ptr::null::<_reent>()))._atexit0 as *const _ as usize },
        512usize,
        concat!(
            "Offset of field: ",
            stringify!(_reent),
            "::",
            stringify!(_atexit0)
        )
    );
    assert_eq!(
        unsafe { &(*(std::ptr::null::<_reent>()))._sig_func as *const _ as usize },
        1304usize,
        concat!(
            "Offset of field: ",
            stringify!(_reent),
            "::",
            stringify!(_sig_func)
        )
    );
    assert_eq!(
        unsafe { &(*(std::ptr::null::<_reent>())).__sglue as *const _ as usize },
        1312usize,
        concat!(
            "Offset of field: ",
            stringify!(_reent),
            "::",
            stringify!(__sglue)
        )
    );
    assert_eq!(
        unsafe { &(*(std::ptr::null::<_reent>())).__sf as *const _ as usize },
        1336usize,
        concat!(
            "Offset of field: ",
            stringify!(_reent),
            "::",
            stringify!(__sf)
        )
    );
    assert_eq!(
        unsafe { &(*(std::ptr::null::<_reent>())).deviceData as *const _ as usize },
        1888usize,
        concat!(
            "Offset of field: ",
            stringify!(_reent),
            "::",
            stringify!(deviceData)
        )
    );
}
extern "C" {
    pub static mut _impure_ptr: *mut _reent;
}
extern "C" {
    pub static mut _global_impure_ptr: *mut _reent;
}
extern "C" {
    pub fn _reclaim_reent(arg1: *mut _reent);
}
extern "C" {
    pub fn __getreent() -> *mut _reent;
}
extern "C" {
    pub fn __errno() -> *mut lang_items::c_int;
}
extern "C" {
    pub static mut _sys_errlist: [*const lang_items::c_char; 0usize];
}
extern "C" {
    pub static mut _sys_nerr: lang_items::c_int;
}
pub type locale_t = *mut __locale_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct imaxdiv_t {
    pub quot: intmax_t,
    pub rem: intmax_t,
}
#[test]
fn bindgen_test_layout_imaxdiv_t() {
    assert_eq!(
        std::mem::size_of::<imaxdiv_t>(),
        16usize,
        concat!("Size of: ", stringify!(imaxdiv_t))
    );
    assert_eq!(
        std::mem::align_of::<imaxdiv_t>(),
        8usize,
        concat!("Alignment of ", stringify!(imaxdiv_t))
    );
    assert_eq!(
        unsafe { &(*(std::ptr::null::<imaxdiv_t>())).quot as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(imaxdiv_t),
            "::",
            stringify!(quot)
        )
    );
    assert_eq!(
        unsafe { &(*(std::ptr::null::<imaxdiv_t>())).rem as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(imaxdiv_t),
            "::",
            stringify!(rem)
        )
    );
}
extern "C" {
    pub fn imaxabs(j: intmax_t) -> intmax_t;
}
extern "C" {
    pub fn imaxdiv(numer: intmax_t, denomer: intmax_t) -> imaxdiv_t;
}
extern "C" {
    pub fn strtoimax(
        arg1: *const lang_items::c_char,
        arg2: *mut *mut lang_items::c_char,
        arg3: lang_items::c_int,
    ) -> intmax_t;
}
extern "C" {
    pub fn _strtoimax_r(
        arg1: *mut _reent,
        arg2: *const lang_items::c_char,
        arg3: *mut *mut lang_items::c_char,
        arg4: lang_items::c_int,
    ) -> intmax_t;
}
extern "C" {
    pub fn strtoumax(
        arg1: *const lang_items::c_char,
        arg2: *mut *mut lang_items::c_char,
        arg3: lang_items::c_int,
    ) -> uintmax_t;
}
extern "C" {
    pub fn _strtoumax_r(
        arg1: *mut _reent,
        arg2: *const lang_items::c_char,
        arg3: *mut *mut lang_items::c_char,
        arg4: lang_items::c_int,
    ) -> uintmax_t;
}
extern "C" {
    pub fn wcstoimax(
        arg1: *const wchar_t,
        arg2: *mut *mut wchar_t,
        arg3: lang_items::c_int,
    ) -> intmax_t;
}
extern "C" {
    pub fn _wcstoimax_r(
        arg1: *mut _reent,
        arg2: *const wchar_t,
        arg3: *mut *mut wchar_t,
        arg4: lang_items::c_int,
    ) -> intmax_t;
}
extern "C" {
    pub fn wcstoumax(
        arg1: *const wchar_t,
        arg2: *mut *mut wchar_t,
        arg3: lang_items::c_int,
    ) -> uintmax_t;
}
extern "C" {
    pub fn _wcstoumax_r(
        arg1: *mut _reent,
        arg2: *const wchar_t,
        arg3: *mut *mut wchar_t,
        arg4: lang_items::c_int,
    ) -> uintmax_t;
}
extern "C" {
    pub fn strtoimax_l(
        arg1: *const lang_items::c_char,
        _restrict: *mut *mut lang_items::c_char,
        arg2: lang_items::c_int,
        arg3: locale_t,
    ) -> intmax_t;
}
extern "C" {
    pub fn strtoumax_l(
        arg1: *const lang_items::c_char,
        _restrict: *mut *mut lang_items::c_char,
        arg2: lang_items::c_int,
        arg3: locale_t,
    ) -> uintmax_t;
}
extern "C" {
    pub fn wcstoimax_l(
        arg1: *const wchar_t,
        _restrict: *mut *mut wchar_t,
        arg2: lang_items::c_int,
        arg3: locale_t,
    ) -> intmax_t;
}
extern "C" {
    pub fn wcstoumax_l(
        arg1: *const wchar_t,
        _restrict: *mut *mut wchar_t,
        arg2: lang_items::c_int,
        arg3: locale_t,
    ) -> uintmax_t;
}
extern "C" {
    pub fn atan(arg1: f64) -> f64;
}
extern "C" {
    pub fn cos(arg1: f64) -> f64;
}
extern "C" {
    pub fn sin(arg1: f64) -> f64;
}
extern "C" {
    pub fn tan(arg1: f64) -> f64;
}
extern "C" {
    pub fn tanh(arg1: f64) -> f64;
}
extern "C" {
    pub fn frexp(arg1: f64, arg2: *mut lang_items::c_int) -> f64;
}
extern "C" {
    pub fn modf(arg1: f64, arg2: *mut f64) -> f64;
}
extern "C" {
    pub fn ceil(arg1: f64) -> f64;
}
extern "C" {
    pub fn fabs(arg1: f64) -> f64;
}
extern "C" {
    pub fn floor(arg1: f64) -> f64;
}
extern "C" {
    pub fn acos(arg1: f64) -> f64;
}
extern "C" {
    pub fn asin(arg1: f64) -> f64;
}
extern "C" {
    pub fn atan2(arg1: f64, arg2: f64) -> f64;
}
extern "C" {
    pub fn cosh(arg1: f64) -> f64;
}
extern "C" {
    pub fn sinh(arg1: f64) -> f64;
}
extern "C" {
    pub fn exp(arg1: f64) -> f64;
}
extern "C" {
    pub fn ldexp(arg1: f64, arg2: lang_items::c_int) -> f64;
}
extern "C" {
    pub fn log(arg1: f64) -> f64;
}
extern "C" {
    pub fn log10(arg1: f64) -> f64;
}
extern "C" {
    pub fn pow(arg1: f64, arg2: f64) -> f64;
}
extern "C" {
    pub fn sqrt(arg1: f64) -> f64;
}
extern "C" {
    pub fn fmod(arg1: f64, arg2: f64) -> f64;
}
extern "C" {
    pub fn finite(arg1: f64) -> lang_items::c_int;
}
extern "C" {
    pub fn finitef(arg1: f32) -> lang_items::c_int;
}
extern "C" {
    pub fn finitel(arg1: f64) -> lang_items::c_int;
}
extern "C" {
    pub fn isinff(arg1: f32) -> lang_items::c_int;
}
extern "C" {
    pub fn isnanf(arg1: f32) -> lang_items::c_int;
}
extern "C" {
    pub fn isinf(arg1: f64) -> lang_items::c_int;
}
extern "C" {
    pub fn isnan(arg1: f64) -> lang_items::c_int;
}
pub type float_t = f32;
pub type double_t = f64;
extern "C" {
    pub fn __isinff(x: f32) -> lang_items::c_int;
}
extern "C" {
    pub fn __isinfd(x: f64) -> lang_items::c_int;
}
extern "C" {
    pub fn __isnanf(x: f32) -> lang_items::c_int;
}
extern "C" {
    pub fn __isnand(x: f64) -> lang_items::c_int;
}
extern "C" {
    pub fn __fpclassifyf(x: f32) -> lang_items::c_int;
}
extern "C" {
    pub fn __fpclassifyd(x: f64) -> lang_items::c_int;
}
extern "C" {
    pub fn __signbitf(x: f32) -> lang_items::c_int;
}
extern "C" {
    pub fn __signbitd(x: f64) -> lang_items::c_int;
}
extern "C" {
    pub fn infinity() -> f64;
}
extern "C" {
    pub fn nan(arg1: *const lang_items::c_char) -> f64;
}
extern "C" {
    pub fn copysign(arg1: f64, arg2: f64) -> f64;
}
extern "C" {
    pub fn logb(arg1: f64) -> f64;
}
extern "C" {
    pub fn ilogb(arg1: f64) -> lang_items::c_int;
}
extern "C" {
    pub fn asinh(arg1: f64) -> f64;
}
extern "C" {
    pub fn cbrt(arg1: f64) -> f64;
}
extern "C" {
    pub fn nextafter(arg1: f64, arg2: f64) -> f64;
}
extern "C" {
    pub fn rint(arg1: f64) -> f64;
}
extern "C" {
    pub fn scalbn(arg1: f64, arg2: lang_items::c_int) -> f64;
}
extern "C" {
    pub fn exp2(arg1: f64) -> f64;
}
extern "C" {
    pub fn scalbln(arg1: f64, arg2: lang_items::c_long) -> f64;
}
extern "C" {
    pub fn tgamma(arg1: f64) -> f64;
}
extern "C" {
    pub fn nearbyint(arg1: f64) -> f64;
}
extern "C" {
    pub fn lrint(arg1: f64) -> lang_items::c_long;
}
extern "C" {
    pub fn llrint(arg1: f64) -> lang_items::c_longlong;
}
extern "C" {
    pub fn round(arg1: f64) -> f64;
}
extern "C" {
    pub fn lround(arg1: f64) -> lang_items::c_long;
}
extern "C" {
    pub fn llround(arg1: f64) -> lang_items::c_longlong;
}
extern "C" {
    pub fn trunc(arg1: f64) -> f64;
}
extern "C" {
    pub fn remquo(arg1: f64, arg2: f64, arg3: *mut lang_items::c_int) -> f64;
}
extern "C" {
    pub fn fdim(arg1: f64, arg2: f64) -> f64;
}
extern "C" {
    pub fn fmax(arg1: f64, arg2: f64) -> f64;
}
extern "C" {
    pub fn fmin(arg1: f64, arg2: f64) -> f64;
}
extern "C" {
    pub fn fma(arg1: f64, arg2: f64, arg3: f64) -> f64;
}
extern "C" {
    pub fn log1p(arg1: f64) -> f64;
}
extern "C" {
    pub fn expm1(arg1: f64) -> f64;
}
extern "C" {
    pub fn acosh(arg1: f64) -> f64;
}
extern "C" {
    pub fn atanh(arg1: f64) -> f64;
}
extern "C" {
    pub fn remainder(arg1: f64, arg2: f64) -> f64;
}
extern "C" {
    pub fn gamma(arg1: f64) -> f64;
}
extern "C" {
    pub fn lgamma(arg1: f64) -> f64;
}
extern "C" {
    pub fn erf(arg1: f64) -> f64;
}
extern "C" {
    pub fn erfc(arg1: f64) -> f64;
}
extern "C" {
    pub fn log2(arg1: f64) -> f64;
}
extern "C" {
    pub fn hypot(arg1: f64, arg2: f64) -> f64;
}
extern "C" {
    pub fn atanf(arg1: f32) -> f32;
}
extern "C" {
    pub fn cosf(arg1: f32) -> f32;
}
extern "C" {
    pub fn sinf(arg1: f32) -> f32;
}
extern "C" {
    pub fn tanf(arg1: f32) -> f32;
}
extern "C" {
    pub fn tanhf(arg1: f32) -> f32;
}
extern "C" {
    pub fn frexpf(arg1: f32, arg2: *mut lang_items::c_int) -> f32;
}
extern "C" {
    pub fn modff(arg1: f32, arg2: *mut f32) -> f32;
}
extern "C" {
    pub fn ceilf(arg1: f32) -> f32;
}
extern "C" {
    pub fn fabsf(arg1: f32) -> f32;
}
extern "C" {
    pub fn floorf(arg1: f32) -> f32;
}
extern "C" {
    pub fn acosf(arg1: f32) -> f32;
}
extern "C" {
    pub fn asinf(arg1: f32) -> f32;
}
extern "C" {
    pub fn atan2f(arg1: f32, arg2: f32) -> f32;
}
extern "C" {
    pub fn coshf(arg1: f32) -> f32;
}
extern "C" {
    pub fn sinhf(arg1: f32) -> f32;
}
extern "C" {
    pub fn expf(arg1: f32) -> f32;
}
extern "C" {
    pub fn ldexpf(arg1: f32, arg2: lang_items::c_int) -> f32;
}
extern "C" {
    pub fn logf(arg1: f32) -> f32;
}
extern "C" {
    pub fn log10f(arg1: f32) -> f32;
}
extern "C" {
    pub fn powf(arg1: f32, arg2: f32) -> f32;
}
extern "C" {
    pub fn sqrtf(arg1: f32) -> f32;
}
extern "C" {
    pub fn fmodf(arg1: f32, arg2: f32) -> f32;
}
extern "C" {
    pub fn exp2f(arg1: f32) -> f32;
}
extern "C" {
    pub fn scalblnf(arg1: f32, arg2: lang_items::c_long) -> f32;
}
extern "C" {
    pub fn tgammaf(arg1: f32) -> f32;
}
extern "C" {
    pub fn nearbyintf(arg1: f32) -> f32;
}
extern "C" {
    pub fn lrintf(arg1: f32) -> lang_items::c_long;
}
extern "C" {
    pub fn llrintf(arg1: f32) -> lang_items::c_longlong;
}
extern "C" {
    pub fn roundf(arg1: f32) -> f32;
}
extern "C" {
    pub fn lroundf(arg1: f32) -> lang_items::c_long;
}
extern "C" {
    pub fn llroundf(arg1: f32) -> lang_items::c_longlong;
}
extern "C" {
    pub fn truncf(arg1: f32) -> f32;
}
extern "C" {
    pub fn remquof(arg1: f32, arg2: f32, arg3: *mut lang_items::c_int) -> f32;
}
extern "C" {
    pub fn fdimf(arg1: f32, arg2: f32) -> f32;
}
extern "C" {
    pub fn fmaxf(arg1: f32, arg2: f32) -> f32;
}
extern "C" {
    pub fn fminf(arg1: f32, arg2: f32) -> f32;
}
extern "C" {
    pub fn fmaf(arg1: f32, arg2: f32, arg3: f32) -> f32;
}
extern "C" {
    pub fn infinityf() -> f32;
}
extern "C" {
    pub fn nanf(arg1: *const lang_items::c_char) -> f32;
}
extern "C" {
    pub fn copysignf(arg1: f32, arg2: f32) -> f32;
}
extern "C" {
    pub fn logbf(arg1: f32) -> f32;
}
extern "C" {
    pub fn ilogbf(arg1: f32) -> lang_items::c_int;
}
extern "C" {
    pub fn asinhf(arg1: f32) -> f32;
}
extern "C" {
    pub fn cbrtf(arg1: f32) -> f32;
}
extern "C" {
    pub fn nextafterf(arg1: f32, arg2: f32) -> f32;
}
extern "C" {
    pub fn rintf(arg1: f32) -> f32;
}
extern "C" {
    pub fn scalbnf(arg1: f32, arg2: lang_items::c_int) -> f32;
}
extern "C" {
    pub fn log1pf(arg1: f32) -> f32;
}
extern "C" {
    pub fn expm1f(arg1: f32) -> f32;
}
extern "C" {
    pub fn acoshf(arg1: f32) -> f32;
}
extern "C" {
    pub fn atanhf(arg1: f32) -> f32;
}
extern "C" {
    pub fn remainderf(arg1: f32, arg2: f32) -> f32;
}
extern "C" {
    pub fn gammaf(arg1: f32) -> f32;
}
extern "C" {
    pub fn lgammaf(arg1: f32) -> f32;
}
extern "C" {
    pub fn erff(arg1: f32) -> f32;
}
extern "C" {
    pub fn erfcf(arg1: f32) -> f32;
}
extern "C" {
    pub fn log2f(arg1: f32) -> f32;
}
extern "C" {
    pub fn hypotf(arg1: f32, arg2: f32) -> f32;
}
extern "C" {
    pub fn hypotl(arg1: f64, arg2: f64) -> f64;
}
extern "C" {
    pub fn sqrtl(arg1: f64) -> f64;
}
extern "C" {
    pub fn drem(arg1: f64, arg2: f64) -> f64;
}
extern "C" {
    pub fn dremf(arg1: f32, arg2: f32) -> f32;
}
extern "C" {
    pub fn gamma_r(arg1: f64, arg2: *mut lang_items::c_int) -> f64;
}
extern "C" {
    pub fn lgamma_r(arg1: f64, arg2: *mut lang_items::c_int) -> f64;
}
extern "C" {
    pub fn gammaf_r(arg1: f32, arg2: *mut lang_items::c_int) -> f32;
}
extern "C" {
    pub fn lgammaf_r(arg1: f32, arg2: *mut lang_items::c_int) -> f32;
}
extern "C" {
    pub fn y0(arg1: f64) -> f64;
}
extern "C" {
    pub fn y1(arg1: f64) -> f64;
}
extern "C" {
    pub fn yn(arg1: lang_items::c_int, arg2: f64) -> f64;
}
extern "C" {
    pub fn j0(arg1: f64) -> f64;
}
extern "C" {
    pub fn j1(arg1: f64) -> f64;
}
extern "C" {
    pub fn jn(arg1: lang_items::c_int, arg2: f64) -> f64;
}
extern "C" {
    pub fn y0f(arg1: f32) -> f32;
}
extern "C" {
    pub fn y1f(arg1: f32) -> f32;
}
extern "C" {
    pub fn ynf(arg1: lang_items::c_int, arg2: f32) -> f32;
}
extern "C" {
    pub fn j0f(arg1: f32) -> f32;
}
extern "C" {
    pub fn j1f(arg1: f32) -> f32;
}
extern "C" {
    pub fn jnf(arg1: lang_items::c_int, arg2: f32) -> f32;
}
extern "C" {
    pub fn __signgam() -> *mut lang_items::c_int;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct exception {
    pub type_: lang_items::c_int,
    pub name: *mut lang_items::c_char,
    pub arg1: f64,
    pub arg2: f64,
    pub retval: f64,
    pub err: lang_items::c_int,
}
#[test]
fn bindgen_test_layout_exception() {
    assert_eq!(
        std::mem::size_of::<exception>(),
        48usize,
        concat!("Size of: ", stringify!(exception))
    );
    assert_eq!(
        std::mem::align_of::<exception>(),
        8usize,
        concat!("Alignment of ", stringify!(exception))
    );
    assert_eq!(
        unsafe { &(*(std::ptr::null::<exception>())).type_ as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(exception),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { &(*(std::ptr::null::<exception>())).name as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(exception),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe { &(*(std::ptr::null::<exception>())).arg1 as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(exception),
            "::",
            stringify!(arg1)
        )
    );
    assert_eq!(
        unsafe { &(*(std::ptr::null::<exception>())).arg2 as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(exception),
            "::",
            stringify!(arg2)
        )
    );
    assert_eq!(
        unsafe { &(*(std::ptr::null::<exception>())).retval as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(exception),
            "::",
            stringify!(retval)
        )
    );
    assert_eq!(
        unsafe { &(*(std::ptr::null::<exception>())).err as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(exception),
            "::",
            stringify!(err)
        )
    );
}
extern "C" {
    pub fn matherr(e: *mut exception) -> lang_items::c_int;
}
pub const __fdlibm_version___fdlibm_ieee: __fdlibm_version = -1;
pub const __fdlibm_version___fdlibm_svid: __fdlibm_version = 0;
pub const __fdlibm_version___fdlibm_xopen: __fdlibm_version = 1;
pub const __fdlibm_version___fdlibm_posix: __fdlibm_version = 2;
pub type __fdlibm_version = i32;
extern "C" {
    pub static mut __fdlib_version: __fdlibm_version;
}
pub type __gnuc_va_list = __builtin_va_list;
pub type va_list = __gnuc_va_list;
pub type u_int8_t = __uint8_t;
pub type u_int16_t = __uint16_t;
pub type u_int32_t = __uint32_t;
pub type u_int64_t = __uint64_t;
pub type register_t = lang_items::c_int;
pub type __sigset_t = lang_items::c_ulong;
pub type suseconds_t = __suseconds_t;
pub type time_t = lang_items::c_long;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct timeval {
    pub tv_sec: time_t,
    pub tv_usec: suseconds_t,
}
#[test]
fn bindgen_test_layout_timeval() {
    assert_eq!(
        std::mem::size_of::<timeval>(),
        16usize,
        concat!("Size of: ", stringify!(timeval))
    );
    assert_eq!(
        std::mem::align_of::<timeval>(),
        8usize,
        concat!("Alignment of ", stringify!(timeval))
    );
    assert_eq!(
        unsafe { &(*(std::ptr::null::<timeval>())).tv_sec as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(timeval),
            "::",
            stringify!(tv_sec)
        )
    );
    assert_eq!(
        unsafe { &(*(std::ptr::null::<timeval>())).tv_usec as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(timeval),
            "::",
            stringify!(tv_usec)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct timespec {
    pub tv_sec: time_t,
    pub tv_nsec: lang_items::c_long,
}
#[test]
fn bindgen_test_layout_timespec() {
    assert_eq!(
        std::mem::size_of::<timespec>(),
        16usize,
        concat!("Size of: ", stringify!(timespec))
    );
    assert_eq!(
        std::mem::align_of::<timespec>(),
        8usize,
        concat!("Alignment of ", stringify!(timespec))
    );
    assert_eq!(
        unsafe { &(*(std::ptr::null::<timespec>())).tv_sec as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(timespec),
            "::",
            stringify!(tv_sec)
        )
    );
    assert_eq!(
        unsafe { &(*(std::ptr::null::<timespec>())).tv_nsec as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(timespec),
            "::",
            stringify!(tv_nsec)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct itimerspec {
    pub it_interval: timespec,
    pub it_value: timespec,
}
#[test]
fn bindgen_test_layout_itimerspec() {
    assert_eq!(
        std::mem::size_of::<itimerspec>(),
        32usize,
        concat!("Size of: ", stringify!(itimerspec))
    );
    assert_eq!(
        std::mem::align_of::<itimerspec>(),
        8usize,
        concat!("Alignment of ", stringify!(itimerspec))
    );
    assert_eq!(
        unsafe { &(*(std::ptr::null::<itimerspec>())).it_interval as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(itimerspec),
            "::",
            stringify!(it_interval)
        )
    );
    assert_eq!(
        unsafe { &(*(std::ptr::null::<itimerspec>())).it_value as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(itimerspec),
            "::",
            stringify!(it_value)
        )
    );
}
pub type sigset_t = __sigset_t;
pub type fd_mask = lang_items::c_ulong;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _types_fd_set {
    pub fds_bits: [fd_mask; 1usize],
}
#[test]
fn bindgen_test_layout__types_fd_set() {
    assert_eq!(
        std::mem::size_of::<_types_fd_set>(),
        8usize,
        concat!("Size of: ", stringify!(_types_fd_set))
    );
    assert_eq!(
        std::mem::align_of::<_types_fd_set>(),
        8usize,
        concat!("Alignment of ", stringify!(_types_fd_set))
    );
    assert_eq!(
        unsafe { &(*(std::ptr::null::<_types_fd_set>())).fds_bits as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_types_fd_set),
            "::",
            stringify!(fds_bits)
        )
    );
}
extern "C" {
    pub fn select(
        __n: lang_items::c_int,
        __readfds: *mut _types_fd_set,
        __writefds: *mut _types_fd_set,
        __exceptfds: *mut _types_fd_set,
        __timeout: *mut timeval,
    ) -> lang_items::c_int;
}
extern "C" {
    pub fn pselect(
        __n: lang_items::c_int,
        __readfds: *mut _types_fd_set,
        __writefds: *mut _types_fd_set,
        __exceptfds: *mut _types_fd_set,
        __timeout: *const timespec,
        __set: *const sigset_t,
    ) -> lang_items::c_int;
}
pub type in_addr_t = __uint32_t;
pub type in_port_t = __uint16_t;
pub type u_char = lang_items::c_uchar;
pub type u_short = lang_items::c_ushort;
pub type u_int = lang_items::c_uint;
pub type u_long = lang_items::c_ulong;
pub type ushort = lang_items::c_ushort;
pub type uint = lang_items::c_uint;
pub type ulong = lang_items::c_ulong;
pub type blkcnt_t = __blkcnt_t;
pub type blksize_t = __blksize_t;
pub type clock_t = lang_items::c_ulong;
pub type daddr_t = lang_items::c_long;
pub type caddr_t = *mut lang_items::c_char;
pub type fsblkcnt_t = __fsblkcnt_t;
pub type fsfilcnt_t = __fsfilcnt_t;
pub type id_t = __id_t;
pub type ino_t = __ino_t;
pub type off_t = __off_t;
pub type dev_t = __dev_t;
pub type uid_t = __uid_t;
pub type gid_t = __gid_t;
pub type pid_t = __pid_t;
pub type key_t = __key_t;
pub type mode_t = __mode_t;
pub type nlink_t = __nlink_t;
pub type clockid_t = __clockid_t;
pub type timer_t = __timer_t;
pub type useconds_t = __useconds_t;
pub type sbintime_t = __int64_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sched_param {
    pub sched_priority: lang_items::c_int,
}
#[test]
fn bindgen_test_layout_sched_param() {
    assert_eq!(
        std::mem::size_of::<sched_param>(),
        4usize,
        concat!("Size of: ", stringify!(sched_param))
    );
    assert_eq!(
        std::mem::align_of::<sched_param>(),
        4usize,
        concat!("Alignment of ", stringify!(sched_param))
    );
    assert_eq!(
        unsafe { &(*(std::ptr::null::<sched_param>())).sched_priority as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sched_param),
            "::",
            stringify!(sched_priority)
        )
    );
}
pub type pthread_t = __uint32_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pthread_attr_t {
    pub is_initialized: lang_items::c_int,
    pub stackaddr: *mut lang_items::c_void,
    pub stacksize: lang_items::c_int,
    pub contentionscope: lang_items::c_int,
    pub inheritsched: lang_items::c_int,
    pub schedpolicy: lang_items::c_int,
    pub schedparam: sched_param,
    pub detachstate: lang_items::c_int,
}
#[test]
fn bindgen_test_layout_pthread_attr_t() {
    assert_eq!(
        std::mem::size_of::<pthread_attr_t>(),
        40usize,
        concat!("Size of: ", stringify!(pthread_attr_t))
    );
    assert_eq!(
        std::mem::align_of::<pthread_attr_t>(),
        8usize,
        concat!("Alignment of ", stringify!(pthread_attr_t))
    );
    assert_eq!(
        unsafe { &(*(std::ptr::null::<pthread_attr_t>())).is_initialized as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_attr_t),
            "::",
            stringify!(is_initialized)
        )
    );
    assert_eq!(
        unsafe { &(*(std::ptr::null::<pthread_attr_t>())).stackaddr as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_attr_t),
            "::",
            stringify!(stackaddr)
        )
    );
    assert_eq!(
        unsafe { &(*(std::ptr::null::<pthread_attr_t>())).stacksize as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_attr_t),
            "::",
            stringify!(stacksize)
        )
    );
    assert_eq!(
        unsafe { &(*(std::ptr::null::<pthread_attr_t>())).contentionscope as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_attr_t),
            "::",
            stringify!(contentionscope)
        )
    );
    assert_eq!(
        unsafe { &(*(std::ptr::null::<pthread_attr_t>())).inheritsched as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_attr_t),
            "::",
            stringify!(inheritsched)
        )
    );
    assert_eq!(
        unsafe { &(*(std::ptr::null::<pthread_attr_t>())).schedpolicy as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_attr_t),
            "::",
            stringify!(schedpolicy)
        )
    );
    assert_eq!(
        unsafe { &(*(std::ptr::null::<pthread_attr_t>())).schedparam as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_attr_t),
            "::",
            stringify!(schedparam)
        )
    );
    assert_eq!(
        unsafe { &(*(std::ptr::null::<pthread_attr_t>())).detachstate as *const _ as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_attr_t),
            "::",
            stringify!(detachstate)
        )
    );
}
pub type pthread_mutex_t = __uint32_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pthread_mutexattr_t {
    pub is_initialized: lang_items::c_int,
    pub recursive: lang_items::c_int,
}
#[test]
fn bindgen_test_layout_pthread_mutexattr_t() {
    assert_eq!(
        std::mem::size_of::<pthread_mutexattr_t>(),
        8usize,
        concat!("Size of: ", stringify!(pthread_mutexattr_t))
    );
    assert_eq!(
        std::mem::align_of::<pthread_mutexattr_t>(),
        4usize,
        concat!("Alignment of ", stringify!(pthread_mutexattr_t))
    );
    assert_eq!(
        unsafe {
            &(*(std::ptr::null::<pthread_mutexattr_t>())).is_initialized as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_mutexattr_t),
            "::",
            stringify!(is_initialized)
        )
    );
    assert_eq!(
        unsafe { &(*(std::ptr::null::<pthread_mutexattr_t>())).recursive as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_mutexattr_t),
            "::",
            stringify!(recursive)
        )
    );
}
pub type pthread_cond_t = __uint32_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pthread_condattr_t {
    pub is_initialized: lang_items::c_int,
    pub clock: clock_t,
}
#[test]
fn bindgen_test_layout_pthread_condattr_t() {
    assert_eq!(
        std::mem::size_of::<pthread_condattr_t>(),
        16usize,
        concat!("Size of: ", stringify!(pthread_condattr_t))
    );
    assert_eq!(
        std::mem::align_of::<pthread_condattr_t>(),
        8usize,
        concat!("Alignment of ", stringify!(pthread_condattr_t))
    );
    assert_eq!(
        unsafe {
            &(*(std::ptr::null::<pthread_condattr_t>())).is_initialized as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_condattr_t),
            "::",
            stringify!(is_initialized)
        )
    );
    assert_eq!(
        unsafe { &(*(std::ptr::null::<pthread_condattr_t>())).clock as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_condattr_t),
            "::",
            stringify!(clock)
        )
    );
}
pub type pthread_key_t = __uint32_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pthread_once_t {
    pub is_initialized: lang_items::c_int,
    pub init_executed: lang_items::c_int,
}
#[test]
fn bindgen_test_layout_pthread_once_t() {
    assert_eq!(
        std::mem::size_of::<pthread_once_t>(),
        8usize,
        concat!("Size of: ", stringify!(pthread_once_t))
    );
    assert_eq!(
        std::mem::align_of::<pthread_once_t>(),
        4usize,
        concat!("Alignment of ", stringify!(pthread_once_t))
    );
    assert_eq!(
        unsafe { &(*(std::ptr::null::<pthread_once_t>())).is_initialized as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_once_t),
            "::",
            stringify!(is_initialized)
        )
    );
    assert_eq!(
        unsafe { &(*(std::ptr::null::<pthread_once_t>())).init_executed as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_once_t),
            "::",
            stringify!(init_executed)
        )
    );
}
pub type FILE = __FILE;
pub type fpos_t = _fpos_t;
extern "C" {
    pub fn ctermid(arg1: *mut lang_items::c_char) -> *mut lang_items::c_char;
}
extern "C" {
    pub fn tmpfile() -> *mut FILE;
}
extern "C" {
    pub fn tmpnam(arg1: *mut lang_items::c_char) -> *mut lang_items::c_char;
}
extern "C" {
    pub fn tempnam(
        arg1: *const lang_items::c_char,
        arg2: *const lang_items::c_char,
    ) -> *mut lang_items::c_char;
}
extern "C" {
    pub fn fclose(arg1: *mut FILE) -> lang_items::c_int;
}
extern "C" {
    pub fn fflush(arg1: *mut FILE) -> lang_items::c_int;
}
extern "C" {
    pub fn freopen(
        arg1: *const lang_items::c_char,
        arg2: *const lang_items::c_char,
        arg3: *mut FILE,
    ) -> *mut FILE;
}
extern "C" {
    pub fn setbuf(arg1: *mut FILE, arg2: *mut lang_items::c_char);
}
extern "C" {
    pub fn setvbuf(
        arg1: *mut FILE,
        arg2: *mut lang_items::c_char,
        arg3: lang_items::c_int,
        arg4: usize,
    ) -> lang_items::c_int;
}
extern "C" {
    pub fn fprintf(arg1: *mut FILE, arg2: *const lang_items::c_char, ...) -> lang_items::c_int;
}
extern "C" {
    pub fn fscanf(arg1: *mut FILE, arg2: *const lang_items::c_char, ...) -> lang_items::c_int;
}
extern "C" {
    pub fn printf(arg1: *const lang_items::c_char, ...) -> lang_items::c_int;
}
extern "C" {
    pub fn scanf(arg1: *const lang_items::c_char, ...) -> lang_items::c_int;
}
extern "C" {
    pub fn sscanf(
        arg1: *const lang_items::c_char,
        arg2: *const lang_items::c_char,
        ...
    ) -> lang_items::c_int;
}
extern "C" {
    pub fn vfprintf(
        arg1: *mut FILE,
        arg2: *const lang_items::c_char,
        arg3: __gnuc_va_list,
    ) -> lang_items::c_int;
}
extern "C" {
    pub fn vprintf(arg1: *const lang_items::c_char, arg2: __gnuc_va_list) -> lang_items::c_int;
}
extern "C" {
    pub fn vsprintf(
        arg1: *mut lang_items::c_char,
        arg2: *const lang_items::c_char,
        arg3: __gnuc_va_list,
    ) -> lang_items::c_int;
}
extern "C" {
    pub fn fgetc(arg1: *mut FILE) -> lang_items::c_int;
}
extern "C" {
    pub fn fgets(
        arg1: *mut lang_items::c_char,
        arg2: lang_items::c_int,
        arg3: *mut FILE,
    ) -> *mut lang_items::c_char;
}
extern "C" {
    pub fn fputc(arg1: lang_items::c_int, arg2: *mut FILE) -> lang_items::c_int;
}
extern "C" {
    pub fn fputs(arg1: *const lang_items::c_char, arg2: *mut FILE) -> lang_items::c_int;
}
extern "C" {
    pub fn getc(arg1: *mut FILE) -> lang_items::c_int;
}
extern "C" {
    pub fn getchar() -> lang_items::c_int;
}
extern "C" {
    pub fn gets(arg1: *mut lang_items::c_char) -> *mut lang_items::c_char;
}
extern "C" {
    pub fn putc(arg1: lang_items::c_int, arg2: *mut FILE) -> lang_items::c_int;
}
extern "C" {
    pub fn putchar(arg1: lang_items::c_int) -> lang_items::c_int;
}
extern "C" {
    pub fn puts(arg1: *const lang_items::c_char) -> lang_items::c_int;
}
extern "C" {
    pub fn ungetc(arg1: lang_items::c_int, arg2: *mut FILE) -> lang_items::c_int;
}
extern "C" {
    pub fn fread(arg1: *mut lang_items::c_void, _size: usize, _n: usize, arg2: *mut FILE) -> usize;
}
extern "C" {
    pub fn fwrite(
        arg1: *const lang_items::c_void,
        _size: usize,
        _n: usize,
        arg2: *mut FILE,
    ) -> usize;
}
extern "C" {
    pub fn fgetpos(arg1: *mut FILE, arg2: *mut fpos_t) -> lang_items::c_int;
}
extern "C" {
    pub fn fseek(
        arg1: *mut FILE,
        arg2: lang_items::c_long,
        arg3: lang_items::c_int,
    ) -> lang_items::c_int;
}
extern "C" {
    pub fn fsetpos(arg1: *mut FILE, arg2: *const fpos_t) -> lang_items::c_int;
}
extern "C" {
    pub fn ftell(arg1: *mut FILE) -> lang_items::c_long;
}
extern "C" {
    pub fn rewind(arg1: *mut FILE);
}
extern "C" {
    pub fn clearerr(arg1: *mut FILE);
}
extern "C" {
    pub fn feof(arg1: *mut FILE) -> lang_items::c_int;
}
extern "C" {
    pub fn ferror(arg1: *mut FILE) -> lang_items::c_int;
}
extern "C" {
    pub fn perror(arg1: *const lang_items::c_char);
}
extern "C" {
    pub fn fopen(_name: *const lang_items::c_char, _type: *const lang_items::c_char) -> *mut FILE;
}
extern "C" {
    pub fn sprintf(
        arg1: *mut lang_items::c_char,
        arg2: *const lang_items::c_char,
        ...
    ) -> lang_items::c_int;
}
extern "C" {
    pub fn remove(arg1: *const lang_items::c_char) -> lang_items::c_int;
}
extern "C" {
    pub fn rename(
        arg1: *const lang_items::c_char,
        arg2: *const lang_items::c_char,
    ) -> lang_items::c_int;
}
extern "C" {
    pub fn fseeko(arg1: *mut FILE, arg2: off_t, arg3: lang_items::c_int) -> lang_items::c_int;
}
extern "C" {
    pub fn ftello(arg1: *mut FILE) -> off_t;
}
extern "C" {
    pub fn snprintf(
        arg1: *mut lang_items::c_char,
        arg2: usize,
        arg3: *const lang_items::c_char,
        ...
    ) -> lang_items::c_int;
}
extern "C" {
    pub fn vsnprintf(
        arg1: *mut lang_items::c_char,
        arg2: usize,
        arg3: *const lang_items::c_char,
        arg4: __gnuc_va_list,
    ) -> lang_items::c_int;
}
extern "C" {
    pub fn vfscanf(
        arg1: *mut FILE,
        arg2: *const lang_items::c_char,
        arg3: __gnuc_va_list,
    ) -> lang_items::c_int;
}
extern "C" {
    pub fn vscanf(arg1: *const lang_items::c_char, arg2: __gnuc_va_list) -> lang_items::c_int;
}
extern "C" {
    pub fn vsscanf(
        arg1: *const lang_items::c_char,
        arg2: *const lang_items::c_char,
        arg3: __gnuc_va_list,
    ) -> lang_items::c_int;
}
extern "C" {
    pub fn asiprintf(
        arg1: *mut *mut lang_items::c_char,
        arg2: *const lang_items::c_char,
        ...
    ) -> lang_items::c_int;
}
extern "C" {
    pub fn asniprintf(
        arg1: *mut lang_items::c_char,
        arg2: *mut usize,
        arg3: *const lang_items::c_char,
        ...
    ) -> *mut lang_items::c_char;
}
extern "C" {
    pub fn asnprintf(
        arg1: *mut lang_items::c_char,
        arg2: *mut usize,
        arg3: *const lang_items::c_char,
        ...
    ) -> *mut lang_items::c_char;
}
extern "C" {
    pub fn diprintf(
        arg1: lang_items::c_int,
        arg2: *const lang_items::c_char,
        ...
    ) -> lang_items::c_int;
}
extern "C" {
    pub fn fiprintf(arg1: *mut FILE, arg2: *const lang_items::c_char, ...) -> lang_items::c_int;
}
extern "C" {
    pub fn fiscanf(arg1: *mut FILE, arg2: *const lang_items::c_char, ...) -> lang_items::c_int;
}
extern "C" {
    pub fn iprintf(arg1: *const lang_items::c_char, ...) -> lang_items::c_int;
}
extern "C" {
    pub fn iscanf(arg1: *const lang_items::c_char, ...) -> lang_items::c_int;
}
extern "C" {
    pub fn siprintf(
        arg1: *mut lang_items::c_char,
        arg2: *const lang_items::c_char,
        ...
    ) -> lang_items::c_int;
}
extern "C" {
    pub fn siscanf(
        arg1: *const lang_items::c_char,
        arg2: *const lang_items::c_char,
        ...
    ) -> lang_items::c_int;
}
extern "C" {
    pub fn sniprintf(
        arg1: *mut lang_items::c_char,
        arg2: usize,
        arg3: *const lang_items::c_char,
        ...
    ) -> lang_items::c_int;
}
extern "C" {
    pub fn vasiprintf(
        arg1: *mut *mut lang_items::c_char,
        arg2: *const lang_items::c_char,
        arg3: __gnuc_va_list,
    ) -> lang_items::c_int;
}
extern "C" {
    pub fn vasniprintf(
        arg1: *mut lang_items::c_char,
        arg2: *mut usize,
        arg3: *const lang_items::c_char,
        arg4: __gnuc_va_list,
    ) -> *mut lang_items::c_char;
}
extern "C" {
    pub fn vasnprintf(
        arg1: *mut lang_items::c_char,
        arg2: *mut usize,
        arg3: *const lang_items::c_char,
        arg4: __gnuc_va_list,
    ) -> *mut lang_items::c_char;
}
extern "C" {
    pub fn vdiprintf(
        arg1: lang_items::c_int,
        arg2: *const lang_items::c_char,
        arg3: __gnuc_va_list,
    ) -> lang_items::c_int;
}
extern "C" {
    pub fn vfiprintf(
        arg1: *mut FILE,
        arg2: *const lang_items::c_char,
        arg3: __gnuc_va_list,
    ) -> lang_items::c_int;
}
extern "C" {
    pub fn vfiscanf(
        arg1: *mut FILE,
        arg2: *const lang_items::c_char,
        arg3: __gnuc_va_list,
    ) -> lang_items::c_int;
}
extern "C" {
    pub fn viprintf(arg1: *const lang_items::c_char, arg2: __gnuc_va_list) -> lang_items::c_int;
}
extern "C" {
    pub fn viscanf(arg1: *const lang_items::c_char, arg2: __gnuc_va_list) -> lang_items::c_int;
}
extern "C" {
    pub fn vsiprintf(
        arg1: *mut lang_items::c_char,
        arg2: *const lang_items::c_char,
        arg3: __gnuc_va_list,
    ) -> lang_items::c_int;
}
extern "C" {
    pub fn vsiscanf(
        arg1: *const lang_items::c_char,
        arg2: *const lang_items::c_char,
        arg3: __gnuc_va_list,
    ) -> lang_items::c_int;
}
extern "C" {
    pub fn vsniprintf(
        arg1: *mut lang_items::c_char,
        arg2: usize,
        arg3: *const lang_items::c_char,
        arg4: __gnuc_va_list,
    ) -> lang_items::c_int;
}
extern "C" {
    pub fn fdopen(arg1: lang_items::c_int, arg2: *const lang_items::c_char) -> *mut FILE;
}
extern "C" {
    pub fn fileno(arg1: *mut FILE) -> lang_items::c_int;
}
extern "C" {
    pub fn pclose(arg1: *mut FILE) -> lang_items::c_int;
}
extern "C" {
    pub fn popen(arg1: *const lang_items::c_char, arg2: *const lang_items::c_char) -> *mut FILE;
}
extern "C" {
    pub fn setbuffer(arg1: *mut FILE, arg2: *mut lang_items::c_char, arg3: lang_items::c_int);
}
extern "C" {
    pub fn setlinebuf(arg1: *mut FILE) -> lang_items::c_int;
}
extern "C" {
    pub fn getw(arg1: *mut FILE) -> lang_items::c_int;
}
extern "C" {
    pub fn putw(arg1: lang_items::c_int, arg2: *mut FILE) -> lang_items::c_int;
}
extern "C" {
    pub fn getc_unlocked(arg1: *mut FILE) -> lang_items::c_int;
}
extern "C" {
    pub fn getchar_unlocked() -> lang_items::c_int;
}
extern "C" {
    pub fn flockfile(arg1: *mut FILE);
}
extern "C" {
    pub fn ftrylockfile(arg1: *mut FILE) -> lang_items::c_int;
}
extern "C" {
    pub fn funlockfile(arg1: *mut FILE);
}
extern "C" {
    pub fn putc_unlocked(arg1: lang_items::c_int, arg2: *mut FILE) -> lang_items::c_int;
}
extern "C" {
    pub fn putchar_unlocked(arg1: lang_items::c_int) -> lang_items::c_int;
}
extern "C" {
    pub fn dprintf(
        arg1: lang_items::c_int,
        arg2: *const lang_items::c_char,
        ...
    ) -> lang_items::c_int;
}
extern "C" {
    pub fn fmemopen(
        arg1: *mut lang_items::c_void,
        arg2: usize,
        arg3: *const lang_items::c_char,
    ) -> *mut FILE;
}
extern "C" {
    pub fn open_memstream(arg1: *mut *mut lang_items::c_char, arg2: *mut usize) -> *mut FILE;
}
extern "C" {
    pub fn vdprintf(
        arg1: lang_items::c_int,
        arg2: *const lang_items::c_char,
        arg3: __gnuc_va_list,
    ) -> lang_items::c_int;
}
extern "C" {
    pub fn renameat(
        arg1: lang_items::c_int,
        arg2: *const lang_items::c_char,
        arg3: lang_items::c_int,
        arg4: *const lang_items::c_char,
    ) -> lang_items::c_int;
}
extern "C" {
    pub fn _asiprintf_r(
        arg1: *mut _reent,
        arg2: *mut *mut lang_items::c_char,
        arg3: *const lang_items::c_char,
        ...
    ) -> lang_items::c_int;
}
extern "C" {
    pub fn _asniprintf_r(
        arg1: *mut _reent,
        arg2: *mut lang_items::c_char,
        arg3: *mut usize,
        arg4: *const lang_items::c_char,
        ...
    ) -> *mut lang_items::c_char;
}
extern "C" {
    pub fn _asnprintf_r(
        arg1: *mut _reent,
        arg2: *mut lang_items::c_char,
        arg3: *mut usize,
        arg4: *const lang_items::c_char,
        ...
    ) -> *mut lang_items::c_char;
}
extern "C" {
    pub fn _asprintf_r(
        arg1: *mut _reent,
        arg2: *mut *mut lang_items::c_char,
        arg3: *const lang_items::c_char,
        ...
    ) -> lang_items::c_int;
}
extern "C" {
    pub fn _diprintf_r(
        arg1: *mut _reent,
        arg2: lang_items::c_int,
        arg3: *const lang_items::c_char,
        ...
    ) -> lang_items::c_int;
}
extern "C" {
    pub fn _dprintf_r(
        arg1: *mut _reent,
        arg2: lang_items::c_int,
        arg3: *const lang_items::c_char,
        ...
    ) -> lang_items::c_int;
}
extern "C" {
    pub fn _fclose_r(arg1: *mut _reent, arg2: *mut FILE) -> lang_items::c_int;
}
extern "C" {
    pub fn _fcloseall_r(arg1: *mut _reent) -> lang_items::c_int;
}
extern "C" {
    pub fn _fdopen_r(
        arg1: *mut _reent,
        arg2: lang_items::c_int,
        arg3: *const lang_items::c_char,
    ) -> *mut FILE;
}
extern "C" {
    pub fn _fflush_r(arg1: *mut _reent, arg2: *mut FILE) -> lang_items::c_int;
}
extern "C" {
    pub fn _fgetc_r(arg1: *mut _reent, arg2: *mut FILE) -> lang_items::c_int;
}
extern "C" {
    pub fn _fgetc_unlocked_r(arg1: *mut _reent, arg2: *mut FILE) -> lang_items::c_int;
}
extern "C" {
    pub fn _fgets_r(
        arg1: *mut _reent,
        arg2: *mut lang_items::c_char,
        arg3: lang_items::c_int,
        arg4: *mut FILE,
    ) -> *mut lang_items::c_char;
}
extern "C" {
    pub fn _fgets_unlocked_r(
        arg1: *mut _reent,
        arg2: *mut lang_items::c_char,
        arg3: lang_items::c_int,
        arg4: *mut FILE,
    ) -> *mut lang_items::c_char;
}
extern "C" {
    pub fn _fgetpos_r(arg1: *mut _reent, arg2: *mut FILE, arg3: *mut fpos_t) -> lang_items::c_int;
}
extern "C" {
    pub fn _fsetpos_r(arg1: *mut _reent, arg2: *mut FILE, arg3: *const fpos_t)
        -> lang_items::c_int;
}
extern "C" {
    pub fn _fiprintf_r(
        arg1: *mut _reent,
        arg2: *mut FILE,
        arg3: *const lang_items::c_char,
        ...
    ) -> lang_items::c_int;
}
extern "C" {
    pub fn _fiscanf_r(
        arg1: *mut _reent,
        arg2: *mut FILE,
        arg3: *const lang_items::c_char,
        ...
    ) -> lang_items::c_int;
}
extern "C" {
    pub fn _fmemopen_r(
        arg1: *mut _reent,
        arg2: *mut lang_items::c_void,
        arg3: usize,
        arg4: *const lang_items::c_char,
    ) -> *mut FILE;
}
extern "C" {
    pub fn _fopen_r(
        arg1: *mut _reent,
        arg2: *const lang_items::c_char,
        arg3: *const lang_items::c_char,
    ) -> *mut FILE;
}
extern "C" {
    pub fn _freopen_r(
        arg1: *mut _reent,
        arg2: *const lang_items::c_char,
        arg3: *const lang_items::c_char,
        arg4: *mut FILE,
    ) -> *mut FILE;
}
extern "C" {
    pub fn _fprintf_r(
        arg1: *mut _reent,
        arg2: *mut FILE,
        arg3: *const lang_items::c_char,
        ...
    ) -> lang_items::c_int;
}
extern "C" {
    pub fn _fpurge_r(arg1: *mut _reent, arg2: *mut FILE) -> lang_items::c_int;
}
extern "C" {
    pub fn _fputc_r(
        arg1: *mut _reent,
        arg2: lang_items::c_int,
        arg3: *mut FILE,
    ) -> lang_items::c_int;
}
extern "C" {
    pub fn _fputc_unlocked_r(
        arg1: *mut _reent,
        arg2: lang_items::c_int,
        arg3: *mut FILE,
    ) -> lang_items::c_int;
}
extern "C" {
    pub fn _fputs_r(
        arg1: *mut _reent,
        arg2: *const lang_items::c_char,
        arg3: *mut FILE,
    ) -> lang_items::c_int;
}
extern "C" {
    pub fn _fputs_unlocked_r(
        arg1: *mut _reent,
        arg2: *const lang_items::c_char,
        arg3: *mut FILE,
    ) -> lang_items::c_int;
}
extern "C" {
    pub fn _fread_r(
        arg1: *mut _reent,
        arg2: *mut lang_items::c_void,
        _size: usize,
        _n: usize,
        arg3: *mut FILE,
    ) -> usize;
}
extern "C" {
    pub fn _fread_unlocked_r(
        arg1: *mut _reent,
        arg2: *mut lang_items::c_void,
        _size: usize,
        _n: usize,
        arg3: *mut FILE,
    ) -> usize;
}
extern "C" {
    pub fn _fscanf_r(
        arg1: *mut _reent,
        arg2: *mut FILE,
        arg3: *const lang_items::c_char,
        ...
    ) -> lang_items::c_int;
}
extern "C" {
    pub fn _fseek_r(
        arg1: *mut _reent,
        arg2: *mut FILE,
        arg3: lang_items::c_long,
        arg4: lang_items::c_int,
    ) -> lang_items::c_int;
}
extern "C" {
    pub fn _fseeko_r(
        arg1: *mut _reent,
        arg2: *mut FILE,
        arg3: _off_t,
        arg4: lang_items::c_int,
    ) -> lang_items::c_int;
}
extern "C" {
    pub fn _ftell_r(arg1: *mut _reent, arg2: *mut FILE) -> lang_items::c_long;
}
extern "C" {
    pub fn _ftello_r(arg1: *mut _reent, arg2: *mut FILE) -> _off_t;
}
extern "C" {
    pub fn _rewind_r(arg1: *mut _reent, arg2: *mut FILE);
}
extern "C" {
    pub fn _fwrite_r(
        arg1: *mut _reent,
        arg2: *const lang_items::c_void,
        _size: usize,
        _n: usize,
        arg3: *mut FILE,
    ) -> usize;
}
extern "C" {
    pub fn _fwrite_unlocked_r(
        arg1: *mut _reent,
        arg2: *const lang_items::c_void,
        _size: usize,
        _n: usize,
        arg3: *mut FILE,
    ) -> usize;
}
extern "C" {
    pub fn _getc_r(arg1: *mut _reent, arg2: *mut FILE) -> lang_items::c_int;
}
extern "C" {
    pub fn _getc_unlocked_r(arg1: *mut _reent, arg2: *mut FILE) -> lang_items::c_int;
}
extern "C" {
    pub fn _getchar_r(arg1: *mut _reent) -> lang_items::c_int;
}
extern "C" {
    pub fn _getchar_unlocked_r(arg1: *mut _reent) -> lang_items::c_int;
}
extern "C" {
    pub fn _gets_r(arg1: *mut _reent, arg2: *mut lang_items::c_char) -> *mut lang_items::c_char;
}
extern "C" {
    pub fn _iprintf_r(arg1: *mut _reent, arg2: *const lang_items::c_char, ...)
        -> lang_items::c_int;
}
extern "C" {
    pub fn _iscanf_r(arg1: *mut _reent, arg2: *const lang_items::c_char, ...) -> lang_items::c_int;
}
extern "C" {
    pub fn _open_memstream_r(
        arg1: *mut _reent,
        arg2: *mut *mut lang_items::c_char,
        arg3: *mut usize,
    ) -> *mut FILE;
}
extern "C" {
    pub fn _perror_r(arg1: *mut _reent, arg2: *const lang_items::c_char);
}
extern "C" {
    pub fn _printf_r(arg1: *mut _reent, arg2: *const lang_items::c_char, ...) -> lang_items::c_int;
}
extern "C" {
    pub fn _putc_r(
        arg1: *mut _reent,
        arg2: lang_items::c_int,
        arg3: *mut FILE,
    ) -> lang_items::c_int;
}
extern "C" {
    pub fn _putc_unlocked_r(
        arg1: *mut _reent,
        arg2: lang_items::c_int,
        arg3: *mut FILE,
    ) -> lang_items::c_int;
}
extern "C" {
    pub fn _putchar_unlocked_r(arg1: *mut _reent, arg2: lang_items::c_int) -> lang_items::c_int;
}
extern "C" {
    pub fn _putchar_r(arg1: *mut _reent, arg2: lang_items::c_int) -> lang_items::c_int;
}
extern "C" {
    pub fn _puts_r(arg1: *mut _reent, arg2: *const lang_items::c_char) -> lang_items::c_int;
}
extern "C" {
    pub fn _remove_r(arg1: *mut _reent, arg2: *const lang_items::c_char) -> lang_items::c_int;
}
extern "C" {
    pub fn _rename_r(
        arg1: *mut _reent,
        _old: *const lang_items::c_char,
        _new: *const lang_items::c_char,
    ) -> lang_items::c_int;
}
extern "C" {
    pub fn _scanf_r(arg1: *mut _reent, arg2: *const lang_items::c_char, ...) -> lang_items::c_int;
}
extern "C" {
    pub fn _siprintf_r(
        arg1: *mut _reent,
        arg2: *mut lang_items::c_char,
        arg3: *const lang_items::c_char,
        ...
    ) -> lang_items::c_int;
}
extern "C" {
    pub fn _siscanf_r(
        arg1: *mut _reent,
        arg2: *const lang_items::c_char,
        arg3: *const lang_items::c_char,
        ...
    ) -> lang_items::c_int;
}
extern "C" {
    pub fn _sniprintf_r(
        arg1: *mut _reent,
        arg2: *mut lang_items::c_char,
        arg3: usize,
        arg4: *const lang_items::c_char,
        ...
    ) -> lang_items::c_int;
}
extern "C" {
    pub fn _snprintf_r(
        arg1: *mut _reent,
        arg2: *mut lang_items::c_char,
        arg3: usize,
        arg4: *const lang_items::c_char,
        ...
    ) -> lang_items::c_int;
}
extern "C" {
    pub fn _sprintf_r(
        arg1: *mut _reent,
        arg2: *mut lang_items::c_char,
        arg3: *const lang_items::c_char,
        ...
    ) -> lang_items::c_int;
}
extern "C" {
    pub fn _sscanf_r(
        arg1: *mut _reent,
        arg2: *const lang_items::c_char,
        arg3: *const lang_items::c_char,
        ...
    ) -> lang_items::c_int;
}
extern "C" {
    pub fn _tempnam_r(
        arg1: *mut _reent,
        arg2: *const lang_items::c_char,
        arg3: *const lang_items::c_char,
    ) -> *mut lang_items::c_char;
}
extern "C" {
    pub fn _tmpfile_r(arg1: *mut _reent) -> *mut FILE;
}
extern "C" {
    pub fn _tmpnam_r(arg1: *mut _reent, arg2: *mut lang_items::c_char) -> *mut lang_items::c_char;
}
extern "C" {
    pub fn _ungetc_r(
        arg1: *mut _reent,
        arg2: lang_items::c_int,
        arg3: *mut FILE,
    ) -> lang_items::c_int;
}
extern "C" {
    pub fn _vasiprintf_r(
        arg1: *mut _reent,
        arg2: *mut *mut lang_items::c_char,
        arg3: *const lang_items::c_char,
        arg4: __gnuc_va_list,
    ) -> lang_items::c_int;
}
extern "C" {
    pub fn _vasniprintf_r(
        arg1: *mut _reent,
        arg2: *mut lang_items::c_char,
        arg3: *mut usize,
        arg4: *const lang_items::c_char,
        arg5: __gnuc_va_list,
    ) -> *mut lang_items::c_char;
}
extern "C" {
    pub fn _vasnprintf_r(
        arg1: *mut _reent,
        arg2: *mut lang_items::c_char,
        arg3: *mut usize,
        arg4: *const lang_items::c_char,
        arg5: __gnuc_va_list,
    ) -> *mut lang_items::c_char;
}
extern "C" {
    pub fn _vasprintf_r(
        arg1: *mut _reent,
        arg2: *mut *mut lang_items::c_char,
        arg3: *const lang_items::c_char,
        arg4: __gnuc_va_list,
    ) -> lang_items::c_int;
}
extern "C" {
    pub fn _vdiprintf_r(
        arg1: *mut _reent,
        arg2: lang_items::c_int,
        arg3: *const lang_items::c_char,
        arg4: __gnuc_va_list,
    ) -> lang_items::c_int;
}
extern "C" {
    pub fn _vdprintf_r(
        arg1: *mut _reent,
        arg2: lang_items::c_int,
        arg3: *const lang_items::c_char,
        arg4: __gnuc_va_list,
    ) -> lang_items::c_int;
}
extern "C" {
    pub fn _vfiprintf_r(
        arg1: *mut _reent,
        arg2: *mut FILE,
        arg3: *const lang_items::c_char,
        arg4: __gnuc_va_list,
    ) -> lang_items::c_int;
}
extern "C" {
    pub fn _vfiscanf_r(
        arg1: *mut _reent,
        arg2: *mut FILE,
        arg3: *const lang_items::c_char,
        arg4: __gnuc_va_list,
    ) -> lang_items::c_int;
}
extern "C" {
    pub fn _vfprintf_r(
        arg1: *mut _reent,
        arg2: *mut FILE,
        arg3: *const lang_items::c_char,
        arg4: __gnuc_va_list,
    ) -> lang_items::c_int;
}
extern "C" {
    pub fn _vfscanf_r(
        arg1: *mut _reent,
        arg2: *mut FILE,
        arg3: *const lang_items::c_char,
        arg4: __gnuc_va_list,
    ) -> lang_items::c_int;
}
extern "C" {
    pub fn _viprintf_r(
        arg1: *mut _reent,
        arg2: *const lang_items::c_char,
        arg3: __gnuc_va_list,
    ) -> lang_items::c_int;
}
extern "C" {
    pub fn _viscanf_r(
        arg1: *mut _reent,
        arg2: *const lang_items::c_char,
        arg3: __gnuc_va_list,
    ) -> lang_items::c_int;
}
extern "C" {
    pub fn _vprintf_r(
        arg1: *mut _reent,
        arg2: *const lang_items::c_char,
        arg3: __gnuc_va_list,
    ) -> lang_items::c_int;
}
extern "C" {
    pub fn _vscanf_r(
        arg1: *mut _reent,
        arg2: *const lang_items::c_char,
        arg3: __gnuc_va_list,
    ) -> lang_items::c_int;
}
extern "C" {
    pub fn _vsiprintf_r(
        arg1: *mut _reent,
        arg2: *mut lang_items::c_char,
        arg3: *const lang_items::c_char,
        arg4: __gnuc_va_list,
    ) -> lang_items::c_int;
}
extern "C" {
    pub fn _vsiscanf_r(
        arg1: *mut _reent,
        arg2: *const lang_items::c_char,
        arg3: *const lang_items::c_char,
        arg4: __gnuc_va_list,
    ) -> lang_items::c_int;
}
extern "C" {
    pub fn _vsniprintf_r(
        arg1: *mut _reent,
        arg2: *mut lang_items::c_char,
        arg3: usize,
        arg4: *const lang_items::c_char,
        arg5: __gnuc_va_list,
    ) -> lang_items::c_int;
}
extern "C" {
    pub fn _vsnprintf_r(
        arg1: *mut _reent,
        arg2: *mut lang_items::c_char,
        arg3: usize,
        arg4: *const lang_items::c_char,
        arg5: __gnuc_va_list,
    ) -> lang_items::c_int;
}
extern "C" {
    pub fn _vsprintf_r(
        arg1: *mut _reent,
        arg2: *mut lang_items::c_char,
        arg3: *const lang_items::c_char,
        arg4: __gnuc_va_list,
    ) -> lang_items::c_int;
}
extern "C" {
    pub fn _vsscanf_r(
        arg1: *mut _reent,
        arg2: *const lang_items::c_char,
        arg3: *const lang_items::c_char,
        arg4: __gnuc_va_list,
    ) -> lang_items::c_int;
}
extern "C" {
    pub fn fpurge(arg1: *mut FILE) -> lang_items::c_int;
}
extern "C" {
    pub fn __getdelim(
        arg1: *mut *mut lang_items::c_char,
        arg2: *mut usize,
        arg3: lang_items::c_int,
        arg4: *mut FILE,
    ) -> isize;
}
extern "C" {
    pub fn __getline(
        arg1: *mut *mut lang_items::c_char,
        arg2: *mut usize,
        arg3: *mut FILE,
    ) -> isize;
}
extern "C" {
    pub fn clearerr_unlocked(arg1: *mut FILE);
}
extern "C" {
    pub fn feof_unlocked(arg1: *mut FILE) -> lang_items::c_int;
}
extern "C" {
    pub fn ferror_unlocked(arg1: *mut FILE) -> lang_items::c_int;
}
extern "C" {
    pub fn fileno_unlocked(arg1: *mut FILE) -> lang_items::c_int;
}
extern "C" {
    pub fn fflush_unlocked(arg1: *mut FILE) -> lang_items::c_int;
}
extern "C" {
    pub fn fgetc_unlocked(arg1: *mut FILE) -> lang_items::c_int;
}
extern "C" {
    pub fn fputc_unlocked(arg1: lang_items::c_int, arg2: *mut FILE) -> lang_items::c_int;
}
extern "C" {
    pub fn fread_unlocked(
        arg1: *mut lang_items::c_void,
        _size: usize,
        _n: usize,
        arg2: *mut FILE,
    ) -> usize;
}
extern "C" {
    pub fn fwrite_unlocked(
        arg1: *const lang_items::c_void,
        _size: usize,
        _n: usize,
        arg2: *mut FILE,
    ) -> usize;
}
extern "C" {
    pub fn __srget_r(arg1: *mut _reent, arg2: *mut FILE) -> lang_items::c_int;
}
extern "C" {
    pub fn __swbuf_r(
        arg1: *mut _reent,
        arg2: lang_items::c_int,
        arg3: *mut FILE,
    ) -> lang_items::c_int;
}
extern "C" {
    pub fn funopen(
        __cookie: *const lang_items::c_void,
        __readfn: std::option::Option<
            unsafe extern "C" fn(
                __cookie: *mut lang_items::c_void,
                __buf: *mut lang_items::c_char,
                __n: lang_items::c_int,
            ) -> lang_items::c_int,
        >,
        __writefn: std::option::Option<
            unsafe extern "C" fn(
                __cookie: *mut lang_items::c_void,
                __buf: *const lang_items::c_char,
                __n: lang_items::c_int,
            ) -> lang_items::c_int,
        >,
        __seekfn: std::option::Option<
            unsafe extern "C" fn(
                __cookie: *mut lang_items::c_void,
                __off: fpos_t,
                __whence: lang_items::c_int,
            ) -> fpos_t,
        >,
        __closefn: std::option::Option<
            unsafe extern "C" fn(__cookie: *mut lang_items::c_void) -> lang_items::c_int,
        >,
    ) -> *mut FILE;
}
extern "C" {
    pub fn _funopen_r(
        arg1: *mut _reent,
        __cookie: *const lang_items::c_void,
        __readfn: std::option::Option<
            unsafe extern "C" fn(
                __cookie: *mut lang_items::c_void,
                __buf: *mut lang_items::c_char,
                __n: lang_items::c_int,
            ) -> lang_items::c_int,
        >,
        __writefn: std::option::Option<
            unsafe extern "C" fn(
                __cookie: *mut lang_items::c_void,
                __buf: *const lang_items::c_char,
                __n: lang_items::c_int,
            ) -> lang_items::c_int,
        >,
        __seekfn: std::option::Option<
            unsafe extern "C" fn(
                __cookie: *mut lang_items::c_void,
                __off: fpos_t,
                __whence: lang_items::c_int,
            ) -> fpos_t,
        >,
        __closefn: std::option::Option<
            unsafe extern "C" fn(__cookie: *mut lang_items::c_void) -> lang_items::c_int,
        >,
    ) -> *mut FILE;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct div_t {
    pub quot: lang_items::c_int,
    pub rem: lang_items::c_int,
}
#[test]
fn bindgen_test_layout_div_t() {
    assert_eq!(
        std::mem::size_of::<div_t>(),
        8usize,
        concat!("Size of: ", stringify!(div_t))
    );
    assert_eq!(
        std::mem::align_of::<div_t>(),
        4usize,
        concat!("Alignment of ", stringify!(div_t))
    );
    assert_eq!(
        unsafe { &(*(std::ptr::null::<div_t>())).quot as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(div_t),
            "::",
            stringify!(quot)
        )
    );
    assert_eq!(
        unsafe { &(*(std::ptr::null::<div_t>())).rem as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(div_t),
            "::",
            stringify!(rem)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ldiv_t {
    pub quot: lang_items::c_long,
    pub rem: lang_items::c_long,
}
#[test]
fn bindgen_test_layout_ldiv_t() {
    assert_eq!(
        std::mem::size_of::<ldiv_t>(),
        16usize,
        concat!("Size of: ", stringify!(ldiv_t))
    );
    assert_eq!(
        std::mem::align_of::<ldiv_t>(),
        8usize,
        concat!("Alignment of ", stringify!(ldiv_t))
    );
    assert_eq!(
        unsafe { &(*(std::ptr::null::<ldiv_t>())).quot as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ldiv_t),
            "::",
            stringify!(quot)
        )
    );
    assert_eq!(
        unsafe { &(*(std::ptr::null::<ldiv_t>())).rem as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ldiv_t),
            "::",
            stringify!(rem)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lldiv_t {
    pub quot: lang_items::c_longlong,
    pub rem: lang_items::c_longlong,
}
#[test]
fn bindgen_test_layout_lldiv_t() {
    assert_eq!(
        std::mem::size_of::<lldiv_t>(),
        16usize,
        concat!("Size of: ", stringify!(lldiv_t))
    );
    assert_eq!(
        std::mem::align_of::<lldiv_t>(),
        8usize,
        concat!("Alignment of ", stringify!(lldiv_t))
    );
    assert_eq!(
        unsafe { &(*(std::ptr::null::<lldiv_t>())).quot as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(lldiv_t),
            "::",
            stringify!(quot)
        )
    );
    assert_eq!(
        unsafe { &(*(std::ptr::null::<lldiv_t>())).rem as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(lldiv_t),
            "::",
            stringify!(rem)
        )
    );
}
pub type __compar_fn_t = std::option::Option<
    unsafe extern "C" fn(arg1: *const lang_items::c_void, arg2: *const lang_items::c_void)
        -> lang_items::c_int,
>;
extern "C" {
    pub fn __locale_mb_cur_max() -> lang_items::c_int;
}
extern "C" {
    pub fn abort();
}
extern "C" {
    pub fn abs(arg1: lang_items::c_int) -> lang_items::c_int;
}
extern "C" {
    pub fn arc4random() -> __uint32_t;
}
extern "C" {
    pub fn arc4random_uniform(arg1: __uint32_t) -> __uint32_t;
}
extern "C" {
    pub fn arc4random_buf(arg1: *mut lang_items::c_void, arg2: usize);
}
extern "C" {
    pub fn atexit(__func: std::option::Option<unsafe extern "C" fn()>) -> lang_items::c_int;
}
extern "C" {
    pub fn atof(__nptr: *const lang_items::c_char) -> f64;
}
extern "C" {
    pub fn atoff(__nptr: *const lang_items::c_char) -> f32;
}
extern "C" {
    pub fn atoi(__nptr: *const lang_items::c_char) -> lang_items::c_int;
}
extern "C" {
    pub fn _atoi_r(arg1: *mut _reent, __nptr: *const lang_items::c_char) -> lang_items::c_int;
}
extern "C" {
    pub fn atol(__nptr: *const lang_items::c_char) -> lang_items::c_long;
}
extern "C" {
    pub fn _atol_r(arg1: *mut _reent, __nptr: *const lang_items::c_char) -> lang_items::c_long;
}
extern "C" {
    pub fn bsearch(
        __key: *const lang_items::c_void,
        __base: *const lang_items::c_void,
        __nmemb: usize,
        __size: usize,
        _compar: __compar_fn_t,
    ) -> *mut lang_items::c_void;
}
extern "C" {
    pub fn calloc(__nmemb: usize, __size: usize) -> *mut lang_items::c_void;
}
extern "C" {
    pub fn div(__numer: lang_items::c_int, __denom: lang_items::c_int) -> div_t;
}
extern "C" {
    pub fn exit(__status: lang_items::c_int);
}
extern "C" {
    pub fn free(arg1: *mut lang_items::c_void);
}
extern "C" {
    pub fn getenv(__string: *const lang_items::c_char) -> *mut lang_items::c_char;
}
extern "C" {
    pub fn _getenv_r(
        arg1: *mut _reent,
        __string: *const lang_items::c_char,
    ) -> *mut lang_items::c_char;
}
extern "C" {
    pub fn _findenv(
        arg1: *const lang_items::c_char,
        arg2: *mut lang_items::c_int,
    ) -> *mut lang_items::c_char;
}
extern "C" {
    pub fn _findenv_r(
        arg1: *mut _reent,
        arg2: *const lang_items::c_char,
        arg3: *mut lang_items::c_int,
    ) -> *mut lang_items::c_char;
}
extern "C" {
    pub static mut suboptarg: *mut lang_items::c_char;
}
extern "C" {
    pub fn getsubopt(
        arg1: *mut *mut lang_items::c_char,
        arg2: *const *mut lang_items::c_char,
        arg3: *mut *mut lang_items::c_char,
    ) -> lang_items::c_int;
}
extern "C" {
    pub fn labs(arg1: lang_items::c_long) -> lang_items::c_long;
}
extern "C" {
    pub fn ldiv(__numer: lang_items::c_long, __denom: lang_items::c_long) -> ldiv_t;
}
extern "C" {
    pub fn malloc(__size: usize) -> *mut lang_items::c_void;
}
extern "C" {
    pub fn mblen(arg1: *const lang_items::c_char, arg2: usize) -> lang_items::c_int;
}
extern "C" {
    pub fn _mblen_r(
        arg1: *mut _reent,
        arg2: *const lang_items::c_char,
        arg3: usize,
        arg4: *mut _mbstate_t,
    ) -> lang_items::c_int;
}
extern "C" {
    pub fn mbtowc(
        arg1: *mut wchar_t,
        arg2: *const lang_items::c_char,
        arg3: usize,
    ) -> lang_items::c_int;
}
extern "C" {
    pub fn _mbtowc_r(
        arg1: *mut _reent,
        arg2: *mut wchar_t,
        arg3: *const lang_items::c_char,
        arg4: usize,
        arg5: *mut _mbstate_t,
    ) -> lang_items::c_int;
}
extern "C" {
    pub fn wctomb(arg1: *mut lang_items::c_char, arg2: wchar_t) -> lang_items::c_int;
}
extern "C" {
    pub fn _wctomb_r(
        arg1: *mut _reent,
        arg2: *mut lang_items::c_char,
        arg3: wchar_t,
        arg4: *mut _mbstate_t,
    ) -> lang_items::c_int;
}
extern "C" {
    pub fn mbstowcs(arg1: *mut wchar_t, arg2: *const lang_items::c_char, arg3: usize) -> usize;
}
extern "C" {
    pub fn _mbstowcs_r(
        arg1: *mut _reent,
        arg2: *mut wchar_t,
        arg3: *const lang_items::c_char,
        arg4: usize,
        arg5: *mut _mbstate_t,
    ) -> usize;
}
extern "C" {
    pub fn wcstombs(arg1: *mut lang_items::c_char, arg2: *const wchar_t, arg3: usize) -> usize;
}
extern "C" {
    pub fn _wcstombs_r(
        arg1: *mut _reent,
        arg2: *mut lang_items::c_char,
        arg3: *const wchar_t,
        arg4: usize,
        arg5: *mut _mbstate_t,
    ) -> usize;
}
extern "C" {
    pub fn mkdtemp(arg1: *mut lang_items::c_char) -> *mut lang_items::c_char;
}
extern "C" {
    pub fn mkstemp(arg1: *mut lang_items::c_char) -> lang_items::c_int;
}
extern "C" {
    pub fn mkstemps(arg1: *mut lang_items::c_char, arg2: lang_items::c_int) -> lang_items::c_int;
}
extern "C" {
    pub fn mktemp(arg1: *mut lang_items::c_char) -> *mut lang_items::c_char;
}
extern "C" {
    pub fn _mkdtemp_r(arg1: *mut _reent, arg2: *mut lang_items::c_char) -> *mut lang_items::c_char;
}
extern "C" {
    pub fn _mkostemp_r(
        arg1: *mut _reent,
        arg2: *mut lang_items::c_char,
        arg3: lang_items::c_int,
    ) -> lang_items::c_int;
}
extern "C" {
    pub fn _mkostemps_r(
        arg1: *mut _reent,
        arg2: *mut lang_items::c_char,
        arg3: lang_items::c_int,
        arg4: lang_items::c_int,
    ) -> lang_items::c_int;
}
extern "C" {
    pub fn _mkstemp_r(arg1: *mut _reent, arg2: *mut lang_items::c_char) -> lang_items::c_int;
}
extern "C" {
    pub fn _mkstemps_r(
        arg1: *mut _reent,
        arg2: *mut lang_items::c_char,
        arg3: lang_items::c_int,
    ) -> lang_items::c_int;
}
extern "C" {
    pub fn _mktemp_r(arg1: *mut _reent, arg2: *mut lang_items::c_char) -> *mut lang_items::c_char;
}
extern "C" {
    pub fn qsort(
        __base: *mut lang_items::c_void,
        __nmemb: usize,
        __size: usize,
        _compar: __compar_fn_t,
    );
}
extern "C" {
    pub fn rand() -> lang_items::c_int;
}
extern "C" {
    pub fn realloc(__r: *mut lang_items::c_void, __size: usize) -> *mut lang_items::c_void;
}
extern "C" {
    pub fn reallocarray(
        arg1: *mut lang_items::c_void,
        arg2: usize,
        arg3: usize,
    ) -> *mut lang_items::c_void;
}
extern "C" {
    pub fn reallocf(__r: *mut lang_items::c_void, __size: usize) -> *mut lang_items::c_void;
}
extern "C" {
    pub fn realpath(
        path: *const lang_items::c_char,
        resolved_path: *mut lang_items::c_char,
    ) -> *mut lang_items::c_char;
}
extern "C" {
    pub fn rpmatch(response: *const lang_items::c_char) -> lang_items::c_int;
}
extern "C" {
    pub fn srand(__seed: lang_items::c_uint);
}
extern "C" {
    pub fn strtod(__n: *const lang_items::c_char, __end_PTR: *mut *mut lang_items::c_char) -> f64;
}
extern "C" {
    pub fn _strtod_r(
        arg1: *mut _reent,
        __n: *const lang_items::c_char,
        __end_PTR: *mut *mut lang_items::c_char,
    ) -> f64;
}
extern "C" {
    pub fn strtof(__n: *const lang_items::c_char, __end_PTR: *mut *mut lang_items::c_char) -> f32;
}
extern "C" {
    pub fn strtol(
        __n: *const lang_items::c_char,
        __end_PTR: *mut *mut lang_items::c_char,
        __base: lang_items::c_int,
    ) -> lang_items::c_long;
}
extern "C" {
    pub fn _strtol_r(
        arg1: *mut _reent,
        __n: *const lang_items::c_char,
        __end_PTR: *mut *mut lang_items::c_char,
        __base: lang_items::c_int,
    ) -> lang_items::c_long;
}
extern "C" {
    pub fn strtoul(
        __n: *const lang_items::c_char,
        __end_PTR: *mut *mut lang_items::c_char,
        __base: lang_items::c_int,
    ) -> lang_items::c_ulong;
}
extern "C" {
    pub fn _strtoul_r(
        arg1: *mut _reent,
        __n: *const lang_items::c_char,
        __end_PTR: *mut *mut lang_items::c_char,
        __base: lang_items::c_int,
    ) -> lang_items::c_ulong;
}
extern "C" {
    pub fn system(__string: *const lang_items::c_char) -> lang_items::c_int;
}
extern "C" {
    pub fn a64l(__input: *const lang_items::c_char) -> lang_items::c_long;
}
extern "C" {
    pub fn l64a(__input: lang_items::c_long) -> *mut lang_items::c_char;
}
extern "C" {
    pub fn _l64a_r(arg1: *mut _reent, __input: lang_items::c_long) -> *mut lang_items::c_char;
}
extern "C" {
    pub fn on_exit(
        __func: std::option::Option<
            unsafe extern "C" fn(arg1: lang_items::c_int, arg2: *mut lang_items::c_void),
        >,
        __arg: *mut lang_items::c_void,
    ) -> lang_items::c_int;
}
extern "C" {
    pub fn _Exit(__status: lang_items::c_int);
}
extern "C" {
    pub fn putenv(__string: *mut lang_items::c_char) -> lang_items::c_int;
}
extern "C" {
    pub fn _putenv_r(arg1: *mut _reent, __string: *mut lang_items::c_char) -> lang_items::c_int;
}
extern "C" {
    pub fn _reallocf_r(
        arg1: *mut _reent,
        arg2: *mut lang_items::c_void,
        arg3: usize,
    ) -> *mut lang_items::c_void;
}
extern "C" {
    pub fn setenv(
        __string: *const lang_items::c_char,
        __value: *const lang_items::c_char,
        __overwrite: lang_items::c_int,
    ) -> lang_items::c_int;
}
extern "C" {
    pub fn _setenv_r(
        arg1: *mut _reent,
        __string: *const lang_items::c_char,
        __value: *const lang_items::c_char,
        __overwrite: lang_items::c_int,
    ) -> lang_items::c_int;
}
extern "C" {
    pub fn __itoa(
        arg1: lang_items::c_int,
        arg2: *mut lang_items::c_char,
        arg3: lang_items::c_int,
    ) -> *mut lang_items::c_char;
}
extern "C" {
    pub fn __utoa(
        arg1: lang_items::c_uint,
        arg2: *mut lang_items::c_char,
        arg3: lang_items::c_int,
    ) -> *mut lang_items::c_char;
}
extern "C" {
    pub fn itoa(
        arg1: lang_items::c_int,
        arg2: *mut lang_items::c_char,
        arg3: lang_items::c_int,
    ) -> *mut lang_items::c_char;
}
extern "C" {
    pub fn utoa(
        arg1: lang_items::c_uint,
        arg2: *mut lang_items::c_char,
        arg3: lang_items::c_int,
    ) -> *mut lang_items::c_char;
}
extern "C" {
    pub fn rand_r(__seed: *mut lang_items::c_uint) -> lang_items::c_int;
}
extern "C" {
    pub fn drand48() -> f64;
}
extern "C" {
    pub fn _drand48_r(arg1: *mut _reent) -> f64;
}
extern "C" {
    pub fn erand48(arg1: *mut lang_items::c_ushort) -> f64;
}
extern "C" {
    pub fn _erand48_r(arg1: *mut _reent, arg2: *mut lang_items::c_ushort) -> f64;
}
extern "C" {
    pub fn jrand48(arg1: *mut lang_items::c_ushort) -> lang_items::c_long;
}
extern "C" {
    pub fn _jrand48_r(arg1: *mut _reent, arg2: *mut lang_items::c_ushort) -> lang_items::c_long;
}
extern "C" {
    pub fn lcong48(arg1: *mut lang_items::c_ushort);
}
extern "C" {
    pub fn _lcong48_r(arg1: *mut _reent, arg2: *mut lang_items::c_ushort);
}
extern "C" {
    pub fn lrand48() -> lang_items::c_long;
}
extern "C" {
    pub fn _lrand48_r(arg1: *mut _reent) -> lang_items::c_long;
}
extern "C" {
    pub fn mrand48() -> lang_items::c_long;
}
extern "C" {
    pub fn _mrand48_r(arg1: *mut _reent) -> lang_items::c_long;
}
extern "C" {
    pub fn nrand48(arg1: *mut lang_items::c_ushort) -> lang_items::c_long;
}
extern "C" {
    pub fn _nrand48_r(arg1: *mut _reent, arg2: *mut lang_items::c_ushort) -> lang_items::c_long;
}
extern "C" {
    pub fn seed48(arg1: *mut lang_items::c_ushort) -> *mut lang_items::c_ushort;
}
extern "C" {
    pub fn _seed48_r(
        arg1: *mut _reent,
        arg2: *mut lang_items::c_ushort,
    ) -> *mut lang_items::c_ushort;
}
extern "C" {
    pub fn srand48(arg1: lang_items::c_long);
}
extern "C" {
    pub fn _srand48_r(arg1: *mut _reent, arg2: lang_items::c_long);
}
extern "C" {
    pub fn initstate(
        arg1: lang_items::c_uint,
        arg2: *mut lang_items::c_char,
        arg3: usize,
    ) -> *mut lang_items::c_char;
}
extern "C" {
    pub fn random() -> lang_items::c_long;
}
extern "C" {
    pub fn setstate(arg1: *mut lang_items::c_char) -> *mut lang_items::c_char;
}
extern "C" {
    pub fn srandom(arg1: lang_items::c_uint);
}
extern "C" {
    pub fn atoll(__nptr: *const lang_items::c_char) -> lang_items::c_longlong;
}
extern "C" {
    pub fn _atoll_r(arg1: *mut _reent, __nptr: *const lang_items::c_char)
        -> lang_items::c_longlong;
}
extern "C" {
    pub fn llabs(arg1: lang_items::c_longlong) -> lang_items::c_longlong;
}
extern "C" {
    pub fn lldiv(__numer: lang_items::c_longlong, __denom: lang_items::c_longlong) -> lldiv_t;
}
extern "C" {
    pub fn strtoll(
        __n: *const lang_items::c_char,
        __end_PTR: *mut *mut lang_items::c_char,
        __base: lang_items::c_int,
    ) -> lang_items::c_longlong;
}
extern "C" {
    pub fn _strtoll_r(
        arg1: *mut _reent,
        __n: *const lang_items::c_char,
        __end_PTR: *mut *mut lang_items::c_char,
        __base: lang_items::c_int,
    ) -> lang_items::c_longlong;
}
extern "C" {
    pub fn strtoull(
        __n: *const lang_items::c_char,
        __end_PTR: *mut *mut lang_items::c_char,
        __base: lang_items::c_int,
    ) -> lang_items::c_ulonglong;
}
extern "C" {
    pub fn _strtoull_r(
        arg1: *mut _reent,
        __n: *const lang_items::c_char,
        __end_PTR: *mut *mut lang_items::c_char,
        __base: lang_items::c_int,
    ) -> lang_items::c_ulonglong;
}
extern "C" {
    pub fn cfree(arg1: *mut lang_items::c_void);
}
extern "C" {
    pub fn unsetenv(__string: *const lang_items::c_char) -> lang_items::c_int;
}
extern "C" {
    pub fn _unsetenv_r(arg1: *mut _reent, __string: *const lang_items::c_char)
        -> lang_items::c_int;
}
extern "C" {
    pub fn posix_memalign(
        arg1: *mut *mut lang_items::c_void,
        arg2: usize,
        arg3: usize,
    ) -> lang_items::c_int;
}
extern "C" {
    pub fn _dtoa_r(
        arg1: *mut _reent,
        arg2: f64,
        arg3: lang_items::c_int,
        arg4: lang_items::c_int,
        arg5: *mut lang_items::c_int,
        arg6: *mut lang_items::c_int,
        arg7: *mut *mut lang_items::c_char,
    ) -> *mut lang_items::c_char;
}
extern "C" {
    pub fn _malloc_r(arg1: *mut _reent, arg2: usize) -> *mut lang_items::c_void;
}
extern "C" {
    pub fn _calloc_r(arg1: *mut _reent, arg2: usize, arg3: usize) -> *mut lang_items::c_void;
}
extern "C" {
    pub fn _free_r(arg1: *mut _reent, arg2: *mut lang_items::c_void);
}
extern "C" {
    pub fn _realloc_r(
        arg1: *mut _reent,
        arg2: *mut lang_items::c_void,
        arg3: usize,
    ) -> *mut lang_items::c_void;
}
extern "C" {
    pub fn _mstats_r(arg1: *mut _reent, arg2: *mut lang_items::c_char);
}
extern "C" {
    pub fn _system_r(arg1: *mut _reent, arg2: *const lang_items::c_char) -> lang_items::c_int;
}
extern "C" {
    pub fn __eprintf(
        arg1: *const lang_items::c_char,
        arg2: *const lang_items::c_char,
        arg3: lang_items::c_uint,
        arg4: *const lang_items::c_char,
    );
}
extern "C" {
    pub fn qsort_r(
        __base: *mut lang_items::c_void,
        __nmemb: usize,
        __size: usize,
        __thunk: *mut lang_items::c_void,
        _compar: std::option::Option<
            unsafe extern "C" fn(
                arg1: *mut lang_items::c_void,
                arg2: *const lang_items::c_void,
                arg3: *const lang_items::c_void,
            ) -> lang_items::c_int,
        >,
    );
}
extern "C" {
    pub fn _strtold_r(
        arg1: *mut _reent,
        arg2: *const lang_items::c_char,
        arg3: *mut *mut lang_items::c_char,
    ) -> f64;
}
extern "C" {
    pub fn strtold(arg1: *const lang_items::c_char, arg2: *mut *mut lang_items::c_char) -> f64;
}
extern "C" {
    pub fn aligned_alloc(arg1: usize, arg2: usize) -> *mut lang_items::c_void;
}
extern "C" {
    pub fn at_quick_exit(arg1: std::option::Option<unsafe extern "C" fn()>)
        -> lang_items::c_int;
}
extern "C" {
    pub fn quick_exit(arg1: lang_items::c_int);
}
extern "C" {
    pub fn bcmp(
        arg1: *const lang_items::c_void,
        arg2: *const lang_items::c_void,
        arg3: usize,
    ) -> lang_items::c_int;
}
extern "C" {
    pub fn bcopy(arg1: *const lang_items::c_void, arg2: *mut lang_items::c_void, arg3: usize);
}
extern "C" {
    pub fn bzero(arg1: *mut lang_items::c_void, arg2: usize);
}
extern "C" {
    pub fn explicit_bzero(arg1: *mut lang_items::c_void, arg2: usize);
}
extern "C" {
    pub fn ffs(arg1: lang_items::c_int) -> lang_items::c_int;
}
extern "C" {
    pub fn ffsl(arg1: lang_items::c_long) -> lang_items::c_int;
}
extern "C" {
    pub fn ffsll(arg1: lang_items::c_longlong) -> lang_items::c_int;
}
extern "C" {
    pub fn fls(arg1: lang_items::c_int) -> lang_items::c_int;
}
extern "C" {
    pub fn flsl(arg1: lang_items::c_long) -> lang_items::c_int;
}
extern "C" {
    pub fn flsll(arg1: lang_items::c_longlong) -> lang_items::c_int;
}
extern "C" {
    pub fn index(
        arg1: *const lang_items::c_char,
        arg2: lang_items::c_int,
    ) -> *mut lang_items::c_char;
}
extern "C" {
    pub fn rindex(
        arg1: *const lang_items::c_char,
        arg2: lang_items::c_int,
    ) -> *mut lang_items::c_char;
}
extern "C" {
    pub fn strcasecmp(
        arg1: *const lang_items::c_char,
        arg2: *const lang_items::c_char,
    ) -> lang_items::c_int;
}
extern "C" {
    pub fn strncasecmp(
        arg1: *const lang_items::c_char,
        arg2: *const lang_items::c_char,
        arg3: usize,
    ) -> lang_items::c_int;
}
extern "C" {
    pub fn strcasecmp_l(
        arg1: *const lang_items::c_char,
        arg2: *const lang_items::c_char,
        arg3: locale_t,
    ) -> lang_items::c_int;
}
extern "C" {
    pub fn strncasecmp_l(
        arg1: *const lang_items::c_char,
        arg2: *const lang_items::c_char,
        arg3: usize,
        arg4: locale_t,
    ) -> lang_items::c_int;
}
extern "C" {
    pub fn memchr(
        arg1: *const lang_items::c_void,
        arg2: lang_items::c_int,
        arg3: usize,
    ) -> *mut lang_items::c_void;
}
extern "C" {
    pub fn memcmp(
        arg1: *const lang_items::c_void,
        arg2: *const lang_items::c_void,
        arg3: usize,
    ) -> lang_items::c_int;
}
extern "C" {
    pub fn memcpy(
        arg1: *mut lang_items::c_void,
        arg2: *const lang_items::c_void,
        arg3: usize,
    ) -> *mut lang_items::c_void;
}
extern "C" {
    pub fn memmove(
        arg1: *mut lang_items::c_void,
        arg2: *const lang_items::c_void,
        arg3: usize,
    ) -> *mut lang_items::c_void;
}
extern "C" {
    pub fn memset(
        arg1: *mut lang_items::c_void,
        arg2: lang_items::c_int,
        arg3: usize,
    ) -> *mut lang_items::c_void;
}
extern "C" {
    pub fn strcat(
        arg1: *mut lang_items::c_char,
        arg2: *const lang_items::c_char,
    ) -> *mut lang_items::c_char;
}
extern "C" {
    pub fn strchr(
        arg1: *const lang_items::c_char,
        arg2: lang_items::c_int,
    ) -> *mut lang_items::c_char;
}
extern "C" {
    pub fn strcmp(
        arg1: *const lang_items::c_char,
        arg2: *const lang_items::c_char,
    ) -> lang_items::c_int;
}
extern "C" {
    pub fn strcoll(
        arg1: *const lang_items::c_char,
        arg2: *const lang_items::c_char,
    ) -> lang_items::c_int;
}
extern "C" {
    pub fn strcpy(
        arg1: *mut lang_items::c_char,
        arg2: *const lang_items::c_char,
    ) -> *mut lang_items::c_char;
}
extern "C" {
    pub fn strcspn(
        arg1: *const lang_items::c_char,
        arg2: *const lang_items::c_char,
    ) -> lang_items::c_ulong;
}
extern "C" {
    pub fn strerror(arg1: lang_items::c_int) -> *mut lang_items::c_char;
}
extern "C" {
    pub fn strlen(arg1: *const lang_items::c_char) -> lang_items::c_ulong;
}
extern "C" {
    pub fn strncat(
        arg1: *mut lang_items::c_char,
        arg2: *const lang_items::c_char,
        arg3: usize,
    ) -> *mut lang_items::c_char;
}
extern "C" {
    pub fn strncmp(
        arg1: *const lang_items::c_char,
        arg2: *const lang_items::c_char,
        arg3: usize,
    ) -> lang_items::c_int;
}
extern "C" {
    pub fn strncpy(
        arg1: *mut lang_items::c_char,
        arg2: *const lang_items::c_char,
        arg3: usize,
    ) -> *mut lang_items::c_char;
}
extern "C" {
    pub fn strpbrk(
        arg1: *const lang_items::c_char,
        arg2: *const lang_items::c_char,
    ) -> *mut lang_items::c_char;
}
extern "C" {
    pub fn strrchr(
        arg1: *const lang_items::c_char,
        arg2: lang_items::c_int,
    ) -> *mut lang_items::c_char;
}
extern "C" {
    pub fn strspn(
        arg1: *const lang_items::c_char,
        arg2: *const lang_items::c_char,
    ) -> lang_items::c_ulong;
}
extern "C" {
    pub fn strstr(
        arg1: *const lang_items::c_char,
        arg2: *const lang_items::c_char,
    ) -> *mut lang_items::c_char;
}
extern "C" {
    pub fn strtok(
        arg1: *mut lang_items::c_char,
        arg2: *const lang_items::c_char,
    ) -> *mut lang_items::c_char;
}
extern "C" {
    pub fn strxfrm(
        arg1: *mut lang_items::c_char,
        arg2: *const lang_items::c_char,
        arg3: usize,
    ) -> lang_items::c_ulong;
}
extern "C" {
    pub fn strcoll_l(
        arg1: *const lang_items::c_char,
        arg2: *const lang_items::c_char,
        arg3: locale_t,
    ) -> lang_items::c_int;
}
extern "C" {
    pub fn strerror_l(arg1: lang_items::c_int, arg2: locale_t) -> *mut lang_items::c_char;
}
extern "C" {
    pub fn strxfrm_l(
        arg1: *mut lang_items::c_char,
        arg2: *const lang_items::c_char,
        arg3: usize,
        arg4: locale_t,
    ) -> usize;
}
extern "C" {
    pub fn strtok_r(
        arg1: *mut lang_items::c_char,
        arg2: *const lang_items::c_char,
        arg3: *mut *mut lang_items::c_char,
    ) -> *mut lang_items::c_char;
}
extern "C" {
    pub fn timingsafe_bcmp(
        arg1: *const lang_items::c_void,
        arg2: *const lang_items::c_void,
        arg3: usize,
    ) -> lang_items::c_int;
}
extern "C" {
    pub fn timingsafe_memcmp(
        arg1: *const lang_items::c_void,
        arg2: *const lang_items::c_void,
        arg3: usize,
    ) -> lang_items::c_int;
}
extern "C" {
    pub fn memccpy(
        arg1: *mut lang_items::c_void,
        arg2: *const lang_items::c_void,
        arg3: lang_items::c_int,
        arg4: usize,
    ) -> *mut lang_items::c_void;
}
extern "C" {
    pub fn stpcpy(
        arg1: *mut lang_items::c_char,
        arg2: *const lang_items::c_char,
    ) -> *mut lang_items::c_char;
}
extern "C" {
    pub fn stpncpy(
        arg1: *mut lang_items::c_char,
        arg2: *const lang_items::c_char,
        arg3: usize,
    ) -> *mut lang_items::c_char;
}
extern "C" {
    pub fn strdup(arg1: *const lang_items::c_char) -> *mut lang_items::c_char;
}
extern "C" {
    pub fn _strdup_r(arg1: *mut _reent, arg2: *const lang_items::c_char)
        -> *mut lang_items::c_char;
}
extern "C" {
    pub fn strndup(arg1: *const lang_items::c_char, arg2: usize) -> *mut lang_items::c_char;
}
extern "C" {
    pub fn _strndup_r(
        arg1: *mut _reent,
        arg2: *const lang_items::c_char,
        arg3: usize,
    ) -> *mut lang_items::c_char;
}
extern "C" {
    pub fn strerror_r(
        arg1: lang_items::c_int,
        arg2: *mut lang_items::c_char,
        arg3: usize,
    ) -> lang_items::c_int;
}
extern "C" {
    pub fn _strerror_r(
        arg1: *mut _reent,
        arg2: lang_items::c_int,
        arg3: lang_items::c_int,
        arg4: *mut lang_items::c_int,
    ) -> *mut lang_items::c_char;
}
extern "C" {
    pub fn strlcat(
        arg1: *mut lang_items::c_char,
        arg2: *const lang_items::c_char,
        arg3: usize,
    ) -> usize;
}
extern "C" {
    pub fn strlcpy(
        arg1: *mut lang_items::c_char,
        arg2: *const lang_items::c_char,
        arg3: usize,
    ) -> usize;
}
extern "C" {
    pub fn strnlen(arg1: *const lang_items::c_char, arg2: usize) -> usize;
}
extern "C" {
    pub fn strsep(
        arg1: *mut *mut lang_items::c_char,
        arg2: *const lang_items::c_char,
    ) -> *mut lang_items::c_char;
}
extern "C" {
    pub fn strnstr(
        arg1: *const lang_items::c_char,
        arg2: *const lang_items::c_char,
        arg3: usize,
    ) -> *mut lang_items::c_char;
}
extern "C" {
    pub fn strlwr(arg1: *mut lang_items::c_char) -> *mut lang_items::c_char;
}
extern "C" {
    pub fn strupr(arg1: *mut lang_items::c_char) -> *mut lang_items::c_char;
}
extern "C" {
    pub fn strsignal(__signo: lang_items::c_int) -> *mut lang_items::c_char;
}
extern "C" {
    pub fn av_log2(v: lang_items::c_uint) -> lang_items::c_int;
}
extern "C" {
    pub fn av_log2_16bit(v: lang_items::c_uint) -> lang_items::c_int;
}
extern "C" {
    /// Put a description of the AVERROR code errnum in errbuf.
    /// In case of failure the global variable errno is set to indicate the
    /// error. Even in case of failure av_strerror() will print a generic
    /// error message indicating the errnum provided to errbuf.
    ///
    /// @param errnum      error code to describe
    /// @param errbuf      buffer to which description is written
    /// @param errbuf_size the size in bytes of errbuf
    /// @return 0 on success, a negative value if a description for errnum
    /// cannot be found
    pub fn av_strerror(
        errnum: lang_items::c_int,
        errbuf: *mut lang_items::c_char,
        errbuf_size: usize,
    ) -> lang_items::c_int;
}
extern "C" {
    /// Allocate a memory block with alignment suitable for all memory accesses
    /// (including vectors if available on the CPU).
    ///
    /// @param size Size in bytes for the memory block to be allocated
    /// @return Pointer to the allocated block, or `NULL` if the block cannot
    /// be allocated
    /// @see av_mallocz()
    pub fn av_malloc(size: usize) -> *mut lang_items::c_void;
}
extern "C" {
    /// Allocate a memory block with alignment suitable for all memory accesses
    /// (including vectors if available on the CPU) and zero all the bytes of the
    /// block.
    ///
    /// @param size Size in bytes for the memory block to be allocated
    /// @return Pointer to the allocated block, or `NULL` if it cannot be allocated
    /// @see av_malloc()
    pub fn av_mallocz(size: usize) -> *mut lang_items::c_void;
}
extern "C" {
    /// Allocate a memory block for an array with av_malloc().
    ///
    /// The allocated memory will have size `size * nmemb` bytes.
    ///
    /// @param nmemb Number of element
    /// @param size  Size of a single element
    /// @return Pointer to the allocated block, or `NULL` if the block cannot
    /// be allocated
    /// @see av_malloc()
    pub fn av_malloc_array(nmemb: usize, size: usize) -> *mut lang_items::c_void;
}
extern "C" {
    /// Allocate a memory block for an array with av_mallocz().
    ///
    /// The allocated memory will have size `size * nmemb` bytes.
    ///
    /// @param nmemb Number of elements
    /// @param size  Size of the single element
    /// @return Pointer to the allocated block, or `NULL` if the block cannot
    /// be allocated
    ///
    /// @see av_mallocz()
    /// @see av_malloc_array()
    pub fn av_mallocz_array(nmemb: usize, size: usize) -> *mut lang_items::c_void;
}
extern "C" {
    /// Non-inlined equivalent of av_mallocz_array().
    ///
    /// Created for symmetry with the calloc() C function.
    pub fn av_calloc(nmemb: usize, size: usize) -> *mut lang_items::c_void;
}
extern "C" {
    /// Allocate, reallocate, or free a block of memory.
    ///
    /// If `ptr` is `NULL` and `size` > 0, allocate a new block. If `size` is
    /// zero, free the memory block pointed to by `ptr`. Otherwise, expand or
    /// shrink that block of memory according to `size`.
    ///
    /// @param ptr  Pointer to a memory block already allocated with
    /// av_realloc() or `NULL`
    /// @param size Size in bytes of the memory block to be allocated or
    /// reallocated
    ///
    /// @return Pointer to a newly-reallocated block or `NULL` if the block
    /// cannot be reallocated or the function is used to free the memory block
    ///
    /// @warning Unlike av_malloc(), the returned pointer is not guaranteed to be
    /// correctly aligned.
    /// @see av_fast_realloc()
    /// @see av_reallocp()
    pub fn av_realloc(ptr: *mut lang_items::c_void, size: usize) -> *mut lang_items::c_void;
}
extern "C" {
    /// Allocate, reallocate, or free a block of memory through a pointer to a
    /// pointer.
    ///
    /// If `*ptr` is `NULL` and `size` > 0, allocate a new block. If `size` is
    /// zero, free the memory block pointed to by `*ptr`. Otherwise, expand or
    /// shrink that block of memory according to `size`.
    ///
    /// @param[in,out] ptr  Pointer to a pointer to a memory block already allocated
    /// with av_realloc(), or a pointer to `NULL`. The pointer
    /// is updated on success, or freed on failure.
    /// @param[in]     size Size in bytes for the memory block to be allocated or
    /// reallocated
    ///
    /// @return Zero on success, an AVERROR error code on failure
    ///
    /// @warning Unlike av_malloc(), the allocated memory is not guaranteed to be
    /// correctly aligned.
    pub fn av_reallocp(ptr: *mut lang_items::c_void, size: usize) -> lang_items::c_int;
}
extern "C" {
    /// Allocate, reallocate, or free a block of memory.
    ///
    /// This function does the same thing as av_realloc(), except:
    /// - It takes two size arguments and allocates `nelem * elsize` bytes,
    /// after checking the result of the multiplication for integer overflow.
    /// - It frees the input block in case of failure, thus avoiding the memory
    /// leak with the classic
    /// @code{.c}
    /// buf = realloc(buf);
    /// if (!buf)
    /// return -1;
    /// @endcode
    /// pattern.
    pub fn av_realloc_f(
        ptr: *mut lang_items::c_void,
        nelem: usize,
        elsize: usize,
    ) -> *mut lang_items::c_void;
}
extern "C" {
    /// Allocate, reallocate, or free an array.
    ///
    /// If `ptr` is `NULL` and `nmemb` > 0, allocate a new block. If
    /// `nmemb` is zero, free the memory block pointed to by `ptr`.
    ///
    /// @param ptr   Pointer to a memory block already allocated with
    /// av_realloc() or `NULL`
    /// @param nmemb Number of elements in the array
    /// @param size  Size of the single element of the array
    ///
    /// @return Pointer to a newly-reallocated block or NULL if the block
    /// cannot be reallocated or the function is used to free the memory block
    ///
    /// @warning Unlike av_malloc(), the allocated memory is not guaranteed to be
    /// correctly aligned.
    /// @see av_reallocp_array()
    pub fn av_realloc_array(
        ptr: *mut lang_items::c_void,
        nmemb: usize,
        size: usize,
    ) -> *mut lang_items::c_void;
}
extern "C" {
    /// Allocate, reallocate, or free an array through a pointer to a pointer.
    ///
    /// If `*ptr` is `NULL` and `nmemb` > 0, allocate a new block. If `nmemb` is
    /// zero, free the memory block pointed to by `*ptr`.
    ///
    /// @param[in,out] ptr   Pointer to a pointer to a memory block already
    /// allocated with av_realloc(), or a pointer to `NULL`.
    /// The pointer is updated on success, or freed on failure.
    /// @param[in]     nmemb Number of elements
    /// @param[in]     size  Size of the single element
    ///
    /// @return Zero on success, an AVERROR error code on failure
    ///
    /// @warning Unlike av_malloc(), the allocated memory is not guaranteed to be
    /// correctly aligned.
    pub fn av_reallocp_array(
        ptr: *mut lang_items::c_void,
        nmemb: usize,
        size: usize,
    ) -> lang_items::c_int;
}
extern "C" {
    /// Reallocate the given buffer if it is not large enough, otherwise do nothing.
    ///
    /// If the given buffer is `NULL`, then a new uninitialized buffer is allocated.
    ///
    /// If the given buffer is not large enough, and reallocation fails, `NULL` is
    /// returned and `*size` is set to 0, but the original buffer is not changed or
    /// freed.
    ///
    /// A typical use pattern follows:
    ///
    /// @code{.c}
    /// uint8_t *buf = ...;
    /// uint8_t *new_buf = av_fast_realloc(buf, &current_size, size_needed);
    /// if (!new_buf) {
    /// // Allocation failed; clean up original buffer
    /// av_freep(&buf);
    /// return AVERROR(ENOMEM);
    /// }
    /// @endcode
    ///
    /// @param[in,out] ptr      Already allocated buffer, or `NULL`
    /// @param[in,out] size     Pointer to current size of buffer `ptr`. `*size` is
    /// changed to `min_size` in case of success or 0 in
    /// case of failure
    /// @param[in]     min_size New size of buffer `ptr`
    /// @return `ptr` if the buffer is large enough, a pointer to newly reallocated
    /// buffer if the buffer was not large enough, or `NULL` in case of
    /// error
    /// @see av_realloc()
    /// @see av_fast_malloc()
    pub fn av_fast_realloc(
        ptr: *mut lang_items::c_void,
        size: *mut lang_items::c_uint,
        min_size: usize,
    ) -> *mut lang_items::c_void;
}
extern "C" {
    /// Allocate a buffer, reusing the given one if large enough.
    ///
    /// Contrary to av_fast_realloc(), the current buffer contents might not be
    /// preserved and on error the old buffer is freed, thus no special handling to
    /// avoid memleaks is necessary.
    ///
    /// `*ptr` is allowed to be `NULL`, in which case allocation always happens if
    /// `size_needed` is greater than 0.
    ///
    /// @code{.c}
    /// uint8_t *buf = ...;
    /// av_fast_malloc(&buf, &current_size, size_needed);
    /// if (!buf) {
    /// // Allocation failed; buf already freed
    /// return AVERROR(ENOMEM);
    /// }
    /// @endcode
    ///
    /// @param[in,out] ptr      Pointer to pointer to an already allocated buffer.
    /// `*ptr` will be overwritten with pointer to new
    /// buffer on success or `NULL` on failure
    /// @param[in,out] size     Pointer to current size of buffer `*ptr`. `*size` is
    /// changed to `min_size` in case of success or 0 in
    /// case of failure
    /// @param[in]     min_size New size of buffer `*ptr`
    /// @see av_realloc()
    /// @see av_fast_mallocz()
    pub fn av_fast_malloc(
        ptr: *mut lang_items::c_void,
        size: *mut lang_items::c_uint,
        min_size: usize,
    );
}
extern "C" {
    /// Allocate and clear a buffer, reusing the given one if large enough.
    ///
    /// Like av_fast_malloc(), but all newly allocated space is initially cleared.
    /// Reused buffer is not cleared.
    ///
    /// `*ptr` is allowed to be `NULL`, in which case allocation always happens if
    /// `size_needed` is greater than 0.
    ///
    /// @param[in,out] ptr      Pointer to pointer to an already allocated buffer.
    /// `*ptr` will be overwritten with pointer to new
    /// buffer on success or `NULL` on failure
    /// @param[in,out] size     Pointer to current size of buffer `*ptr`. `*size` is
    /// changed to `min_size` in case of success or 0 in
    /// case of failure
    /// @param[in]     min_size New size of buffer `*ptr`
    /// @see av_fast_malloc()
    pub fn av_fast_mallocz(
        ptr: *mut lang_items::c_void,
        size: *mut lang_items::c_uint,
        min_size: usize,
    );
}
extern "C" {
    /// Free a memory block which has been allocated with a function of av_malloc()
    /// or av_realloc() family.
    ///
    /// @param ptr Pointer to the memory block which should be freed.
    ///
    /// @note `ptr = NULL` is explicitly allowed.
    /// @note It is recommended that you use av_freep() instead, to prevent leaving
    /// behind dangling pointers.
    /// @see av_freep()
    pub fn av_free(ptr: *mut lang_items::c_void);
}
extern "C" {
    /// Free a memory block which has been allocated with a function of av_malloc()
    /// or av_realloc() family, and set the pointer pointing to it to `NULL`.
    ///
    /// @code{.c}
    /// uint8_t *buf = av_malloc(16);
    /// av_free(buf);
    /// // buf now contains a dangling pointer to freed memory, and accidental
    /// // dereference of buf will result in a use-after-free, which may be a
    /// // security risk.
    ///
    /// uint8_t *buf = av_malloc(16);
    /// av_freep(&buf);
    /// // buf is now NULL, and accidental dereference will only result in a
    /// // NULL-pointer dereference.
    /// @endcode
    ///
    /// @param ptr Pointer to the pointer to the memory block which should be freed
    /// @note `*ptr = NULL` is safe and leads to no action.
    /// @see av_free()
    pub fn av_freep(ptr: *mut lang_items::c_void);
}
extern "C" {
    /// Duplicate a string.
    ///
    /// @param s String to be duplicated
    /// @return Pointer to a newly-allocated string containing a
    /// copy of `s` or `NULL` if the string cannot be allocated
    /// @see av_strndup()
    pub fn av_strdup(s: *const lang_items::c_char) -> *mut lang_items::c_char;
}
extern "C" {
    /// Duplicate a substring of a string.
    ///
    /// @param s   String to be duplicated
    /// @param len Maximum length of the resulting string (not counting the
    /// terminating byte)
    /// @return Pointer to a newly-allocated string containing a
    /// substring of `s` or `NULL` if the string cannot be allocated
    pub fn av_strndup(s: *const lang_items::c_char, len: usize) -> *mut lang_items::c_char;
}
extern "C" {
    /// Duplicate a buffer with av_malloc().
    ///
    /// @param p    Buffer to be duplicated
    /// @param size Size in bytes of the buffer copied
    /// @return Pointer to a newly allocated buffer containing a
    /// copy of `p` or `NULL` if the buffer cannot be allocated
    pub fn av_memdup(p: *const lang_items::c_void, size: usize) -> *mut lang_items::c_void;
}
extern "C" {
    /// Overlapping memcpy() implementation.
    ///
    /// @param dst  Destination buffer
    /// @param back Number of bytes back to start copying (i.e. the initial size of
    /// the overlapping window); must be > 0
    /// @param cnt  Number of bytes to copy; must be >= 0
    ///
    /// @note `cnt > back` is valid, this will copy the bytes we just copied,
    /// thus creating a repeating pattern with a period length of `back`.
    pub fn av_memcpy_backptr(dst: *mut u8, back: lang_items::c_int, cnt: lang_items::c_int);
}
extern "C" {
    /// Add the pointer to an element to a dynamic array.
    ///
    /// The array to grow is supposed to be an array of pointers to
    /// structures, and the element to add must be a pointer to an already
    /// allocated structure.
    ///
    /// The array is reallocated when its size reaches powers of 2.
    /// Therefore, the amortized cost of adding an element is constant.
    ///
    /// In case of success, the pointer to the array is updated in order to
    /// point to the new grown array, and the number pointed to by `nb_ptr`
    /// is incremented.
    /// In case of failure, the array is freed, `*tab_ptr` is set to `NULL` and
    /// `*nb_ptr` is set to 0.
    ///
    /// @param[in,out] tab_ptr Pointer to the array to grow
    /// @param[in,out] nb_ptr  Pointer to the number of elements in the array
    /// @param[in]     elem    Element to add
    /// @see av_dynarray_add_nofree(), av_dynarray2_add()
    pub fn av_dynarray_add(
        tab_ptr: *mut lang_items::c_void,
        nb_ptr: *mut lang_items::c_int,
        elem: *mut lang_items::c_void,
    );
}
extern "C" {
    /// Add an element to a dynamic array.
    ///
    /// Function has the same functionality as av_dynarray_add(),
    /// but it doesn't free memory on fails. It returns error code
    /// instead and leave current buffer untouched.
    ///
    /// @return >=0 on success, negative otherwise
    /// @see av_dynarray_add(), av_dynarray2_add()
    pub fn av_dynarray_add_nofree(
        tab_ptr: *mut lang_items::c_void,
        nb_ptr: *mut lang_items::c_int,
        elem: *mut lang_items::c_void,
    ) -> lang_items::c_int;
}
extern "C" {
    /// Add an element of size `elem_size` to a dynamic array.
    ///
    /// The array is reallocated when its number of elements reaches powers of 2.
    /// Therefore, the amortized cost of adding an element is constant.
    ///
    /// In case of success, the pointer to the array is updated in order to
    /// point to the new grown array, and the number pointed to by `nb_ptr`
    /// is incremented.
    /// In case of failure, the array is freed, `*tab_ptr` is set to `NULL` and
    /// `*nb_ptr` is set to 0.
    ///
    /// @param[in,out] tab_ptr   Pointer to the array to grow
    /// @param[in,out] nb_ptr    Pointer to the number of elements in the array
    /// @param[in]     elem_size Size in bytes of an element in the array
    /// @param[in]     elem_data Pointer to the data of the element to add. If
    /// `NULL`, the space of the newly added element is
    /// allocated but left uninitialized.
    ///
    /// @return Pointer to the data of the element to copy in the newly allocated
    /// space
    /// @see av_dynarray_add(), av_dynarray_add_nofree()
    pub fn av_dynarray2_add(
        tab_ptr: *mut *mut lang_items::c_void,
        nb_ptr: *mut lang_items::c_int,
        elem_size: usize,
        elem_data: *const u8,
    ) -> *mut lang_items::c_void;
}
extern "C" {
    /// Set the maximum size that may be allocated in one block.
    ///
    /// The value specified with this function is effective for all libavutil's @ref
    /// lavu_mem_funcs "heap management functions."
    ///
    /// By default, the max value is defined as `INT_MAX`.
    ///
    /// @param max Value to be set as the new maximum size
    ///
    /// @warning Exercise extreme caution when using this function. Don't touch
    /// this if you do not understand the full consequence of doing so.
    pub fn av_max_alloc(max: usize);
}
/// Rational number (pair of numerator and denominator).
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct AVRational {
    /// < Numerator
    pub num: lang_items::c_int,
    /// < Denominator
    pub den: lang_items::c_int,
}
#[test]
fn bindgen_test_layout_AVRational() {
    assert_eq!(
        std::mem::size_of::<AVRational>(),
        8usize,
        concat!("Size of: ", stringify!(AVRational))
    );
    assert_eq!(
        std::mem::align_of::<AVRational>(),
        4usize,
        concat!("Alignment of ", stringify!(AVRational))
    );
    assert_eq!(
        unsafe { &(*(std::ptr::null::<AVRational>())).num as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(AVRational),
            "::",
            stringify!(num)
        )
    );
    assert_eq!(
        unsafe { &(*(std::ptr::null::<AVRational>())).den as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(AVRational),
            "::",
            stringify!(den)
        )
    );
}
extern "C" {
    /// Reduce a fraction.
    ///
    /// This is useful for framerate calculations.
    ///
    /// @param[out] dst_num Destination numerator
    /// @param[out] dst_den Destination denominator
    /// @param[in]      num Source numerator
    /// @param[in]      den Source denominator
    /// @param[in]      max Maximum allowed values for `dst_num` & `dst_den`
    /// @return 1 if the operation is exact, 0 otherwise
    pub fn av_reduce(
        dst_num: *mut lang_items::c_int,
        dst_den: *mut lang_items::c_int,
        num: i64,
        den: i64,
        max: i64,
    ) -> lang_items::c_int;
}
extern "C" {
    /// Multiply two rationals.
    /// @param b First rational
    /// @param c Second rational
    /// @return b*c
    pub fn av_mul_q(b: AVRational, c: AVRational) -> AVRational;
}
extern "C" {
    /// Divide one rational by another.
    /// @param b First rational
    /// @param c Second rational
    /// @return b/c
    pub fn av_div_q(b: AVRational, c: AVRational) -> AVRational;
}
extern "C" {
    /// Add two rationals.
    /// @param b First rational
    /// @param c Second rational
    /// @return b+c
    pub fn av_add_q(b: AVRational, c: AVRational) -> AVRational;
}
extern "C" {
    /// Subtract one rational from another.
    /// @param b First rational
    /// @param c Second rational
    /// @return b-c
    pub fn av_sub_q(b: AVRational, c: AVRational) -> AVRational;
}
extern "C" {
    /// Convert a double precision floating point number to a rational.
    ///
    /// In case of infinity, the returned value is expressed as `{1, 0}` or
    /// `{-1, 0}` depending on the sign.
    ///
    /// @param d   `double` to convert
    /// @param max Maximum allowed numerator and denominator
    /// @return `d` in AVRational form
    /// @see av_q2d()
    pub fn av_d2q(d: f64, max: lang_items::c_int) -> AVRational;
}
extern "C" {
    /// Find which of the two rationals is closer to another rational.
    ///
    /// @param q     Rational to be compared against
    /// @param q1,q2 Rationals to be tested
    /// @return One of the following values:
    /// - 1 if `q1` is nearer to `q` than `q2`
    /// - -1 if `q2` is nearer to `q` than `q1`
    /// - 0 if they have the same distance
    pub fn av_nearer_q(q: AVRational, q1: AVRational, q2: AVRational) -> lang_items::c_int;
}
extern "C" {
    /// Find the value in a list of rationals nearest a given reference rational.
    ///
    /// @param q      Reference rational
    /// @param q_list Array of rationals terminated by `{0, 0}`
    /// @return Index of the nearest value found in the array
    pub fn av_find_nearest_q_idx(q: AVRational, q_list: *const AVRational) -> lang_items::c_int;
}
extern "C" {
    /// Convert an AVRational to a IEEE 32-bit `float` expressed in fixed-point
    /// format.
    ///
    /// @param q Rational to be converted
    /// @return Equivalent floating-point value, expressed as an unsigned 32-bit
    /// integer.
    /// @note The returned value is platform-indepedant.
    pub fn av_q2intfloat(q: AVRational) -> u32;
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union av_intfloat32 {
    pub i: u32,
    pub f: f32,
    _bindgen_union_align: u32,
}
#[test]
fn bindgen_test_layout_av_intfloat32() {
    assert_eq!(
        std::mem::size_of::<av_intfloat32>(),
        4usize,
        concat!("Size of: ", stringify!(av_intfloat32))
    );
    assert_eq!(
        std::mem::align_of::<av_intfloat32>(),
        4usize,
        concat!("Alignment of ", stringify!(av_intfloat32))
    );
    assert_eq!(
        unsafe { &(*(std::ptr::null::<av_intfloat32>())).i as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(av_intfloat32),
            "::",
            stringify!(i)
        )
    );
    assert_eq!(
        unsafe { &(*(std::ptr::null::<av_intfloat32>())).f as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(av_intfloat32),
            "::",
            stringify!(f)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union av_intfloat64 {
    pub i: u64,
    pub f: f64,
    _bindgen_union_align: u64,
}
#[test]
fn bindgen_test_layout_av_intfloat64() {
    assert_eq!(
        std::mem::size_of::<av_intfloat64>(),
        8usize,
        concat!("Size of: ", stringify!(av_intfloat64))
    );
    assert_eq!(
        std::mem::align_of::<av_intfloat64>(),
        8usize,
        concat!("Alignment of ", stringify!(av_intfloat64))
    );
    assert_eq!(
        unsafe { &(*(std::ptr::null::<av_intfloat64>())).i as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(av_intfloat64),
            "::",
            stringify!(i)
        )
    );
    assert_eq!(
        unsafe { &(*(std::ptr::null::<av_intfloat64>())).f as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(av_intfloat64),
            "::",
            stringify!(f)
        )
    );
}
/// < Round toward zero.
pub const AVRounding_AV_ROUND_ZERO: AVRounding = 0;
/// < Round away from zero.
pub const AVRounding_AV_ROUND_INF: AVRounding = 1;
/// < Round toward -infinity.
pub const AVRounding_AV_ROUND_DOWN: AVRounding = 2;
/// < Round toward +infinity.
pub const AVRounding_AV_ROUND_UP: AVRounding = 3;
/// < Round to nearest and halfway cases away from zero.
pub const AVRounding_AV_ROUND_NEAR_INF: AVRounding = 5;
/// Flag telling rescaling functions to pass `INT64_MIN`/`MAX` through
/// unchanged, avoiding special cases for #AV_NOPTS_VALUE.
///
/// Unlike other values of the enumeration AVRounding, this value is a
/// bitmask that must be used in conjunction with another value of the
/// enumeration through a bitwise OR, in order to set behavior for normal
/// cases.
///
/// @code{.c}
/// av_rescale_rnd(3, 1, 2, AV_ROUND_UP | AV_ROUND_PASS_MINMAX);
/// // Rescaling 3:
/// //     Calculating 3 * 1 / 2
/// //     3 / 2 is rounded up to 2
/// //     => 2
///
/// av_rescale_rnd(AV_NOPTS_VALUE, 1, 2, AV_ROUND_UP | AV_ROUND_PASS_MINMAX);
/// // Rescaling AV_NOPTS_VALUE:
/// //     AV_NOPTS_VALUE == INT64_MIN
/// //     AV_NOPTS_VALUE is passed through
/// //     => AV_NOPTS_VALUE
/// @endcode
pub const AVRounding_AV_ROUND_PASS_MINMAX: AVRounding = 8192;
/// Rounding methods.
pub type AVRounding = u32;
extern "C" {
    /// Compute the greatest common divisor of two integer operands.
    ///
    /// @param a,b Operands
    /// @return GCD of a and b up to sign; if a >= 0 and b >= 0, return value is >= 0;
    /// if a == 0 and b == 0, returns 0.
    pub fn av_gcd(a: i64, b: i64) -> i64;
}
extern "C" {
    /// Rescale a 64-bit integer with rounding to nearest.
    ///
    /// The operation is mathematically equivalent to `a * b / c`, but writing that
    /// directly can overflow.
    ///
    /// This function is equivalent to av_rescale_rnd() with #AV_ROUND_NEAR_INF.
    ///
    /// @see av_rescale_rnd(), av_rescale_q(), av_rescale_q_rnd()
    pub fn av_rescale(a: i64, b: i64, c: i64) -> i64;
}
extern "C" {
    /// Rescale a 64-bit integer with specified rounding.
    ///
    /// The operation is mathematically equivalent to `a * b / c`, but writing that
    /// directly can overflow, and does not support different rounding methods.
    ///
    /// @see av_rescale(), av_rescale_q(), av_rescale_q_rnd()
    pub fn av_rescale_rnd(a: i64, b: i64, c: i64, rnd: AVRounding) -> i64;
}
extern "C" {
    /// Rescale a 64-bit integer by 2 rational numbers.
    ///
    /// The operation is mathematically equivalent to `a * bq / cq`.
    ///
    /// This function is equivalent to av_rescale_q_rnd() with #AV_ROUND_NEAR_INF.
    ///
    /// @see av_rescale(), av_rescale_rnd(), av_rescale_q_rnd()
    pub fn av_rescale_q(a: i64, bq: AVRational, cq: AVRational) -> i64;
}
extern "C" {
    /// Rescale a 64-bit integer by 2 rational numbers with specified rounding.
    ///
    /// The operation is mathematically equivalent to `a * bq / cq`.
    ///
    /// @see av_rescale(), av_rescale_rnd(), av_rescale_q()
    pub fn av_rescale_q_rnd(a: i64, bq: AVRational, cq: AVRational, rnd: AVRounding) -> i64;
}
extern "C" {
    /// Compare two timestamps each in its own time base.
    ///
    /// @return One of the following values:
    /// - -1 if `ts_a` is before `ts_b`
    /// - 1 if `ts_a` is after `ts_b`
    /// - 0 if they represent the same position
    ///
    /// @warning
    /// The result of the function is undefined if one of the timestamps is outside
    /// the `int64_t` range when represented in the other's timebase.
    pub fn av_compare_ts(
        ts_a: i64,
        tb_a: AVRational,
        ts_b: i64,
        tb_b: AVRational,
    ) -> lang_items::c_int;
}
extern "C" {
    /// Compare the remainders of two integer operands divided by a common divisor.
    ///
    /// In other words, compare the least significant `log2(mod)` bits of integers
    /// `a` and `b`.
    ///
    /// @code{.c}
    /// av_compare_mod(0x11, 0x02, 0x10) < 0 // since 0x11 % 0x10  (0x1) < 0x02 % 0x10  (0x2)
    /// av_compare_mod(0x11, 0x02, 0x20) > 0 // since 0x11 % 0x20 (0x11) > 0x02 % 0x20 (0x02)
    /// @endcode
    ///
    /// @param a,b Operands
    /// @param mod Divisor; must be a power of 2
    /// @return
    /// - a negative value if `a % mod < b % mod`
    /// - a positive value if `a % mod > b % mod`
    /// - zero             if `a % mod == b % mod`
    pub fn av_compare_mod(a: u64, b: u64, mod_: u64) -> i64;
}
extern "C" {
    /// Rescale a timestamp while preserving known durations.
    ///
    /// This function is designed to be called per audio packet to scale the input
    /// timestamp to a different time base. Compared to a simple av_rescale_q()
    /// call, this function is robust against possible inconsistent frame durations.
    ///
    /// The `last` parameter is a state variable that must be preserved for all
    /// subsequent calls for the same stream. For the first call, `*last` should be
    /// initialized to #AV_NOPTS_VALUE.
    ///
    /// @param[in]     in_tb    Input time base
    /// @param[in]     in_ts    Input timestamp
    /// @param[in]     fs_tb    Duration time base; typically this is finer-grained
    /// (greater) than `in_tb` and `out_tb`
    /// @param[in]     duration Duration till the next call to this function (i.e.
    /// duration of the current packet/frame)
    /// @param[in,out] last     Pointer to a timestamp expressed in terms of
    /// `fs_tb`, acting as a state variable
    /// @param[in]     out_tb   Output timebase
    /// @return        Timestamp expressed in terms of `out_tb`
    ///
    /// @note In the context of this function, "duration" is in term of samples, not
    /// seconds.
    pub fn av_rescale_delta(
        in_tb: AVRational,
        in_ts: i64,
        fs_tb: AVRational,
        duration: lang_items::c_int,
        last: *mut i64,
        out_tb: AVRational,
    ) -> i64;
}
extern "C" {
    /// Add a value to a timestamp.
    ///
    /// This function guarantees that when the same value is repeatly added that
    /// no accumulation of rounding errors occurs.
    ///
    /// @param[in] ts     Input timestamp
    /// @param[in] ts_tb  Input timestamp time base
    /// @param[in] inc    Value to be added
    /// @param[in] inc_tb Time base of `inc`
    pub fn av_add_stable(ts_tb: AVRational, ts: i64, inc_tb: AVRational, inc: i64) -> i64;
}
pub const AVClassCategory_AV_CLASS_CATEGORY_NA: AVClassCategory = 0;
pub const AVClassCategory_AV_CLASS_CATEGORY_INPUT: AVClassCategory = 1;
pub const AVClassCategory_AV_CLASS_CATEGORY_OUTPUT: AVClassCategory = 2;
pub const AVClassCategory_AV_CLASS_CATEGORY_MUXER: AVClassCategory = 3;
pub const AVClassCategory_AV_CLASS_CATEGORY_DEMUXER: AVClassCategory = 4;
pub const AVClassCategory_AV_CLASS_CATEGORY_ENCODER: AVClassCategory = 5;
pub const AVClassCategory_AV_CLASS_CATEGORY_DECODER: AVClassCategory = 6;
pub const AVClassCategory_AV_CLASS_CATEGORY_FILTER: AVClassCategory = 7;
pub const AVClassCategory_AV_CLASS_CATEGORY_BITSTREAM_FILTER: AVClassCategory = 8;
pub const AVClassCategory_AV_CLASS_CATEGORY_SWSCALER: AVClassCategory = 9;
pub const AVClassCategory_AV_CLASS_CATEGORY_SWRESAMPLER: AVClassCategory = 10;
pub const AVClassCategory_AV_CLASS_CATEGORY_DEVICE_VIDEO_OUTPUT: AVClassCategory = 40;
pub const AVClassCategory_AV_CLASS_CATEGORY_DEVICE_VIDEO_INPUT: AVClassCategory = 41;
pub const AVClassCategory_AV_CLASS_CATEGORY_DEVICE_AUDIO_OUTPUT: AVClassCategory = 42;
pub const AVClassCategory_AV_CLASS_CATEGORY_DEVICE_AUDIO_INPUT: AVClassCategory = 43;
pub const AVClassCategory_AV_CLASS_CATEGORY_DEVICE_OUTPUT: AVClassCategory = 44;
pub const AVClassCategory_AV_CLASS_CATEGORY_DEVICE_INPUT: AVClassCategory = 45;
/// < not part of ABI/API
pub const AVClassCategory_AV_CLASS_CATEGORY_NB: AVClassCategory = 46;
pub type AVClassCategory = u32;
/// Describe the class of an AVClass context structure. That is an
/// arbitrary struct of which the first field is a pointer to an
/// AVClass struct (e.g. AVCodecContext, AVFormatContext etc.).
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct AVClass {
    /// The name of the class; usually it is the same name as the
    /// context structure type to which the AVClass is associated.
    pub class_name: *const lang_items::c_char,
    /// A pointer to a function which returns the name of a context
    /// instance ctx associated with the class.
    pub item_name: std::option::Option<
        unsafe extern "C" fn(ctx: *mut lang_items::c_void) -> *const lang_items::c_char,
    >,
    /// a pointer to the first option specified in the class if any or NULL
    ///
    /// @see av_set_default_options()
    pub option: *const AVOption,
    /// LIBAVUTIL_VERSION with which this structure was created.
    /// This is used to allow fields to be added without requiring major
    /// version bumps everywhere.
    pub version: lang_items::c_int,
    /// Offset in the structure where log_level_offset is stored.
    /// 0 means there is no such variable
    pub log_level_offset_offset: lang_items::c_int,
    /// Offset in the structure where a pointer to the parent context for
    /// logging is stored. For example a decoder could pass its AVCodecContext
    /// to eval as such a parent context, which an av_log() implementation
    /// could then leverage to display the parent context.
    /// The offset can be NULL.
    pub parent_log_context_offset: lang_items::c_int,
    /// Return next AVOptions-enabled child or NULL
    pub child_next: std::option::Option<
        unsafe extern "C" fn(obj: *mut lang_items::c_void, prev: *mut lang_items::c_void)
            -> *mut lang_items::c_void,
    >,
    /// Return an AVClass corresponding to the next potential
    /// AVOptions-enabled child.
    ///
    /// The difference between child_next and this is that
    /// child_next iterates over _already existing_ objects, while
    /// child_class_next iterates over _all possible_ children.
    pub child_class_next:
        std::option::Option<unsafe extern "C" fn(prev: *const AVClass) -> *const AVClass>,
    /// Category used for visualization (like color)
    /// This is only set if the category is equal for all objects using this class.
    /// available since version (51 << 16 | 56 << 8 | 100)
    pub category: AVClassCategory,
    /// Callback to return the category.
    /// available since version (51 << 16 | 59 << 8 | 100)
    pub get_category: std::option::Option<
        unsafe extern "C" fn(ctx: *mut lang_items::c_void) -> AVClassCategory,
    >,
    /// Callback to return the supported/allowed ranges.
    /// available since version (52.12)
    pub query_ranges: std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut *mut AVOptionRanges,
            obj: *mut lang_items::c_void,
            key: *const lang_items::c_char,
            flags: lang_items::c_int,
        ) -> lang_items::c_int,
    >,
}
#[test]
fn bindgen_test_layout_AVClass() {
    assert_eq!(
        std::mem::size_of::<AVClass>(),
        80usize,
        concat!("Size of: ", stringify!(AVClass))
    );
    assert_eq!(
        std::mem::align_of::<AVClass>(),
        8usize,
        concat!("Alignment of ", stringify!(AVClass))
    );
    assert_eq!(
        unsafe { &(*(std::ptr::null::<AVClass>())).class_name as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(AVClass),
            "::",
            stringify!(class_name)
        )
    );
    assert_eq!(
        unsafe { &(*(std::ptr::null::<AVClass>())).item_name as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(AVClass),
            "::",
            stringify!(item_name)
        )
    );
    assert_eq!(
        unsafe { &(*(std::ptr::null::<AVClass>())).option as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(AVClass),
            "::",
            stringify!(option)
        )
    );
    assert_eq!(
        unsafe { &(*(std::ptr::null::<AVClass>())).version as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(AVClass),
            "::",
            stringify!(version)
        )
    );
    assert_eq!(
        unsafe {
            &(*(std::ptr::null::<AVClass>())).log_level_offset_offset as *const _ as usize
        },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(AVClass),
            "::",
            stringify!(log_level_offset_offset)
        )
    );
    assert_eq!(
        unsafe {
            &(*(std::ptr::null::<AVClass>())).parent_log_context_offset as *const _ as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(AVClass),
            "::",
            stringify!(parent_log_context_offset)
        )
    );
    assert_eq!(
        unsafe { &(*(std::ptr::null::<AVClass>())).child_next as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(AVClass),
            "::",
            stringify!(child_next)
        )
    );
    assert_eq!(
        unsafe { &(*(std::ptr::null::<AVClass>())).child_class_next as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(AVClass),
            "::",
            stringify!(child_class_next)
        )
    );
    assert_eq!(
        unsafe { &(*(std::ptr::null::<AVClass>())).category as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(AVClass),
            "::",
            stringify!(category)
        )
    );
    assert_eq!(
        unsafe { &(*(std::ptr::null::<AVClass>())).get_category as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(AVClass),
            "::",
            stringify!(get_category)
        )
    );
    assert_eq!(
        unsafe { &(*(std::ptr::null::<AVClass>())).query_ranges as *const _ as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(AVClass),
            "::",
            stringify!(query_ranges)
        )
    );
}
extern "C" {
    /// Send the specified message to the log if the level is less than or equal
    /// to the current av_log_level. By default, all logging messages are sent to
    /// stderr. This behavior can be altered by setting a different logging callback
    /// function.
    /// @see av_log_set_callback
    ///
    /// @param avcl A pointer to an arbitrary struct of which the first field is a
    /// pointer to an AVClass struct or NULL if general log.
    /// @param level The importance level of the message expressed using a @ref
    /// lavu_log_constants "Logging Constant".
    /// @param fmt The format string (printf-compatible) that specifies how
    /// subsequent arguments are converted to output.
    pub fn av_log(
        avcl: *mut lang_items::c_void,
        level: lang_items::c_int,
        fmt: *const lang_items::c_char,
        ...
    );
}
extern "C" {
    /// Send the specified message to the log if the level is less than or equal
    /// to the current av_log_level. By default, all logging messages are sent to
    /// stderr. This behavior can be altered by setting a different logging callback
    /// function.
    /// @see av_log_set_callback
    ///
    /// @param avcl A pointer to an arbitrary struct of which the first field is a
    /// pointer to an AVClass struct.
    /// @param level The importance level of the message expressed using a @ref
    /// lavu_log_constants "Logging Constant".
    /// @param fmt The format string (printf-compatible) that specifies how
    /// subsequent arguments are converted to output.
    /// @param vl The arguments referenced by the format string.
    pub fn av_vlog(
        avcl: *mut lang_items::c_void,
        level: lang_items::c_int,
        fmt: *const lang_items::c_char,
        vl: va_list,
    );
}
extern "C" {
    /// Get the current log level
    ///
    /// @see lavu_log_constants
    ///
    /// @return Current log level
    pub fn av_log_get_level() -> lang_items::c_int;
}
extern "C" {
    /// Set the log level
    ///
    /// @see lavu_log_constants
    ///
    /// @param level Logging level
    pub fn av_log_set_level(level: lang_items::c_int);
}
extern "C" {
    /// Set the logging callback
    ///
    /// @note The callback must be thread safe, even if the application does not use
    /// threads itself as some codecs are multithreaded.
    ///
    /// @see av_log_default_callback
    ///
    /// @param callback A logging function with a compatible signature.
    pub fn av_log_set_callback(
        callback: std::option::Option<
            unsafe extern "C" fn(
                arg1: *mut lang_items::c_void,
                arg2: lang_items::c_int,
                arg3: *const lang_items::c_char,
                arg4: va_list,
            ),
        >,
    );
}
extern "C" {
    /// Default logging callback
    ///
    /// It prints the message to stderr, optionally colorizing it.
    ///
    /// @param avcl A pointer to an arbitrary struct of which the first field is a
    /// pointer to an AVClass struct.
    /// @param level The importance level of the message expressed using a @ref
    /// lavu_log_constants "Logging Constant".
    /// @param fmt The format string (printf-compatible) that specifies how
    /// subsequent arguments are converted to output.
    /// @param vl The arguments referenced by the format string.
    pub fn av_log_default_callback(
        avcl: *mut lang_items::c_void,
        level: lang_items::c_int,
        fmt: *const lang_items::c_char,
        vl: va_list,
    );
}
extern "C" {
    /// Return the context name
    ///
    /// @param  ctx The AVClass context
    ///
    /// @return The AVClass class_name
    pub fn av_default_item_name(ctx: *mut lang_items::c_void) -> *const lang_items::c_char;
}
extern "C" {
    pub fn av_default_get_category(ptr: *mut lang_items::c_void) -> AVClassCategory;
}
extern "C" {
    /// Format a line of log the same way as the default callback.
    /// @param line          buffer to receive the formatted line
    /// @param line_size     size of the buffer
    /// @param print_prefix  used to store whether the prefix must be printed;
    /// must point to a persistent integer initially set to 1
    pub fn av_log_format_line(
        ptr: *mut lang_items::c_void,
        level: lang_items::c_int,
        fmt: *const lang_items::c_char,
        vl: va_list,
        line: *mut lang_items::c_char,
        line_size: lang_items::c_int,
        print_prefix: *mut lang_items::c_int,
    );
}
extern "C" {
    /// Format a line of log the same way as the default callback.
    /// @param line          buffer to receive the formatted line;
    /// may be NULL if line_size is 0
    /// @param line_size     size of the buffer; at most line_size-1 characters will
    /// be written to the buffer, plus one null terminator
    /// @param print_prefix  used to store whether the prefix must be printed;
    /// must point to a persistent integer initially set to 1
    /// @return Returns a negative value if an error occurred, otherwise returns
    /// the number of characters that would have been written for a
    /// sufficiently large buffer, not including the terminating null
    /// character. If the return value is not less than line_size, it means
    /// that the log message was truncated to fit the buffer.
    pub fn av_log_format_line2(
        ptr: *mut lang_items::c_void,
        level: lang_items::c_int,
        fmt: *const lang_items::c_char,
        vl: va_list,
        line: *mut lang_items::c_char,
        line_size: lang_items::c_int,
        print_prefix: *mut lang_items::c_int,
    ) -> lang_items::c_int;
}
extern "C" {
    pub fn av_log_set_flags(arg: lang_items::c_int);
}
extern "C" {
    pub fn av_log_get_flags() -> lang_items::c_int;
}
pub const AVPixelFormat_AV_PIX_FMT_NONE: AVPixelFormat = -1;
/// < planar YUV 4:2:0, 12bpp, (1 Cr & Cb sample per 2x2 Y samples)
pub const AVPixelFormat_AV_PIX_FMT_YUV420P: AVPixelFormat = 0;
/// < packed YUV 4:2:2, 16bpp, Y0 Cb Y1 Cr
pub const AVPixelFormat_AV_PIX_FMT_YUYV422: AVPixelFormat = 1;
/// < packed RGB 8:8:8, 24bpp, RGBRGB...
pub const AVPixelFormat_AV_PIX_FMT_RGB24: AVPixelFormat = 2;
/// < packed RGB 8:8:8, 24bpp, BGRBGR...
pub const AVPixelFormat_AV_PIX_FMT_BGR24: AVPixelFormat = 3;
/// < planar YUV 4:2:2, 16bpp, (1 Cr & Cb sample per 2x1 Y samples)
pub const AVPixelFormat_AV_PIX_FMT_YUV422P: AVPixelFormat = 4;
/// < planar YUV 4:4:4, 24bpp, (1 Cr & Cb sample per 1x1 Y samples)
pub const AVPixelFormat_AV_PIX_FMT_YUV444P: AVPixelFormat = 5;
/// < planar YUV 4:1:0,  9bpp, (1 Cr & Cb sample per 4x4 Y samples)
pub const AVPixelFormat_AV_PIX_FMT_YUV410P: AVPixelFormat = 6;
/// < planar YUV 4:1:1, 12bpp, (1 Cr & Cb sample per 4x1 Y samples)
pub const AVPixelFormat_AV_PIX_FMT_YUV411P: AVPixelFormat = 7;
/// <        Y        ,  8bpp
pub const AVPixelFormat_AV_PIX_FMT_GRAY8: AVPixelFormat = 8;
/// <        Y        ,  1bpp, 0 is white, 1 is black, in each byte pixels are ordered from the msb to the lsb
pub const AVPixelFormat_AV_PIX_FMT_MONOWHITE: AVPixelFormat = 9;
/// <        Y        ,  1bpp, 0 is black, 1 is white, in each byte pixels are ordered from the msb to the lsb
pub const AVPixelFormat_AV_PIX_FMT_MONOBLACK: AVPixelFormat = 10;
/// < 8 bits with AV_PIX_FMT_RGB32 palette
pub const AVPixelFormat_AV_PIX_FMT_PAL8: AVPixelFormat = 11;
/// < planar YUV 4:2:0, 12bpp, full scale (JPEG), deprecated in favor of AV_PIX_FMT_YUV420P and setting color_range
pub const AVPixelFormat_AV_PIX_FMT_YUVJ420P: AVPixelFormat = 12;
/// < planar YUV 4:2:2, 16bpp, full scale (JPEG), deprecated in favor of AV_PIX_FMT_YUV422P and setting color_range
pub const AVPixelFormat_AV_PIX_FMT_YUVJ422P: AVPixelFormat = 13;
/// < planar YUV 4:4:4, 24bpp, full scale (JPEG), deprecated in favor of AV_PIX_FMT_YUV444P and setting color_range
pub const AVPixelFormat_AV_PIX_FMT_YUVJ444P: AVPixelFormat = 14;
/// < packed YUV 4:2:2, 16bpp, Cb Y0 Cr Y1
pub const AVPixelFormat_AV_PIX_FMT_UYVY422: AVPixelFormat = 15;
/// < packed YUV 4:1:1, 12bpp, Cb Y0 Y1 Cr Y2 Y3
pub const AVPixelFormat_AV_PIX_FMT_UYYVYY411: AVPixelFormat = 16;
/// < packed RGB 3:3:2,  8bpp, (msb)2B 3G 3R(lsb)
pub const AVPixelFormat_AV_PIX_FMT_BGR8: AVPixelFormat = 17;
/// < packed RGB 1:2:1 bitstream,  4bpp, (msb)1B 2G 1R(lsb), a byte contains two pixels, the first pixel in the byte is the one composed by the 4 msb bits
pub const AVPixelFormat_AV_PIX_FMT_BGR4: AVPixelFormat = 18;
/// < packed RGB 1:2:1,  8bpp, (msb)1B 2G 1R(lsb)
pub const AVPixelFormat_AV_PIX_FMT_BGR4_BYTE: AVPixelFormat = 19;
/// < packed RGB 3:3:2,  8bpp, (msb)2R 3G 3B(lsb)
pub const AVPixelFormat_AV_PIX_FMT_RGB8: AVPixelFormat = 20;
/// < packed RGB 1:2:1 bitstream,  4bpp, (msb)1R 2G 1B(lsb), a byte contains two pixels, the first pixel in the byte is the one composed by the 4 msb bits
pub const AVPixelFormat_AV_PIX_FMT_RGB4: AVPixelFormat = 21;
/// < packed RGB 1:2:1,  8bpp, (msb)1R 2G 1B(lsb)
pub const AVPixelFormat_AV_PIX_FMT_RGB4_BYTE: AVPixelFormat = 22;
/// < planar YUV 4:2:0, 12bpp, 1 plane for Y and 1 plane for the UV components, which are interleaved (first byte U and the following byte V)
pub const AVPixelFormat_AV_PIX_FMT_NV12: AVPixelFormat = 23;
/// < as above, but U and V bytes are swapped
pub const AVPixelFormat_AV_PIX_FMT_NV21: AVPixelFormat = 24;
/// < packed ARGB 8:8:8:8, 32bpp, ARGBARGB...
pub const AVPixelFormat_AV_PIX_FMT_ARGB: AVPixelFormat = 25;
/// < packed RGBA 8:8:8:8, 32bpp, RGBARGBA...
pub const AVPixelFormat_AV_PIX_FMT_RGBA: AVPixelFormat = 26;
/// < packed ABGR 8:8:8:8, 32bpp, ABGRABGR...
pub const AVPixelFormat_AV_PIX_FMT_ABGR: AVPixelFormat = 27;
/// < packed BGRA 8:8:8:8, 32bpp, BGRABGRA...
pub const AVPixelFormat_AV_PIX_FMT_BGRA: AVPixelFormat = 28;
/// <        Y        , 16bpp, big-endian
pub const AVPixelFormat_AV_PIX_FMT_GRAY16BE: AVPixelFormat = 29;
/// <        Y        , 16bpp, little-endian
pub const AVPixelFormat_AV_PIX_FMT_GRAY16LE: AVPixelFormat = 30;
/// < planar YUV 4:4:0 (1 Cr & Cb sample per 1x2 Y samples)
pub const AVPixelFormat_AV_PIX_FMT_YUV440P: AVPixelFormat = 31;
/// < planar YUV 4:4:0 full scale (JPEG), deprecated in favor of AV_PIX_FMT_YUV440P and setting color_range
pub const AVPixelFormat_AV_PIX_FMT_YUVJ440P: AVPixelFormat = 32;
/// < planar YUV 4:2:0, 20bpp, (1 Cr & Cb sample per 2x2 Y & A samples)
pub const AVPixelFormat_AV_PIX_FMT_YUVA420P: AVPixelFormat = 33;
/// < packed RGB 16:16:16, 48bpp, 16R, 16G, 16B, the 2-byte value for each R/G/B component is stored as big-endian
pub const AVPixelFormat_AV_PIX_FMT_RGB48BE: AVPixelFormat = 34;
/// < packed RGB 16:16:16, 48bpp, 16R, 16G, 16B, the 2-byte value for each R/G/B component is stored as little-endian
pub const AVPixelFormat_AV_PIX_FMT_RGB48LE: AVPixelFormat = 35;
/// < packed RGB 5:6:5, 16bpp, (msb)   5R 6G 5B(lsb), big-endian
pub const AVPixelFormat_AV_PIX_FMT_RGB565BE: AVPixelFormat = 36;
/// < packed RGB 5:6:5, 16bpp, (msb)   5R 6G 5B(lsb), little-endian
pub const AVPixelFormat_AV_PIX_FMT_RGB565LE: AVPixelFormat = 37;
/// < packed RGB 5:5:5, 16bpp, (msb)1X 5R 5G 5B(lsb), big-endian   , X=unused/undefined
pub const AVPixelFormat_AV_PIX_FMT_RGB555BE: AVPixelFormat = 38;
/// < packed RGB 5:5:5, 16bpp, (msb)1X 5R 5G 5B(lsb), little-endian, X=unused/undefined
pub const AVPixelFormat_AV_PIX_FMT_RGB555LE: AVPixelFormat = 39;
/// < packed BGR 5:6:5, 16bpp, (msb)   5B 6G 5R(lsb), big-endian
pub const AVPixelFormat_AV_PIX_FMT_BGR565BE: AVPixelFormat = 40;
/// < packed BGR 5:6:5, 16bpp, (msb)   5B 6G 5R(lsb), little-endian
pub const AVPixelFormat_AV_PIX_FMT_BGR565LE: AVPixelFormat = 41;
/// < packed BGR 5:5:5, 16bpp, (msb)1X 5B 5G 5R(lsb), big-endian   , X=unused/undefined
pub const AVPixelFormat_AV_PIX_FMT_BGR555BE: AVPixelFormat = 42;
/// < packed BGR 5:5:5, 16bpp, (msb)1X 5B 5G 5R(lsb), little-endian, X=unused/undefined
pub const AVPixelFormat_AV_PIX_FMT_BGR555LE: AVPixelFormat = 43;
/// < HW acceleration through VA API at motion compensation entry-point, Picture.data[3] contains a vaapi_render_state struct which contains macroblocks as well as various fields extracted from headers
pub const AVPixelFormat_AV_PIX_FMT_VAAPI_MOCO: AVPixelFormat = 44;
/// < HW acceleration through VA API at IDCT entry-point, Picture.data[3] contains a vaapi_render_state struct which contains fields extracted from headers
pub const AVPixelFormat_AV_PIX_FMT_VAAPI_IDCT: AVPixelFormat = 45;
/// < HW decoding through VA API, Picture.data[3] contains a VASurfaceID
pub const AVPixelFormat_AV_PIX_FMT_VAAPI_VLD: AVPixelFormat = 46;
/// @}
pub const AVPixelFormat_AV_PIX_FMT_VAAPI: AVPixelFormat = 46;
/// < planar YUV 4:2:0, 24bpp, (1 Cr & Cb sample per 2x2 Y samples), little-endian
pub const AVPixelFormat_AV_PIX_FMT_YUV420P16LE: AVPixelFormat = 47;
/// < planar YUV 4:2:0, 24bpp, (1 Cr & Cb sample per 2x2 Y samples), big-endian
pub const AVPixelFormat_AV_PIX_FMT_YUV420P16BE: AVPixelFormat = 48;
/// < planar YUV 4:2:2, 32bpp, (1 Cr & Cb sample per 2x1 Y samples), little-endian
pub const AVPixelFormat_AV_PIX_FMT_YUV422P16LE: AVPixelFormat = 49;
/// < planar YUV 4:2:2, 32bpp, (1 Cr & Cb sample per 2x1 Y samples), big-endian
pub const AVPixelFormat_AV_PIX_FMT_YUV422P16BE: AVPixelFormat = 50;
/// < planar YUV 4:4:4, 48bpp, (1 Cr & Cb sample per 1x1 Y samples), little-endian
pub const AVPixelFormat_AV_PIX_FMT_YUV444P16LE: AVPixelFormat = 51;
/// < planar YUV 4:4:4, 48bpp, (1 Cr & Cb sample per 1x1 Y samples), big-endian
pub const AVPixelFormat_AV_PIX_FMT_YUV444P16BE: AVPixelFormat = 52;
/// < HW decoding through DXVA2, Picture.data[3] contains a LPDIRECT3DSURFACE9 pointer
pub const AVPixelFormat_AV_PIX_FMT_DXVA2_VLD: AVPixelFormat = 53;
/// < packed RGB 4:4:4, 16bpp, (msb)4X 4R 4G 4B(lsb), little-endian, X=unused/undefined
pub const AVPixelFormat_AV_PIX_FMT_RGB444LE: AVPixelFormat = 54;
/// < packed RGB 4:4:4, 16bpp, (msb)4X 4R 4G 4B(lsb), big-endian,    X=unused/undefined
pub const AVPixelFormat_AV_PIX_FMT_RGB444BE: AVPixelFormat = 55;
/// < packed BGR 4:4:4, 16bpp, (msb)4X 4B 4G 4R(lsb), little-endian, X=unused/undefined
pub const AVPixelFormat_AV_PIX_FMT_BGR444LE: AVPixelFormat = 56;
/// < packed BGR 4:4:4, 16bpp, (msb)4X 4B 4G 4R(lsb), big-endian,    X=unused/undefined
pub const AVPixelFormat_AV_PIX_FMT_BGR444BE: AVPixelFormat = 57;
/// < 8 bits gray, 8 bits alpha
pub const AVPixelFormat_AV_PIX_FMT_YA8: AVPixelFormat = 58;
/// < alias for AV_PIX_FMT_YA8
pub const AVPixelFormat_AV_PIX_FMT_Y400A: AVPixelFormat = 58;
/// < alias for AV_PIX_FMT_YA8
pub const AVPixelFormat_AV_PIX_FMT_GRAY8A: AVPixelFormat = 58;
/// < packed RGB 16:16:16, 48bpp, 16B, 16G, 16R, the 2-byte value for each R/G/B component is stored as big-endian
pub const AVPixelFormat_AV_PIX_FMT_BGR48BE: AVPixelFormat = 59;
/// < packed RGB 16:16:16, 48bpp, 16B, 16G, 16R, the 2-byte value for each R/G/B component is stored as little-endian
pub const AVPixelFormat_AV_PIX_FMT_BGR48LE: AVPixelFormat = 60;
/// < planar YUV 4:2:0, 13.5bpp, (1 Cr & Cb sample per 2x2 Y samples), big-endian
pub const AVPixelFormat_AV_PIX_FMT_YUV420P9BE: AVPixelFormat = 61;
/// < planar YUV 4:2:0, 13.5bpp, (1 Cr & Cb sample per 2x2 Y samples), little-endian
pub const AVPixelFormat_AV_PIX_FMT_YUV420P9LE: AVPixelFormat = 62;
/// < planar YUV 4:2:0, 15bpp, (1 Cr & Cb sample per 2x2 Y samples), big-endian
pub const AVPixelFormat_AV_PIX_FMT_YUV420P10BE: AVPixelFormat = 63;
/// < planar YUV 4:2:0, 15bpp, (1 Cr & Cb sample per 2x2 Y samples), little-endian
pub const AVPixelFormat_AV_PIX_FMT_YUV420P10LE: AVPixelFormat = 64;
/// < planar YUV 4:2:2, 20bpp, (1 Cr & Cb sample per 2x1 Y samples), big-endian
pub const AVPixelFormat_AV_PIX_FMT_YUV422P10BE: AVPixelFormat = 65;
/// < planar YUV 4:2:2, 20bpp, (1 Cr & Cb sample per 2x1 Y samples), little-endian
pub const AVPixelFormat_AV_PIX_FMT_YUV422P10LE: AVPixelFormat = 66;
/// < planar YUV 4:4:4, 27bpp, (1 Cr & Cb sample per 1x1 Y samples), big-endian
pub const AVPixelFormat_AV_PIX_FMT_YUV444P9BE: AVPixelFormat = 67;
/// < planar YUV 4:4:4, 27bpp, (1 Cr & Cb sample per 1x1 Y samples), little-endian
pub const AVPixelFormat_AV_PIX_FMT_YUV444P9LE: AVPixelFormat = 68;
/// < planar YUV 4:4:4, 30bpp, (1 Cr & Cb sample per 1x1 Y samples), big-endian
pub const AVPixelFormat_AV_PIX_FMT_YUV444P10BE: AVPixelFormat = 69;
/// < planar YUV 4:4:4, 30bpp, (1 Cr & Cb sample per 1x1 Y samples), little-endian
pub const AVPixelFormat_AV_PIX_FMT_YUV444P10LE: AVPixelFormat = 70;
/// < planar YUV 4:2:2, 18bpp, (1 Cr & Cb sample per 2x1 Y samples), big-endian
pub const AVPixelFormat_AV_PIX_FMT_YUV422P9BE: AVPixelFormat = 71;
/// < planar YUV 4:2:2, 18bpp, (1 Cr & Cb sample per 2x1 Y samples), little-endian
pub const AVPixelFormat_AV_PIX_FMT_YUV422P9LE: AVPixelFormat = 72;
/// < planar GBR 4:4:4 24bpp
pub const AVPixelFormat_AV_PIX_FMT_GBRP: AVPixelFormat = 73;
pub const AVPixelFormat_AV_PIX_FMT_GBR24P: AVPixelFormat = 73;
/// < planar GBR 4:4:4 27bpp, big-endian
pub const AVPixelFormat_AV_PIX_FMT_GBRP9BE: AVPixelFormat = 74;
/// < planar GBR 4:4:4 27bpp, little-endian
pub const AVPixelFormat_AV_PIX_FMT_GBRP9LE: AVPixelFormat = 75;
/// < planar GBR 4:4:4 30bpp, big-endian
pub const AVPixelFormat_AV_PIX_FMT_GBRP10BE: AVPixelFormat = 76;
/// < planar GBR 4:4:4 30bpp, little-endian
pub const AVPixelFormat_AV_PIX_FMT_GBRP10LE: AVPixelFormat = 77;
/// < planar GBR 4:4:4 48bpp, big-endian
pub const AVPixelFormat_AV_PIX_FMT_GBRP16BE: AVPixelFormat = 78;
/// < planar GBR 4:4:4 48bpp, little-endian
pub const AVPixelFormat_AV_PIX_FMT_GBRP16LE: AVPixelFormat = 79;
/// < planar YUV 4:2:2 24bpp, (1 Cr & Cb sample per 2x1 Y & A samples)
pub const AVPixelFormat_AV_PIX_FMT_YUVA422P: AVPixelFormat = 80;
/// < planar YUV 4:4:4 32bpp, (1 Cr & Cb sample per 1x1 Y & A samples)
pub const AVPixelFormat_AV_PIX_FMT_YUVA444P: AVPixelFormat = 81;
/// < planar YUV 4:2:0 22.5bpp, (1 Cr & Cb sample per 2x2 Y & A samples), big-endian
pub const AVPixelFormat_AV_PIX_FMT_YUVA420P9BE: AVPixelFormat = 82;
/// < planar YUV 4:2:0 22.5bpp, (1 Cr & Cb sample per 2x2 Y & A samples), little-endian
pub const AVPixelFormat_AV_PIX_FMT_YUVA420P9LE: AVPixelFormat = 83;
/// < planar YUV 4:2:2 27bpp, (1 Cr & Cb sample per 2x1 Y & A samples), big-endian
pub const AVPixelFormat_AV_PIX_FMT_YUVA422P9BE: AVPixelFormat = 84;
/// < planar YUV 4:2:2 27bpp, (1 Cr & Cb sample per 2x1 Y & A samples), little-endian
pub const AVPixelFormat_AV_PIX_FMT_YUVA422P9LE: AVPixelFormat = 85;
/// < planar YUV 4:4:4 36bpp, (1 Cr & Cb sample per 1x1 Y & A samples), big-endian
pub const AVPixelFormat_AV_PIX_FMT_YUVA444P9BE: AVPixelFormat = 86;
/// < planar YUV 4:4:4 36bpp, (1 Cr & Cb sample per 1x1 Y & A samples), little-endian
pub const AVPixelFormat_AV_PIX_FMT_YUVA444P9LE: AVPixelFormat = 87;
/// < planar YUV 4:2:0 25bpp, (1 Cr & Cb sample per 2x2 Y & A samples, big-endian)
pub const AVPixelFormat_AV_PIX_FMT_YUVA420P10BE: AVPixelFormat = 88;
/// < planar YUV 4:2:0 25bpp, (1 Cr & Cb sample per 2x2 Y & A samples, little-endian)
pub const AVPixelFormat_AV_PIX_FMT_YUVA420P10LE: AVPixelFormat = 89;
/// < planar YUV 4:2:2 30bpp, (1 Cr & Cb sample per 2x1 Y & A samples, big-endian)
pub const AVPixelFormat_AV_PIX_FMT_YUVA422P10BE: AVPixelFormat = 90;
/// < planar YUV 4:2:2 30bpp, (1 Cr & Cb sample per 2x1 Y & A samples, little-endian)
pub const AVPixelFormat_AV_PIX_FMT_YUVA422P10LE: AVPixelFormat = 91;
/// < planar YUV 4:4:4 40bpp, (1 Cr & Cb sample per 1x1 Y & A samples, big-endian)
pub const AVPixelFormat_AV_PIX_FMT_YUVA444P10BE: AVPixelFormat = 92;
/// < planar YUV 4:4:4 40bpp, (1 Cr & Cb sample per 1x1 Y & A samples, little-endian)
pub const AVPixelFormat_AV_PIX_FMT_YUVA444P10LE: AVPixelFormat = 93;
/// < planar YUV 4:2:0 40bpp, (1 Cr & Cb sample per 2x2 Y & A samples, big-endian)
pub const AVPixelFormat_AV_PIX_FMT_YUVA420P16BE: AVPixelFormat = 94;
/// < planar YUV 4:2:0 40bpp, (1 Cr & Cb sample per 2x2 Y & A samples, little-endian)
pub const AVPixelFormat_AV_PIX_FMT_YUVA420P16LE: AVPixelFormat = 95;
/// < planar YUV 4:2:2 48bpp, (1 Cr & Cb sample per 2x1 Y & A samples, big-endian)
pub const AVPixelFormat_AV_PIX_FMT_YUVA422P16BE: AVPixelFormat = 96;
/// < planar YUV 4:2:2 48bpp, (1 Cr & Cb sample per 2x1 Y & A samples, little-endian)
pub const AVPixelFormat_AV_PIX_FMT_YUVA422P16LE: AVPixelFormat = 97;
/// < planar YUV 4:4:4 64bpp, (1 Cr & Cb sample per 1x1 Y & A samples, big-endian)
pub const AVPixelFormat_AV_PIX_FMT_YUVA444P16BE: AVPixelFormat = 98;
/// < planar YUV 4:4:4 64bpp, (1 Cr & Cb sample per 1x1 Y & A samples, little-endian)
pub const AVPixelFormat_AV_PIX_FMT_YUVA444P16LE: AVPixelFormat = 99;
/// < HW acceleration through VDPAU, Picture.data[3] contains a VdpVideoSurface
pub const AVPixelFormat_AV_PIX_FMT_VDPAU: AVPixelFormat = 100;
/// < packed XYZ 4:4:4, 36 bpp, (msb) 12X, 12Y, 12Z (lsb), the 2-byte value for each X/Y/Z is stored as little-endian, the 4 lower bits are set to 0
pub const AVPixelFormat_AV_PIX_FMT_XYZ12LE: AVPixelFormat = 101;
/// < packed XYZ 4:4:4, 36 bpp, (msb) 12X, 12Y, 12Z (lsb), the 2-byte value for each X/Y/Z is stored as big-endian, the 4 lower bits are set to 0
pub const AVPixelFormat_AV_PIX_FMT_XYZ12BE: AVPixelFormat = 102;
/// < interleaved chroma YUV 4:2:2, 16bpp, (1 Cr & Cb sample per 2x1 Y samples)
pub const AVPixelFormat_AV_PIX_FMT_NV16: AVPixelFormat = 103;
/// < interleaved chroma YUV 4:2:2, 20bpp, (1 Cr & Cb sample per 2x1 Y samples), little-endian
pub const AVPixelFormat_AV_PIX_FMT_NV20LE: AVPixelFormat = 104;
/// < interleaved chroma YUV 4:2:2, 20bpp, (1 Cr & Cb sample per 2x1 Y samples), big-endian
pub const AVPixelFormat_AV_PIX_FMT_NV20BE: AVPixelFormat = 105;
/// < packed RGBA 16:16:16:16, 64bpp, 16R, 16G, 16B, 16A, the 2-byte value for each R/G/B/A component is stored as big-endian
pub const AVPixelFormat_AV_PIX_FMT_RGBA64BE: AVPixelFormat = 106;
/// < packed RGBA 16:16:16:16, 64bpp, 16R, 16G, 16B, 16A, the 2-byte value for each R/G/B/A component is stored as little-endian
pub const AVPixelFormat_AV_PIX_FMT_RGBA64LE: AVPixelFormat = 107;
/// < packed RGBA 16:16:16:16, 64bpp, 16B, 16G, 16R, 16A, the 2-byte value for each R/G/B/A component is stored as big-endian
pub const AVPixelFormat_AV_PIX_FMT_BGRA64BE: AVPixelFormat = 108;
/// < packed RGBA 16:16:16:16, 64bpp, 16B, 16G, 16R, 16A, the 2-byte value for each R/G/B/A component is stored as little-endian
pub const AVPixelFormat_AV_PIX_FMT_BGRA64LE: AVPixelFormat = 109;
/// < packed YUV 4:2:2, 16bpp, Y0 Cr Y1 Cb
pub const AVPixelFormat_AV_PIX_FMT_YVYU422: AVPixelFormat = 110;
/// < 16 bits gray, 16 bits alpha (big-endian)
pub const AVPixelFormat_AV_PIX_FMT_YA16BE: AVPixelFormat = 111;
/// < 16 bits gray, 16 bits alpha (little-endian)
pub const AVPixelFormat_AV_PIX_FMT_YA16LE: AVPixelFormat = 112;
/// < planar GBRA 4:4:4:4 32bpp
pub const AVPixelFormat_AV_PIX_FMT_GBRAP: AVPixelFormat = 113;
/// < planar GBRA 4:4:4:4 64bpp, big-endian
pub const AVPixelFormat_AV_PIX_FMT_GBRAP16BE: AVPixelFormat = 114;
/// < planar GBRA 4:4:4:4 64bpp, little-endian
pub const AVPixelFormat_AV_PIX_FMT_GBRAP16LE: AVPixelFormat = 115;
/// HW acceleration through QSV, data[3] contains a pointer to the
/// mfxFrameSurface1 structure.
pub const AVPixelFormat_AV_PIX_FMT_QSV: AVPixelFormat = 116;
/// HW acceleration though MMAL, data[3] contains a pointer to the
/// MMAL_BUFFER_HEADER_T structure.
pub const AVPixelFormat_AV_PIX_FMT_MMAL: AVPixelFormat = 117;
/// < HW decoding through Direct3D11 via old API, Picture.data[3] contains a ID3D11VideoDecoderOutputView pointer
pub const AVPixelFormat_AV_PIX_FMT_D3D11VA_VLD: AVPixelFormat = 118;
/// HW acceleration through CUDA. data[i] contain CUdeviceptr pointers
/// exactly as for system memory frames.
pub const AVPixelFormat_AV_PIX_FMT_CUDA: AVPixelFormat = 119;
/// < packed RGB 8:8:8, 32bpp, XRGBXRGB...   X=unused/undefined
pub const AVPixelFormat_AV_PIX_FMT_0RGB: AVPixelFormat = 120;
/// < packed RGB 8:8:8, 32bpp, RGBXRGBX...   X=unused/undefined
pub const AVPixelFormat_AV_PIX_FMT_RGB0: AVPixelFormat = 121;
/// < packed BGR 8:8:8, 32bpp, XBGRXBGR...   X=unused/undefined
pub const AVPixelFormat_AV_PIX_FMT_0BGR: AVPixelFormat = 122;
/// < packed BGR 8:8:8, 32bpp, BGRXBGRX...   X=unused/undefined
pub const AVPixelFormat_AV_PIX_FMT_BGR0: AVPixelFormat = 123;
/// < planar YUV 4:2:0,18bpp, (1 Cr & Cb sample per 2x2 Y samples), big-endian
pub const AVPixelFormat_AV_PIX_FMT_YUV420P12BE: AVPixelFormat = 124;
/// < planar YUV 4:2:0,18bpp, (1 Cr & Cb sample per 2x2 Y samples), little-endian
pub const AVPixelFormat_AV_PIX_FMT_YUV420P12LE: AVPixelFormat = 125;
/// < planar YUV 4:2:0,21bpp, (1 Cr & Cb sample per 2x2 Y samples), big-endian
pub const AVPixelFormat_AV_PIX_FMT_YUV420P14BE: AVPixelFormat = 126;
/// < planar YUV 4:2:0,21bpp, (1 Cr & Cb sample per 2x2 Y samples), little-endian
pub const AVPixelFormat_AV_PIX_FMT_YUV420P14LE: AVPixelFormat = 127;
/// < planar YUV 4:2:2,24bpp, (1 Cr & Cb sample per 2x1 Y samples), big-endian
pub const AVPixelFormat_AV_PIX_FMT_YUV422P12BE: AVPixelFormat = 128;
/// < planar YUV 4:2:2,24bpp, (1 Cr & Cb sample per 2x1 Y samples), little-endian
pub const AVPixelFormat_AV_PIX_FMT_YUV422P12LE: AVPixelFormat = 129;
/// < planar YUV 4:2:2,28bpp, (1 Cr & Cb sample per 2x1 Y samples), big-endian
pub const AVPixelFormat_AV_PIX_FMT_YUV422P14BE: AVPixelFormat = 130;
/// < planar YUV 4:2:2,28bpp, (1 Cr & Cb sample per 2x1 Y samples), little-endian
pub const AVPixelFormat_AV_PIX_FMT_YUV422P14LE: AVPixelFormat = 131;
/// < planar YUV 4:4:4,36bpp, (1 Cr & Cb sample per 1x1 Y samples), big-endian
pub const AVPixelFormat_AV_PIX_FMT_YUV444P12BE: AVPixelFormat = 132;
/// < planar YUV 4:4:4,36bpp, (1 Cr & Cb sample per 1x1 Y samples), little-endian
pub const AVPixelFormat_AV_PIX_FMT_YUV444P12LE: AVPixelFormat = 133;
/// < planar YUV 4:4:4,42bpp, (1 Cr & Cb sample per 1x1 Y samples), big-endian
pub const AVPixelFormat_AV_PIX_FMT_YUV444P14BE: AVPixelFormat = 134;
/// < planar YUV 4:4:4,42bpp, (1 Cr & Cb sample per 1x1 Y samples), little-endian
pub const AVPixelFormat_AV_PIX_FMT_YUV444P14LE: AVPixelFormat = 135;
/// < planar GBR 4:4:4 36bpp, big-endian
pub const AVPixelFormat_AV_PIX_FMT_GBRP12BE: AVPixelFormat = 136;
/// < planar GBR 4:4:4 36bpp, little-endian
pub const AVPixelFormat_AV_PIX_FMT_GBRP12LE: AVPixelFormat = 137;
/// < planar GBR 4:4:4 42bpp, big-endian
pub const AVPixelFormat_AV_PIX_FMT_GBRP14BE: AVPixelFormat = 138;
/// < planar GBR 4:4:4 42bpp, little-endian
pub const AVPixelFormat_AV_PIX_FMT_GBRP14LE: AVPixelFormat = 139;
/// < planar YUV 4:1:1, 12bpp, (1 Cr & Cb sample per 4x1 Y samples) full scale (JPEG), deprecated in favor of AV_PIX_FMT_YUV411P and setting color_range
pub const AVPixelFormat_AV_PIX_FMT_YUVJ411P: AVPixelFormat = 140;
/// < bayer, BGBG..(odd line), GRGR..(even line), 8-bit samples */
pub const AVPixelFormat_AV_PIX_FMT_BAYER_BGGR8: AVPixelFormat = 141;
/// < bayer, RGRG..(odd line), GBGB..(even line), 8-bit samples */
pub const AVPixelFormat_AV_PIX_FMT_BAYER_RGGB8: AVPixelFormat = 142;
/// < bayer, GBGB..(odd line), RGRG..(even line), 8-bit samples */
pub const AVPixelFormat_AV_PIX_FMT_BAYER_GBRG8: AVPixelFormat = 143;
/// < bayer, GRGR..(odd line), BGBG..(even line), 8-bit samples */
pub const AVPixelFormat_AV_PIX_FMT_BAYER_GRBG8: AVPixelFormat = 144;
/// < bayer, BGBG..(odd line), GRGR..(even line), 16-bit samples, little-endian */
pub const AVPixelFormat_AV_PIX_FMT_BAYER_BGGR16LE: AVPixelFormat = 145;
/// < bayer, BGBG..(odd line), GRGR..(even line), 16-bit samples, big-endian */
pub const AVPixelFormat_AV_PIX_FMT_BAYER_BGGR16BE: AVPixelFormat = 146;
/// < bayer, RGRG..(odd line), GBGB..(even line), 16-bit samples, little-endian */
pub const AVPixelFormat_AV_PIX_FMT_BAYER_RGGB16LE: AVPixelFormat = 147;
/// < bayer, RGRG..(odd line), GBGB..(even line), 16-bit samples, big-endian */
pub const AVPixelFormat_AV_PIX_FMT_BAYER_RGGB16BE: AVPixelFormat = 148;
/// < bayer, GBGB..(odd line), RGRG..(even line), 16-bit samples, little-endian */
pub const AVPixelFormat_AV_PIX_FMT_BAYER_GBRG16LE: AVPixelFormat = 149;
/// < bayer, GBGB..(odd line), RGRG..(even line), 16-bit samples, big-endian */
pub const AVPixelFormat_AV_PIX_FMT_BAYER_GBRG16BE: AVPixelFormat = 150;
/// < bayer, GRGR..(odd line), BGBG..(even line), 16-bit samples, little-endian */
pub const AVPixelFormat_AV_PIX_FMT_BAYER_GRBG16LE: AVPixelFormat = 151;
/// < bayer, GRGR..(odd line), BGBG..(even line), 16-bit samples, big-endian */
pub const AVPixelFormat_AV_PIX_FMT_BAYER_GRBG16BE: AVPixelFormat = 152;
/// < XVideo Motion Acceleration via common packet passing
pub const AVPixelFormat_AV_PIX_FMT_XVMC: AVPixelFormat = 153;
/// < planar YUV 4:4:0,20bpp, (1 Cr & Cb sample per 1x2 Y samples), little-endian
pub const AVPixelFormat_AV_PIX_FMT_YUV440P10LE: AVPixelFormat = 154;
/// < planar YUV 4:4:0,20bpp, (1 Cr & Cb sample per 1x2 Y samples), big-endian
pub const AVPixelFormat_AV_PIX_FMT_YUV440P10BE: AVPixelFormat = 155;
/// < planar YUV 4:4:0,24bpp, (1 Cr & Cb sample per 1x2 Y samples), little-endian
pub const AVPixelFormat_AV_PIX_FMT_YUV440P12LE: AVPixelFormat = 156;
/// < planar YUV 4:4:0,24bpp, (1 Cr & Cb sample per 1x2 Y samples), big-endian
pub const AVPixelFormat_AV_PIX_FMT_YUV440P12BE: AVPixelFormat = 157;
/// < packed AYUV 4:4:4,64bpp (1 Cr & Cb sample per 1x1 Y & A samples), little-endian
pub const AVPixelFormat_AV_PIX_FMT_AYUV64LE: AVPixelFormat = 158;
/// < packed AYUV 4:4:4,64bpp (1 Cr & Cb sample per 1x1 Y & A samples), big-endian
pub const AVPixelFormat_AV_PIX_FMT_AYUV64BE: AVPixelFormat = 159;
/// < hardware decoding through Videotoolbox
pub const AVPixelFormat_AV_PIX_FMT_VIDEOTOOLBOX: AVPixelFormat = 160;
/// < like NV12, with 10bpp per component, data in the high bits, zeros in the low bits, little-endian
pub const AVPixelFormat_AV_PIX_FMT_P010LE: AVPixelFormat = 161;
/// < like NV12, with 10bpp per component, data in the high bits, zeros in the low bits, big-endian
pub const AVPixelFormat_AV_PIX_FMT_P010BE: AVPixelFormat = 162;
/// < planar GBR 4:4:4:4 48bpp, big-endian
pub const AVPixelFormat_AV_PIX_FMT_GBRAP12BE: AVPixelFormat = 163;
/// < planar GBR 4:4:4:4 48bpp, little-endian
pub const AVPixelFormat_AV_PIX_FMT_GBRAP12LE: AVPixelFormat = 164;
/// < planar GBR 4:4:4:4 40bpp, big-endian
pub const AVPixelFormat_AV_PIX_FMT_GBRAP10BE: AVPixelFormat = 165;
/// < planar GBR 4:4:4:4 40bpp, little-endian
pub const AVPixelFormat_AV_PIX_FMT_GBRAP10LE: AVPixelFormat = 166;
/// < hardware decoding through MediaCodec
pub const AVPixelFormat_AV_PIX_FMT_MEDIACODEC: AVPixelFormat = 167;
/// <        Y        , 12bpp, big-endian
pub const AVPixelFormat_AV_PIX_FMT_GRAY12BE: AVPixelFormat = 168;
/// <        Y        , 12bpp, little-endian
pub const AVPixelFormat_AV_PIX_FMT_GRAY12LE: AVPixelFormat = 169;
/// <        Y        , 10bpp, big-endian
pub const AVPixelFormat_AV_PIX_FMT_GRAY10BE: AVPixelFormat = 170;
/// <        Y        , 10bpp, little-endian
pub const AVPixelFormat_AV_PIX_FMT_GRAY10LE: AVPixelFormat = 171;
/// < like NV12, with 16bpp per component, little-endian
pub const AVPixelFormat_AV_PIX_FMT_P016LE: AVPixelFormat = 172;
/// < like NV12, with 16bpp per component, big-endian
pub const AVPixelFormat_AV_PIX_FMT_P016BE: AVPixelFormat = 173;
/// Hardware surfaces for Direct3D11.
///
/// This is preferred over the legacy AV_PIX_FMT_D3D11VA_VLD. The new D3D11
/// hwaccel API and filtering support AV_PIX_FMT_D3D11 only.
///
/// data[0] contains a ID3D11Texture2D pointer, and data[1] contains the
/// texture array index of the frame as intptr_t if the ID3D11Texture2D is
/// an array texture (or always 0 if it's a normal texture).
pub const AVPixelFormat_AV_PIX_FMT_D3D11: AVPixelFormat = 174;
/// <        Y        , 9bpp, big-endian
pub const AVPixelFormat_AV_PIX_FMT_GRAY9BE: AVPixelFormat = 175;
/// <        Y        , 9bpp, little-endian
pub const AVPixelFormat_AV_PIX_FMT_GRAY9LE: AVPixelFormat = 176;
/// < IEEE-754 single precision planar GBR 4:4:4,     96bpp, big-endian
pub const AVPixelFormat_AV_PIX_FMT_GBRPF32BE: AVPixelFormat = 177;
/// < IEEE-754 single precision planar GBR 4:4:4,     96bpp, little-endian
pub const AVPixelFormat_AV_PIX_FMT_GBRPF32LE: AVPixelFormat = 178;
/// < IEEE-754 single precision planar GBRA 4:4:4:4, 128bpp, big-endian
pub const AVPixelFormat_AV_PIX_FMT_GBRAPF32BE: AVPixelFormat = 179;
/// < IEEE-754 single precision planar GBRA 4:4:4:4, 128bpp, little-endian
pub const AVPixelFormat_AV_PIX_FMT_GBRAPF32LE: AVPixelFormat = 180;
/// DRM-managed buffers exposed through PRIME buffer sharing.
///
/// data[0] points to an AVDRMFrameDescriptor.
pub const AVPixelFormat_AV_PIX_FMT_DRM_PRIME: AVPixelFormat = 181;
/// Hardware surfaces for OpenCL.
///
/// data[i] contain 2D image objects (typed in C as cl_mem, used
/// in OpenCL as image2d_t) for each plane of the surface.
pub const AVPixelFormat_AV_PIX_FMT_OPENCL: AVPixelFormat = 182;
/// < number of pixel formats, DO NOT USE THIS if you want to link with shared libav* because the number of formats might differ between versions
pub const AVPixelFormat_AV_PIX_FMT_NB: AVPixelFormat = 183;
/// Pixel format.
///
/// @note
/// AV_PIX_FMT_RGB32 is handled in an endian-specific manner. An RGBA
/// color is put together as:
/// (A << 24) | (R << 16) | (G << 8) | B
/// This is stored as BGRA on little-endian CPU architectures and ARGB on
/// big-endian CPUs.
///
/// @par
/// When the pixel format is palettized RGB32 (AV_PIX_FMT_PAL8), the palettized
/// image data is stored in AVFrame.data[0]. The palette is transported in
/// AVFrame.data[1], is 1024 bytes long (256 4-byte entries) and is
/// formatted the same as in AV_PIX_FMT_RGB32 described above (i.e., it is
/// also endian-specific). Note also that the individual RGB32 palette
/// components stored in AVFrame.data[1] should be in the range 0..255.
/// This is important as many custom PAL8 video codecs that were designed
/// to run on the IBM VGA graphics adapter use 6-bit palette components.
///
/// @par
/// For all the 8 bits per pixel formats, an RGB32 palette is in data[1] like
/// for pal8. This palette is filled in automatically by the function
/// allocating the picture.
pub type AVPixelFormat = i32;
pub const AVColorPrimaries_AVCOL_PRI_RESERVED0: AVColorPrimaries = 0;
/// < also ITU-R BT1361 / IEC 61966-2-4 / SMPTE RP177 Annex B
pub const AVColorPrimaries_AVCOL_PRI_BT709: AVColorPrimaries = 1;
pub const AVColorPrimaries_AVCOL_PRI_UNSPECIFIED: AVColorPrimaries = 2;
pub const AVColorPrimaries_AVCOL_PRI_RESERVED: AVColorPrimaries = 3;
/// < also FCC Title 47 Code of Federal Regulations 73.682 (a)(20)
pub const AVColorPrimaries_AVCOL_PRI_BT470M: AVColorPrimaries = 4;
/// < also ITU-R BT601-6 625 / ITU-R BT1358 625 / ITU-R BT1700 625 PAL & SECAM
pub const AVColorPrimaries_AVCOL_PRI_BT470BG: AVColorPrimaries = 5;
/// < also ITU-R BT601-6 525 / ITU-R BT1358 525 / ITU-R BT1700 NTSC
pub const AVColorPrimaries_AVCOL_PRI_SMPTE170M: AVColorPrimaries = 6;
/// < functionally identical to above
pub const AVColorPrimaries_AVCOL_PRI_SMPTE240M: AVColorPrimaries = 7;
/// < colour filters using Illuminant C
pub const AVColorPrimaries_AVCOL_PRI_FILM: AVColorPrimaries = 8;
/// < ITU-R BT2020
pub const AVColorPrimaries_AVCOL_PRI_BT2020: AVColorPrimaries = 9;
/// < SMPTE ST 428-1 (CIE 1931 XYZ)
pub const AVColorPrimaries_AVCOL_PRI_SMPTE428: AVColorPrimaries = 10;
pub const AVColorPrimaries_AVCOL_PRI_SMPTEST428_1: AVColorPrimaries = 10;
/// < SMPTE ST 431-2 (2011) / DCI P3
pub const AVColorPrimaries_AVCOL_PRI_SMPTE431: AVColorPrimaries = 11;
/// < SMPTE ST 432-1 (2010) / P3 D65 / Display P3
pub const AVColorPrimaries_AVCOL_PRI_SMPTE432: AVColorPrimaries = 12;
/// < JEDEC P22 phosphors
pub const AVColorPrimaries_AVCOL_PRI_JEDEC_P22: AVColorPrimaries = 22;
/// < Not part of ABI
pub const AVColorPrimaries_AVCOL_PRI_NB: AVColorPrimaries = 23;
/// Chromaticity coordinates of the source primaries.
/// These values match the ones defined by ISO/IEC 23001-8_2013  7.1.
pub type AVColorPrimaries = u32;
pub const AVColorTransferCharacteristic_AVCOL_TRC_RESERVED0: AVColorTransferCharacteristic = 0;
/// < also ITU-R BT1361
pub const AVColorTransferCharacteristic_AVCOL_TRC_BT709: AVColorTransferCharacteristic = 1;
pub const AVColorTransferCharacteristic_AVCOL_TRC_UNSPECIFIED: AVColorTransferCharacteristic = 2;
pub const AVColorTransferCharacteristic_AVCOL_TRC_RESERVED: AVColorTransferCharacteristic = 3;
/// < also ITU-R BT470M / ITU-R BT1700 625 PAL & SECAM
pub const AVColorTransferCharacteristic_AVCOL_TRC_GAMMA22: AVColorTransferCharacteristic = 4;
/// < also ITU-R BT470BG
pub const AVColorTransferCharacteristic_AVCOL_TRC_GAMMA28: AVColorTransferCharacteristic = 5;
/// < also ITU-R BT601-6 525 or 625 / ITU-R BT1358 525 or 625 / ITU-R BT1700 NTSC
pub const AVColorTransferCharacteristic_AVCOL_TRC_SMPTE170M: AVColorTransferCharacteristic = 6;
pub const AVColorTransferCharacteristic_AVCOL_TRC_SMPTE240M: AVColorTransferCharacteristic = 7;
/// < "Linear transfer characteristics"
pub const AVColorTransferCharacteristic_AVCOL_TRC_LINEAR: AVColorTransferCharacteristic = 8;
/// < "Logarithmic transfer characteristic (100:1 range)"
pub const AVColorTransferCharacteristic_AVCOL_TRC_LOG: AVColorTransferCharacteristic = 9;
/// < "Logarithmic transfer characteristic (100 * Sqrt(10) : 1 range)"
pub const AVColorTransferCharacteristic_AVCOL_TRC_LOG_SQRT: AVColorTransferCharacteristic = 10;
/// < IEC 61966-2-4
pub const AVColorTransferCharacteristic_AVCOL_TRC_IEC61966_2_4: AVColorTransferCharacteristic = 11;
/// < ITU-R BT1361 Extended Colour Gamut
pub const AVColorTransferCharacteristic_AVCOL_TRC_BT1361_ECG: AVColorTransferCharacteristic = 12;
/// < IEC 61966-2-1 (sRGB or sYCC)
pub const AVColorTransferCharacteristic_AVCOL_TRC_IEC61966_2_1: AVColorTransferCharacteristic = 13;
/// < ITU-R BT2020 for 10-bit system
pub const AVColorTransferCharacteristic_AVCOL_TRC_BT2020_10: AVColorTransferCharacteristic = 14;
/// < ITU-R BT2020 for 12-bit system
pub const AVColorTransferCharacteristic_AVCOL_TRC_BT2020_12: AVColorTransferCharacteristic = 15;
/// < SMPTE ST 2084 for 10-, 12-, 14- and 16-bit systems
pub const AVColorTransferCharacteristic_AVCOL_TRC_SMPTE2084: AVColorTransferCharacteristic = 16;
pub const AVColorTransferCharacteristic_AVCOL_TRC_SMPTEST2084: AVColorTransferCharacteristic = 16;
/// < SMPTE ST 428-1
pub const AVColorTransferCharacteristic_AVCOL_TRC_SMPTE428: AVColorTransferCharacteristic = 17;
pub const AVColorTransferCharacteristic_AVCOL_TRC_SMPTEST428_1: AVColorTransferCharacteristic = 17;
/// < ARIB STD-B67, known as "Hybrid log-gamma"
pub const AVColorTransferCharacteristic_AVCOL_TRC_ARIB_STD_B67: AVColorTransferCharacteristic = 18;
/// < Not part of ABI
pub const AVColorTransferCharacteristic_AVCOL_TRC_NB: AVColorTransferCharacteristic = 19;
/// Color Transfer Characteristic.
/// These values match the ones defined by ISO/IEC 23001-8_2013  7.2.
pub type AVColorTransferCharacteristic = u32;
/// < order of coefficients is actually GBR, also IEC 61966-2-1 (sRGB)
pub const AVColorSpace_AVCOL_SPC_RGB: AVColorSpace = 0;
/// < also ITU-R BT1361 / IEC 61966-2-4 xvYCC709 / SMPTE RP177 Annex B
pub const AVColorSpace_AVCOL_SPC_BT709: AVColorSpace = 1;
pub const AVColorSpace_AVCOL_SPC_UNSPECIFIED: AVColorSpace = 2;
pub const AVColorSpace_AVCOL_SPC_RESERVED: AVColorSpace = 3;
/// < FCC Title 47 Code of Federal Regulations 73.682 (a)(20)
pub const AVColorSpace_AVCOL_SPC_FCC: AVColorSpace = 4;
/// < also ITU-R BT601-6 625 / ITU-R BT1358 625 / ITU-R BT1700 625 PAL & SECAM / IEC 61966-2-4 xvYCC601
pub const AVColorSpace_AVCOL_SPC_BT470BG: AVColorSpace = 5;
/// < also ITU-R BT601-6 525 / ITU-R BT1358 525 / ITU-R BT1700 NTSC
pub const AVColorSpace_AVCOL_SPC_SMPTE170M: AVColorSpace = 6;
/// < functionally identical to above
pub const AVColorSpace_AVCOL_SPC_SMPTE240M: AVColorSpace = 7;
/// < Used by Dirac / VC-2 and H.264 FRext, see ITU-T SG16
pub const AVColorSpace_AVCOL_SPC_YCGCO: AVColorSpace = 8;
pub const AVColorSpace_AVCOL_SPC_YCOCG: AVColorSpace = 8;
/// < ITU-R BT2020 non-constant luminance system
pub const AVColorSpace_AVCOL_SPC_BT2020_NCL: AVColorSpace = 9;
/// < ITU-R BT2020 constant luminance system
pub const AVColorSpace_AVCOL_SPC_BT2020_CL: AVColorSpace = 10;
/// < SMPTE 2085, Y'D'zD'x
pub const AVColorSpace_AVCOL_SPC_SMPTE2085: AVColorSpace = 11;
/// < Chromaticity-derived non-constant luminance system
pub const AVColorSpace_AVCOL_SPC_CHROMA_DERIVED_NCL: AVColorSpace = 12;
/// < Chromaticity-derived constant luminance system
pub const AVColorSpace_AVCOL_SPC_CHROMA_DERIVED_CL: AVColorSpace = 13;
/// < ITU-R BT.2100-0, ICtCp
pub const AVColorSpace_AVCOL_SPC_ICTCP: AVColorSpace = 14;
/// < Not part of ABI
pub const AVColorSpace_AVCOL_SPC_NB: AVColorSpace = 15;
/// YUV colorspace type.
/// These values match the ones defined by ISO/IEC 23001-8_2013  7.3.
pub type AVColorSpace = u32;
pub const AVColorRange_AVCOL_RANGE_UNSPECIFIED: AVColorRange = 0;
/// < the normal 219*2^(n-8) "MPEG" YUV ranges
pub const AVColorRange_AVCOL_RANGE_MPEG: AVColorRange = 1;
/// < the normal     2^n-1   "JPEG" YUV ranges
pub const AVColorRange_AVCOL_RANGE_JPEG: AVColorRange = 2;
/// < Not part of ABI
pub const AVColorRange_AVCOL_RANGE_NB: AVColorRange = 3;
/// MPEG vs JPEG YUV range.
pub type AVColorRange = u32;
pub const AVChromaLocation_AVCHROMA_LOC_UNSPECIFIED: AVChromaLocation = 0;
/// < MPEG-2/4 4:2:0, H.264 default for 4:2:0
pub const AVChromaLocation_AVCHROMA_LOC_LEFT: AVChromaLocation = 1;
/// < MPEG-1 4:2:0, JPEG 4:2:0, H.263 4:2:0
pub const AVChromaLocation_AVCHROMA_LOC_CENTER: AVChromaLocation = 2;
/// < ITU-R 601, SMPTE 274M 296M S314M(DV 4:1:1), mpeg2 4:2:2
pub const AVChromaLocation_AVCHROMA_LOC_TOPLEFT: AVChromaLocation = 3;
pub const AVChromaLocation_AVCHROMA_LOC_TOP: AVChromaLocation = 4;
pub const AVChromaLocation_AVCHROMA_LOC_BOTTOMLEFT: AVChromaLocation = 5;
pub const AVChromaLocation_AVCHROMA_LOC_BOTTOM: AVChromaLocation = 6;
/// < Not part of ABI
pub const AVChromaLocation_AVCHROMA_LOC_NB: AVChromaLocation = 7;
/// Location of chroma samples.
///
/// Illustration showing the location of the first (top left) chroma sample of the
/// image, the left shows only luma, the right
/// shows the location of the chroma sample, the 2 could be imagined to overlay
/// each other but are drawn separately due to limitations of ASCII
///
/// 1st 2nd       1st 2nd horizontal luma sample positions
/// v   v         v   v
/// ______        ______
/// 1st luma line > |X   X ...    |3 4 X ...     X are luma samples,
/// |             |1 2           1-6 are possible chroma positions
/// 2nd luma line > |X   X ...    |5 6 X ...     0 is undefined/unknown position
pub type AVChromaLocation = u32;
extern "C" {
    /// Compute the length of an integer list.
    ///
    /// @param elsize  size in bytes of each list element (only 1, 2, 4 or 8)
    /// @param term    list terminator (usually 0 or -1)
    /// @param list    pointer to the list
    /// @return  length of the list, in elements, not counting the terminator
    pub fn av_int_list_length_for_size(
        elsize: lang_items::c_uint,
        list: *const lang_items::c_void,
        term: u64,
    ) -> lang_items::c_uint;
}
extern "C" {
    /// Open a file using a UTF-8 filename.
    /// The API of this function matches POSIX fopen(), errors are returned through
    /// errno.
    pub fn av_fopen_utf8(
        path: *const lang_items::c_char,
        mode: *const lang_items::c_char,
    ) -> *mut FILE;
}
extern "C" {
    /// Return the fractional representation of the internal time base.
    pub fn av_get_time_base_q() -> AVRational;
}
extern "C" {
    /// Fill the provided buffer with a string containing a FourCC (four-character
    /// code) representation.
    ///
    /// @param buf    a buffer with size in bytes of at least AV_FOURCC_MAX_STRING_SIZE
    /// @param fourcc the fourcc to represent
    /// @return the buffer in input
    pub fn av_fourcc_make_string(
        buf: *mut lang_items::c_char,
        fourcc: u32,
    ) -> *mut lang_items::c_char;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct AVComponentDescriptor {
    /// Which of the 4 planes contains the component.
    pub plane: lang_items::c_int,
    /// Number of elements between 2 horizontally consecutive pixels.
    /// Elements are bits for bitstream formats, bytes otherwise.
    pub step: lang_items::c_int,
    /// Number of elements before the component of the first pixel.
    /// Elements are bits for bitstream formats, bytes otherwise.
    pub offset: lang_items::c_int,
    /// Number of least significant bits that must be shifted away
    /// to get the value.
    pub shift: lang_items::c_int,
    /// Number of bits in the component.
    pub depth: lang_items::c_int,
    /// deprecated, use step instead
    pub step_minus1: lang_items::c_int,
    /// deprecated, use depth instead
    pub depth_minus1: lang_items::c_int,
    /// deprecated, use offset instead
    pub offset_plus1: lang_items::c_int,
}
#[test]
fn bindgen_test_layout_AVComponentDescriptor() {
    assert_eq!(
        std::mem::size_of::<AVComponentDescriptor>(),
        32usize,
        concat!("Size of: ", stringify!(AVComponentDescriptor))
    );
    assert_eq!(
        std::mem::align_of::<AVComponentDescriptor>(),
        4usize,
        concat!("Alignment of ", stringify!(AVComponentDescriptor))
    );
    assert_eq!(
        unsafe { &(*(std::ptr::null::<AVComponentDescriptor>())).plane as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(AVComponentDescriptor),
            "::",
            stringify!(plane)
        )
    );
    assert_eq!(
        unsafe { &(*(std::ptr::null::<AVComponentDescriptor>())).step as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(AVComponentDescriptor),
            "::",
            stringify!(step)
        )
    );
    assert_eq!(
        unsafe { &(*(std::ptr::null::<AVComponentDescriptor>())).offset as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(AVComponentDescriptor),
            "::",
            stringify!(offset)
        )
    );
    assert_eq!(
        unsafe { &(*(std::ptr::null::<AVComponentDescriptor>())).shift as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(AVComponentDescriptor),
            "::",
            stringify!(shift)
        )
    );
    assert_eq!(
        unsafe { &(*(std::ptr::null::<AVComponentDescriptor>())).depth as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(AVComponentDescriptor),
            "::",
            stringify!(depth)
        )
    );
    assert_eq!(
        unsafe {
            &(*(std::ptr::null::<AVComponentDescriptor>())).step_minus1 as *const _ as usize
        },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(AVComponentDescriptor),
            "::",
            stringify!(step_minus1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(std::ptr::null::<AVComponentDescriptor>())).depth_minus1 as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(AVComponentDescriptor),
            "::",
            stringify!(depth_minus1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(std::ptr::null::<AVComponentDescriptor>())).offset_plus1 as *const _ as usize
        },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(AVComponentDescriptor),
            "::",
            stringify!(offset_plus1)
        )
    );
}
/// Descriptor that unambiguously describes how the bits of a pixel are
/// stored in the up to 4 data planes of an image. It also stores the
/// subsampling factors and number of components.
///
/// @note This is separate of the colorspace (RGB, YCbCr, YPbPr, JPEG-style YUV
/// and all the YUV variants) AVPixFmtDescriptor just stores how values
/// are stored not what these values represent.
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct AVPixFmtDescriptor {
    pub name: *const lang_items::c_char,
    /// < The number of components each pixel has, (1-4)
    pub nb_components: u8,
    /// Amount to shift the luma width right to find the chroma width.
    /// For YV12 this is 1 for example.
    /// chroma_width = AV_CEIL_RSHIFT(luma_width, log2_chroma_w)
    /// The note above is needed to ensure rounding up.
    /// This value only refers to the chroma components.
    pub log2_chroma_w: u8,
    /// Amount to shift the luma height right to find the chroma height.
    /// For YV12 this is 1 for example.
    /// chroma_height= AV_CEIL_RSHIFT(luma_height, log2_chroma_h)
    /// The note above is needed to ensure rounding up.
    /// This value only refers to the chroma components.
    pub log2_chroma_h: u8,
    /// Combination of AV_PIX_FMT_FLAG_... flags.
    pub flags: u64,
    /// Parameters that describe how pixels are packed.
    /// If the format has 1 or 2 components, then luma is 0.
    /// If the format has 3 or 4 components:
    /// if the RGB flag is set then 0 is red, 1 is green and 2 is blue;
    /// otherwise 0 is luma, 1 is chroma-U and 2 is chroma-V.
    ///
    /// If present, the Alpha channel is always the last component.
    pub comp: [AVComponentDescriptor; 4usize],
    /// Alternative comma-separated names.
    pub alias: *const lang_items::c_char,
}
#[test]
fn bindgen_test_layout_AVPixFmtDescriptor() {
    assert_eq!(
        std::mem::size_of::<AVPixFmtDescriptor>(),
        160usize,
        concat!("Size of: ", stringify!(AVPixFmtDescriptor))
    );
    assert_eq!(
        std::mem::align_of::<AVPixFmtDescriptor>(),
        8usize,
        concat!("Alignment of ", stringify!(AVPixFmtDescriptor))
    );
    assert_eq!(
        unsafe { &(*(std::ptr::null::<AVPixFmtDescriptor>())).name as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(AVPixFmtDescriptor),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe {
            &(*(std::ptr::null::<AVPixFmtDescriptor>())).nb_components as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(AVPixFmtDescriptor),
            "::",
            stringify!(nb_components)
        )
    );
    assert_eq!(
        unsafe {
            &(*(std::ptr::null::<AVPixFmtDescriptor>())).log2_chroma_w as *const _ as usize
        },
        9usize,
        concat!(
            "Offset of field: ",
            stringify!(AVPixFmtDescriptor),
            "::",
            stringify!(log2_chroma_w)
        )
    );
    assert_eq!(
        unsafe {
            &(*(std::ptr::null::<AVPixFmtDescriptor>())).log2_chroma_h as *const _ as usize
        },
        10usize,
        concat!(
            "Offset of field: ",
            stringify!(AVPixFmtDescriptor),
            "::",
            stringify!(log2_chroma_h)
        )
    );
    assert_eq!(
        unsafe { &(*(std::ptr::null::<AVPixFmtDescriptor>())).flags as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(AVPixFmtDescriptor),
            "::",
            stringify!(flags)
        )
    );
    assert_eq!(
        unsafe { &(*(std::ptr::null::<AVPixFmtDescriptor>())).comp as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(AVPixFmtDescriptor),
            "::",
            stringify!(comp)
        )
    );
    assert_eq!(
        unsafe { &(*(std::ptr::null::<AVPixFmtDescriptor>())).alias as *const _ as usize },
        152usize,
        concat!(
            "Offset of field: ",
            stringify!(AVPixFmtDescriptor),
            "::",
            stringify!(alias)
        )
    );
}
extern "C" {
    /// Return the number of bits per pixel used by the pixel format
    /// described by pixdesc. Note that this is not the same as the number
    /// of bits per sample.
    ///
    /// The returned number of bits refers to the number of bits actually
    /// used for storing the pixel information, that is padding bits are
    /// not counted.
    pub fn av_get_bits_per_pixel(pixdesc: *const AVPixFmtDescriptor) -> lang_items::c_int;
}
extern "C" {
    /// Return the number of bits per pixel for the pixel format
    /// described by pixdesc, including any padding or unused bits.
    pub fn av_get_padded_bits_per_pixel(pixdesc: *const AVPixFmtDescriptor) -> lang_items::c_int;
}
extern "C" {
    /// @return a pixel format descriptor for provided pixel format or NULL if
    /// this pixel format is unknown.
    pub fn av_pix_fmt_desc_get(pix_fmt: AVPixelFormat) -> *const AVPixFmtDescriptor;
}
extern "C" {
    /// Iterate over all pixel format descriptors known to libavutil.
    ///
    /// @param prev previous descriptor. NULL to get the first descriptor.
    ///
    /// @return next descriptor or NULL after the last descriptor
    pub fn av_pix_fmt_desc_next(prev: *const AVPixFmtDescriptor) -> *const AVPixFmtDescriptor;
}
extern "C" {
    /// @return an AVPixelFormat id described by desc, or AV_PIX_FMT_NONE if desc
    /// is not a valid pointer to a pixel format descriptor.
    pub fn av_pix_fmt_desc_get_id(desc: *const AVPixFmtDescriptor) -> AVPixelFormat;
}
extern "C" {
    /// Utility function to access log2_chroma_w log2_chroma_h from
    /// the pixel format AVPixFmtDescriptor.
    ///
    /// @param[in]  pix_fmt the pixel format
    /// @param[out] h_shift store log2_chroma_w (horizontal/width shift)
    /// @param[out] v_shift store log2_chroma_h (vertical/height shift)
    ///
    /// @return 0 on success, AVERROR(ENOSYS) on invalid or unknown pixel format
    pub fn av_pix_fmt_get_chroma_sub_sample(
        pix_fmt: AVPixelFormat,
        h_shift: *mut lang_items::c_int,
        v_shift: *mut lang_items::c_int,
    ) -> lang_items::c_int;
}
extern "C" {
    /// @return number of planes in pix_fmt, a negative AVERROR if pix_fmt is not a
    /// valid pixel format.
    pub fn av_pix_fmt_count_planes(pix_fmt: AVPixelFormat) -> lang_items::c_int;
}
extern "C" {
    /// @return the name for provided color range or NULL if unknown.
    pub fn av_color_range_name(range: AVColorRange) -> *const lang_items::c_char;
}
extern "C" {
    /// @return the AVColorRange value for name or an AVError if not found.
    pub fn av_color_range_from_name(name: *const lang_items::c_char) -> lang_items::c_int;
}
extern "C" {
    /// @return the name for provided color primaries or NULL if unknown.
    pub fn av_color_primaries_name(primaries: AVColorPrimaries) -> *const lang_items::c_char;
}
extern "C" {
    /// @return the AVColorPrimaries value for name or an AVError if not found.
    pub fn av_color_primaries_from_name(name: *const lang_items::c_char) -> lang_items::c_int;
}
extern "C" {
    /// @return the name for provided color transfer or NULL if unknown.
    pub fn av_color_transfer_name(
        transfer: AVColorTransferCharacteristic,
    ) -> *const lang_items::c_char;
}
extern "C" {
    /// @return the AVColorTransferCharacteristic value for name or an AVError if not found.
    pub fn av_color_transfer_from_name(name: *const lang_items::c_char) -> lang_items::c_int;
}
extern "C" {
    /// @return the name for provided color space or NULL if unknown.
    pub fn av_color_space_name(space: AVColorSpace) -> *const lang_items::c_char;
}
extern "C" {
    /// @return the AVColorSpace value for name or an AVError if not found.
    pub fn av_color_space_from_name(name: *const lang_items::c_char) -> lang_items::c_int;
}
extern "C" {
    /// @return the name for provided chroma location or NULL if unknown.
    pub fn av_chroma_location_name(location: AVChromaLocation) -> *const lang_items::c_char;
}
extern "C" {
    /// @return the AVChromaLocation value for name or an AVError if not found.
    pub fn av_chroma_location_from_name(name: *const lang_items::c_char) -> lang_items::c_int;
}
extern "C" {
    /// Return the pixel format corresponding to name.
    ///
    /// If there is no pixel format with name name, then looks for a
    /// pixel format with the name corresponding to the native endian
    /// format of name.
    /// For example in a little-endian system, first looks for "gray16",
    /// then for "gray16le".
    ///
    /// Finally if no pixel format has been found, returns AV_PIX_FMT_NONE.
    pub fn av_get_pix_fmt(name: *const lang_items::c_char) -> AVPixelFormat;
}
extern "C" {
    /// Return the short name for a pixel format, NULL in case pix_fmt is
    /// unknown.
    ///
    /// @see av_get_pix_fmt(), av_get_pix_fmt_string()
    pub fn av_get_pix_fmt_name(pix_fmt: AVPixelFormat) -> *const lang_items::c_char;
}
extern "C" {
    /// Print in buf the string corresponding to the pixel format with
    /// number pix_fmt, or a header if pix_fmt is negative.
    ///
    /// @param buf the buffer where to write the string
    /// @param buf_size the size of buf
    /// @param pix_fmt the number of the pixel format to print the
    /// corresponding info string, or a negative value to print the
    /// corresponding header.
    pub fn av_get_pix_fmt_string(
        buf: *mut lang_items::c_char,
        buf_size: lang_items::c_int,
        pix_fmt: AVPixelFormat,
    ) -> *mut lang_items::c_char;
}
extern "C" {
    /// Read a line from an image, and write the values of the
    /// pixel format component c to dst.
    ///
    /// @param data the array containing the pointers to the planes of the image
    /// @param linesize the array containing the linesizes of the image
    /// @param desc the pixel format descriptor for the image
    /// @param x the horizontal coordinate of the first pixel to read
    /// @param y the vertical coordinate of the first pixel to read
    /// @param w the width of the line to read, that is the number of
    /// values to write to dst
    /// @param read_pal_component if not zero and the format is a paletted
    /// format writes the values corresponding to the palette
    /// component c in data[1] to dst, rather than the palette indexes in
    /// data[0]. The behavior is undefined if the format is not paletted.
    pub fn av_read_image_line(
        dst: *mut u16,
        data: *mut *const u8,
        linesize: *const lang_items::c_int,
        desc: *const AVPixFmtDescriptor,
        x: lang_items::c_int,
        y: lang_items::c_int,
        c: lang_items::c_int,
        w: lang_items::c_int,
        read_pal_component: lang_items::c_int,
    );
}
extern "C" {
    /// Write the values from src to the pixel format component c of an
    /// image line.
    ///
    /// @param src array containing the values to write
    /// @param data the array containing the pointers to the planes of the
    /// image to write into. It is supposed to be zeroed.
    /// @param linesize the array containing the linesizes of the image
    /// @param desc the pixel format descriptor for the image
    /// @param x the horizontal coordinate of the first pixel to write
    /// @param y the vertical coordinate of the first pixel to write
    /// @param w the width of the line to write, that is the number of
    /// values to write to the image line
    pub fn av_write_image_line(
        src: *const u16,
        data: *mut *mut u8,
        linesize: *const lang_items::c_int,
        desc: *const AVPixFmtDescriptor,
        x: lang_items::c_int,
        y: lang_items::c_int,
        c: lang_items::c_int,
        w: lang_items::c_int,
    );
}
extern "C" {
    /// Utility function to swap the endianness of a pixel format.
    ///
    /// @param[in]  pix_fmt the pixel format
    ///
    /// @return pixel format with swapped endianness if it exists,
    /// otherwise AV_PIX_FMT_NONE
    pub fn av_pix_fmt_swap_endianness(pix_fmt: AVPixelFormat) -> AVPixelFormat;
}
extern "C" {
    /// Compute what kind of losses will occur when converting from one specific
    /// pixel format to another.
    /// When converting from one pixel format to another, information loss may occur.
    /// For example, when converting from RGB24 to GRAY, the color information will
    /// be lost. Similarly, other losses occur when converting from some formats to
    /// other formats. These losses can involve loss of chroma, but also loss of
    /// resolution, loss of color depth, loss due to the color space conversion, loss
    /// of the alpha bits or loss due to color quantization.
    /// av_get_fix_fmt_loss() informs you about the various types of losses
    /// which will occur when converting from one pixel format to another.
    ///
    /// @param[in] dst_pix_fmt destination pixel format
    /// @param[in] src_pix_fmt source pixel format
    /// @param[in] has_alpha Whether the source pixel format alpha channel is used.
    /// @return Combination of flags informing you what kind of losses will occur
    /// (maximum loss for an invalid dst_pix_fmt).
    pub fn av_get_pix_fmt_loss(
        dst_pix_fmt: AVPixelFormat,
        src_pix_fmt: AVPixelFormat,
        has_alpha: lang_items::c_int,
    ) -> lang_items::c_int;
}
extern "C" {
    /// Compute what kind of losses will occur when converting from one specific
    /// pixel format to another.
    /// When converting from one pixel format to another, information loss may occur.
    /// For example, when converting from RGB24 to GRAY, the color information will
    /// be lost. Similarly, other losses occur when converting from some formats to
    /// other formats. These losses can involve loss of chroma, but also loss of
    /// resolution, loss of color depth, loss due to the color space conversion, loss
    /// of the alpha bits or loss due to color quantization.
    /// av_get_fix_fmt_loss() informs you about the various types of losses
    /// which will occur when converting from one pixel format to another.
    ///
    /// @param[in] dst_pix_fmt destination pixel format
    /// @param[in] src_pix_fmt source pixel format
    /// @param[in] has_alpha Whether the source pixel format alpha channel is used.
    /// @return Combination of flags informing you what kind of losses will occur
    /// (maximum loss for an invalid dst_pix_fmt).
    pub fn av_find_best_pix_fmt_of_2(
        dst_pix_fmt1: AVPixelFormat,
        dst_pix_fmt2: AVPixelFormat,
        src_pix_fmt: AVPixelFormat,
        has_alpha: lang_items::c_int,
        loss_ptr: *mut lang_items::c_int,
    ) -> AVPixelFormat;
}
extern "C" {
    /// Compute the max pixel step for each plane of an image with a
    /// format described by pixdesc.
    ///
    /// The pixel step is the distance in bytes between the first byte of
    /// the group of bytes which describe a pixel component and the first
    /// byte of the successive group in the same plane for the same
    /// component.
    ///
    /// @param max_pixsteps an array which is filled with the max pixel step
    /// for each plane. Since a plane may contain different pixel
    /// components, the computed max_pixsteps[plane] is relative to the
    /// component in the plane with the max pixel step.
    /// @param max_pixstep_comps an array which is filled with the component
    /// for each plane which has the max pixel step. May be NULL.
    pub fn av_image_fill_max_pixsteps(
        max_pixsteps: *mut lang_items::c_int,
        max_pixstep_comps: *mut lang_items::c_int,
        pixdesc: *const AVPixFmtDescriptor,
    );
}
extern "C" {
    /// Compute the size of an image line with format pix_fmt and width
    /// width for the plane plane.
    ///
    /// @return the computed size in bytes
    pub fn av_image_get_linesize(
        pix_fmt: AVPixelFormat,
        width: lang_items::c_int,
        plane: lang_items::c_int,
    ) -> lang_items::c_int;
}
extern "C" {
    /// Fill plane linesizes for an image with pixel format pix_fmt and
    /// width width.
    ///
    /// @param linesizes array to be filled with the linesize for each plane
    /// @return >= 0 in case of success, a negative error code otherwise
    pub fn av_image_fill_linesizes(
        linesizes: *mut lang_items::c_int,
        pix_fmt: AVPixelFormat,
        width: lang_items::c_int,
    ) -> lang_items::c_int;
}
extern "C" {
    /// Fill plane data pointers for an image with pixel format pix_fmt and
    /// height height.
    ///
    /// @param data pointers array to be filled with the pointer for each image plane
    /// @param ptr the pointer to a buffer which will contain the image
    /// @param linesizes the array containing the linesize for each
    /// plane, should be filled by av_image_fill_linesizes()
    /// @return the size in bytes required for the image buffer, a negative
    /// error code in case of failure
    pub fn av_image_fill_pointers(
        data: *mut *mut u8,
        pix_fmt: AVPixelFormat,
        height: lang_items::c_int,
        ptr: *mut u8,
        linesizes: *const lang_items::c_int,
    ) -> lang_items::c_int;
}
extern "C" {
    /// Allocate an image with size w and h and pixel format pix_fmt, and
    /// fill pointers and linesizes accordingly.
    /// The allocated image buffer has to be freed by using
    /// av_freep(&pointers[0]).
    ///
    /// @param align the value to use for buffer size alignment
    /// @return the size in bytes required for the image buffer, a negative
    /// error code in case of failure
    pub fn av_image_alloc(
        pointers: *mut *mut u8,
        linesizes: *mut lang_items::c_int,
        w: lang_items::c_int,
        h: lang_items::c_int,
        pix_fmt: AVPixelFormat,
        align: lang_items::c_int,
    ) -> lang_items::c_int;
}
extern "C" {
    /// Copy image plane from src to dst.
    /// That is, copy "height" number of lines of "bytewidth" bytes each.
    /// The first byte of each successive line is separated by *_linesize
    /// bytes.
    ///
    /// bytewidth must be contained by both absolute values of dst_linesize
    /// and src_linesize, otherwise the function behavior is undefined.
    ///
    /// @param dst_linesize linesize for the image plane in dst
    /// @param src_linesize linesize for the image plane in src
    pub fn av_image_copy_plane(
        dst: *mut u8,
        dst_linesize: lang_items::c_int,
        src: *const u8,
        src_linesize: lang_items::c_int,
        bytewidth: lang_items::c_int,
        height: lang_items::c_int,
    );
}
extern "C" {
    /// Copy image in src_data to dst_data.
    ///
    /// @param dst_linesizes linesizes for the image in dst_data
    /// @param src_linesizes linesizes for the image in src_data
    pub fn av_image_copy(
        dst_data: *mut *mut u8,
        dst_linesizes: *mut lang_items::c_int,
        src_data: *mut *const u8,
        src_linesizes: *const lang_items::c_int,
        pix_fmt: AVPixelFormat,
        width: lang_items::c_int,
        height: lang_items::c_int,
    );
}
extern "C" {
    /// Copy image data located in uncacheable (e.g. GPU mapped) memory. Where
    /// available, this function will use special functionality for reading from such
    /// memory, which may result in greatly improved performance compared to plain
    /// av_image_copy().
    ///
    /// The data pointers and the linesizes must be aligned to the maximum required
    /// by the CPU architecture.
    ///
    /// @note The linesize parameters have the type ptrdiff_t here, while they are
    /// int for av_image_copy().
    /// @note On x86, the linesizes currently need to be aligned to the cacheline
    /// size (i.e. 64) to get improved performance.
    pub fn av_image_copy_uc_from(
        dst_data: *mut *mut u8,
        dst_linesizes: *const isize,
        src_data: *mut *const u8,
        src_linesizes: *const isize,
        pix_fmt: AVPixelFormat,
        width: lang_items::c_int,
        height: lang_items::c_int,
    );
}
extern "C" {
    /// Setup the data pointers and linesizes based on the specified image
    /// parameters and the provided array.
    ///
    /// The fields of the given image are filled in by using the src
    /// address which points to the image data buffer. Depending on the
    /// specified pixel format, one or multiple image data pointers and
    /// line sizes will be set.  If a planar format is specified, several
    /// pointers will be set pointing to the different picture planes and
    /// the line sizes of the different planes will be stored in the
    /// lines_sizes array. Call with src == NULL to get the required
    /// size for the src buffer.
    ///
    /// To allocate the buffer and fill in the dst_data and dst_linesize in
    /// one call, use av_image_alloc().
    ///
    /// @param dst_data      data pointers to be filled in
    /// @param dst_linesize  linesizes for the image in dst_data to be filled in
    /// @param src           buffer which will contain or contains the actual image data, can be NULL
    /// @param pix_fmt       the pixel format of the image
    /// @param width         the width of the image in pixels
    /// @param height        the height of the image in pixels
    /// @param align         the value used in src for linesize alignment
    /// @return the size in bytes required for src, a negative error code
    /// in case of failure
    pub fn av_image_fill_arrays(
        dst_data: *mut *mut u8,
        dst_linesize: *mut lang_items::c_int,
        src: *const u8,
        pix_fmt: AVPixelFormat,
        width: lang_items::c_int,
        height: lang_items::c_int,
        align: lang_items::c_int,
    ) -> lang_items::c_int;
}
extern "C" {
    /// Return the size in bytes of the amount of data required to store an
    /// image with the given parameters.
    ///
    /// @param pix_fmt  the pixel format of the image
    /// @param width    the width of the image in pixels
    /// @param height   the height of the image in pixels
    /// @param align    the assumed linesize alignment
    /// @return the buffer size in bytes, a negative error code in case of failure
    pub fn av_image_get_buffer_size(
        pix_fmt: AVPixelFormat,
        width: lang_items::c_int,
        height: lang_items::c_int,
        align: lang_items::c_int,
    ) -> lang_items::c_int;
}
extern "C" {
    /// Copy image data from an image into a buffer.
    ///
    /// av_image_get_buffer_size() can be used to compute the required size
    /// for the buffer to fill.
    ///
    /// @param dst           a buffer into which picture data will be copied
    /// @param dst_size      the size in bytes of dst
    /// @param src_data      pointers containing the source image data
    /// @param src_linesize  linesizes for the image in src_data
    /// @param pix_fmt       the pixel format of the source image
    /// @param width         the width of the source image in pixels
    /// @param height        the height of the source image in pixels
    /// @param align         the assumed linesize alignment for dst
    /// @return the number of bytes written to dst, or a negative value
    /// (error code) on error
    pub fn av_image_copy_to_buffer(
        dst: *mut u8,
        dst_size: lang_items::c_int,
        src_data: *const *const u8,
        src_linesize: *const lang_items::c_int,
        pix_fmt: AVPixelFormat,
        width: lang_items::c_int,
        height: lang_items::c_int,
        align: lang_items::c_int,
    ) -> lang_items::c_int;
}
extern "C" {
    /// Check if the given dimension of an image is valid, meaning that all
    /// bytes of the image can be addressed with a signed int.
    ///
    /// @param w the width of the picture
    /// @param h the height of the picture
    /// @param log_offset the offset to sum to the log level for logging with log_ctx
    /// @param log_ctx the parent logging context, it may be NULL
    /// @return >= 0 if valid, a negative error code otherwise
    pub fn av_image_check_size(
        w: lang_items::c_uint,
        h: lang_items::c_uint,
        log_offset: lang_items::c_int,
        log_ctx: *mut lang_items::c_void,
    ) -> lang_items::c_int;
}
extern "C" {
    /// Check if the given dimension of an image is valid, meaning that all
    /// bytes of a plane of an image with the specified pix_fmt can be addressed
    /// with a signed int.
    ///
    /// @param w the width of the picture
    /// @param h the height of the picture
    /// @param max_pixels the maximum number of pixels the user wants to accept
    /// @param pix_fmt the pixel format, can be AV_PIX_FMT_NONE if unknown.
    /// @param log_offset the offset to sum to the log level for logging with log_ctx
    /// @param log_ctx the parent logging context, it may be NULL
    /// @return >= 0 if valid, a negative error code otherwise
    pub fn av_image_check_size2(
        w: lang_items::c_uint,
        h: lang_items::c_uint,
        max_pixels: i64,
        pix_fmt: AVPixelFormat,
        log_offset: lang_items::c_int,
        log_ctx: *mut lang_items::c_void,
    ) -> lang_items::c_int;
}
extern "C" {
    /// Check if the given sample aspect ratio of an image is valid.
    ///
    /// It is considered invalid if the denominator is 0 or if applying the ratio
    /// to the image size would make the smaller dimension less than 1. If the
    /// sar numerator is 0, it is considered unknown and will return as valid.
    ///
    /// @param w width of the image
    /// @param h height of the image
    /// @param sar sample aspect ratio of the image
    /// @return 0 if valid, a negative AVERROR code otherwise
    pub fn av_image_check_sar(
        w: lang_items::c_uint,
        h: lang_items::c_uint,
        sar: AVRational,
    ) -> lang_items::c_int;
}
extern "C" {
    /// Overwrite the image data with black. This is suitable for filling a
    /// sub-rectangle of an image, meaning the padding between the right most pixel
    /// and the left most pixel on the next line will not be overwritten. For some
    /// formats, the image size might be rounded up due to inherent alignment.
    ///
    /// If the pixel format has alpha, the alpha is cleared to opaque.
    ///
    /// This can return an error if the pixel format is not supported. Normally, all
    /// non-hwaccel pixel formats should be supported.
    ///
    /// Passing NULL for dst_data is allowed. Then the function returns whether the
    /// operation would have succeeded. (It can return an error if the pix_fmt is
    /// not supported.)
    ///
    /// @param dst_data      data pointers to destination image
    /// @param dst_linesize  linesizes for the destination image
    /// @param pix_fmt       the pixel format of the image
    /// @param range         the color range of the image (important for colorspaces such as YUV)
    /// @param width         the width of the image in pixels
    /// @param height        the height of the image in pixels
    /// @return 0 if the image data was cleared, a negative AVERROR code otherwise
    pub fn av_image_fill_black(
        dst_data: *mut *mut u8,
        dst_linesize: *const isize,
        pix_fmt: AVPixelFormat,
        range: AVColorRange,
        width: lang_items::c_int,
        height: lang_items::c_int,
    ) -> lang_items::c_int;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct AVDictionaryEntry {
    pub key: *mut lang_items::c_char,
    pub value: *mut lang_items::c_char,
}
#[test]
fn bindgen_test_layout_AVDictionaryEntry() {
    assert_eq!(
        std::mem::size_of::<AVDictionaryEntry>(),
        16usize,
        concat!("Size of: ", stringify!(AVDictionaryEntry))
    );
    assert_eq!(
        std::mem::align_of::<AVDictionaryEntry>(),
        8usize,
        concat!("Alignment of ", stringify!(AVDictionaryEntry))
    );
    assert_eq!(
        unsafe { &(*(std::ptr::null::<AVDictionaryEntry>())).key as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(AVDictionaryEntry),
            "::",
            stringify!(key)
        )
    );
    assert_eq!(
        unsafe { &(*(std::ptr::null::<AVDictionaryEntry>())).value as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(AVDictionaryEntry),
            "::",
            stringify!(value)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct AVDictionary {
    _unused: [u8; 0],
}
extern "C" {
    /// Get a dictionary entry with matching key.
    ///
    /// The returned entry key or value must not be changed, or it will
    /// cause undefined behavior.
    ///
    /// To iterate through all the dictionary entries, you can set the matching key
    /// to the null string "" and set the AV_DICT_IGNORE_SUFFIX flag.
    ///
    /// @param prev Set to the previous matching element to find the next.
    /// If set to NULL the first matching element is returned.
    /// @param key matching key
    /// @param flags a collection of AV_DICT_* flags controlling how the entry is retrieved
    /// @return found entry or NULL in case no matching entry was found in the dictionary
    pub fn av_dict_get(
        m: *const AVDictionary,
        key: *const lang_items::c_char,
        prev: *const AVDictionaryEntry,
        flags: lang_items::c_int,
    ) -> *mut AVDictionaryEntry;
}
extern "C" {
    /// Get number of entries in dictionary.
    ///
    /// @param m dictionary
    /// @return  number of entries in dictionary
    pub fn av_dict_count(m: *const AVDictionary) -> lang_items::c_int;
}
extern "C" {
    /// Set the given entry in *pm, overwriting an existing entry.
    ///
    /// Note: If AV_DICT_DONT_STRDUP_KEY or AV_DICT_DONT_STRDUP_VAL is set,
    /// these arguments will be freed on error.
    ///
    /// Warning: Adding a new entry to a dictionary invalidates all existing entries
    /// previously returned with av_dict_get.
    ///
    /// @param pm pointer to a pointer to a dictionary struct. If *pm is NULL
    /// a dictionary struct is allocated and put in *pm.
    /// @param key entry key to add to *pm (will either be av_strduped or added as a new key depending on flags)
    /// @param value entry value to add to *pm (will be av_strduped or added as a new key depending on flags).
    /// Passing a NULL value will cause an existing entry to be deleted.
    /// @return >= 0 on success otherwise an error code <0
    pub fn av_dict_set(
        pm: *mut *mut AVDictionary,
        key: *const lang_items::c_char,
        value: *const lang_items::c_char,
        flags: lang_items::c_int,
    ) -> lang_items::c_int;
}
extern "C" {
    /// Convenience wrapper for av_dict_set that converts the value to a string
    /// and stores it.
    ///
    /// Note: If AV_DICT_DONT_STRDUP_KEY is set, key will be freed on error.
    pub fn av_dict_set_int(
        pm: *mut *mut AVDictionary,
        key: *const lang_items::c_char,
        value: i64,
        flags: lang_items::c_int,
    ) -> lang_items::c_int;
}
extern "C" {
    /// Parse the key/value pairs list and add the parsed entries to a dictionary.
    ///
    /// In case of failure, all the successfully set entries are stored in
    /// *pm. You may need to manually free the created dictionary.
    ///
    /// @param key_val_sep  a 0-terminated list of characters used to separate
    /// key from value
    /// @param pairs_sep    a 0-terminated list of characters used to separate
    /// two pairs from each other
    /// @param flags        flags to use when adding to dictionary.
    /// AV_DICT_DONT_STRDUP_KEY and AV_DICT_DONT_STRDUP_VAL
    /// are ignored since the key/value tokens will always
    /// be duplicated.
    /// @return             0 on success, negative AVERROR code on failure
    pub fn av_dict_parse_string(
        pm: *mut *mut AVDictionary,
        str: *const lang_items::c_char,
        key_val_sep: *const lang_items::c_char,
        pairs_sep: *const lang_items::c_char,
        flags: lang_items::c_int,
    ) -> lang_items::c_int;
}
extern "C" {
    /// Copy entries from one AVDictionary struct into another.
    /// @param dst pointer to a pointer to a AVDictionary struct. If *dst is NULL,
    /// this function will allocate a struct for you and put it in *dst
    /// @param src pointer to source AVDictionary struct
    /// @param flags flags to use when setting entries in *dst
    /// @note metadata is read using the AV_DICT_IGNORE_SUFFIX flag
    /// @return 0 on success, negative AVERROR code on failure. If dst was allocated
    /// by this function, callers should free the associated memory.
    pub fn av_dict_copy(
        dst: *mut *mut AVDictionary,
        src: *const AVDictionary,
        flags: lang_items::c_int,
    ) -> lang_items::c_int;
}
extern "C" {
    /// Free all the memory allocated for an AVDictionary struct
    /// and all keys and values.
    pub fn av_dict_free(m: *mut *mut AVDictionary);
}
extern "C" {
    /// Get dictionary entries as a string.
    ///
    /// Create a string containing dictionary's entries.
    /// Such string may be passed back to av_dict_parse_string().
    /// @note String is escaped with backslashes ('\').
    ///
    /// @param[in]  m             dictionary
    /// @param[out] buffer        Pointer to buffer that will be allocated with string containg entries.
    /// Buffer must be freed by the caller when is no longer needed.
    /// @param[in]  key_val_sep   character used to separate key from value
    /// @param[in]  pairs_sep     character used to separate two pairs from each other
    /// @return                   >= 0 on success, negative on error
    /// @warning Separators cannot be neither '\\' nor '\0'. They also cannot be the same.
    pub fn av_dict_get_string(
        m: *const AVDictionary,
        buffer: *mut *mut lang_items::c_char,
        key_val_sep: lang_items::c_char,
        pairs_sep: lang_items::c_char,
    ) -> lang_items::c_int;
}
pub const AVSampleFormat_AV_SAMPLE_FMT_NONE: AVSampleFormat = -1;
/// < unsigned 8 bits
pub const AVSampleFormat_AV_SAMPLE_FMT_U8: AVSampleFormat = 0;
/// < signed 16 bits
pub const AVSampleFormat_AV_SAMPLE_FMT_S16: AVSampleFormat = 1;
/// < signed 32 bits
pub const AVSampleFormat_AV_SAMPLE_FMT_S32: AVSampleFormat = 2;
/// < float
pub const AVSampleFormat_AV_SAMPLE_FMT_FLT: AVSampleFormat = 3;
/// < double
pub const AVSampleFormat_AV_SAMPLE_FMT_DBL: AVSampleFormat = 4;
/// < unsigned 8 bits, planar
pub const AVSampleFormat_AV_SAMPLE_FMT_U8P: AVSampleFormat = 5;
/// < signed 16 bits, planar
pub const AVSampleFormat_AV_SAMPLE_FMT_S16P: AVSampleFormat = 6;
/// < signed 32 bits, planar
pub const AVSampleFormat_AV_SAMPLE_FMT_S32P: AVSampleFormat = 7;
/// < float, planar
pub const AVSampleFormat_AV_SAMPLE_FMT_FLTP: AVSampleFormat = 8;
/// < double, planar
pub const AVSampleFormat_AV_SAMPLE_FMT_DBLP: AVSampleFormat = 9;
/// < signed 64 bits
pub const AVSampleFormat_AV_SAMPLE_FMT_S64: AVSampleFormat = 10;
/// < signed 64 bits, planar
pub const AVSampleFormat_AV_SAMPLE_FMT_S64P: AVSampleFormat = 11;
/// < Number of sample formats. DO NOT USE if linking dynamically
pub const AVSampleFormat_AV_SAMPLE_FMT_NB: AVSampleFormat = 12;
/// Audio sample formats
///
/// - The data described by the sample format is always in native-endian order.
/// Sample values can be expressed by native C types, hence the lack of a signed
/// 24-bit sample format even though it is a common raw audio data format.
///
/// - The floating-point formats are based on full volume being in the range
/// [-1.0, 1.0]. Any values outside this range are beyond full volume level.
///
/// - The data layout as used in av_samples_fill_arrays() and elsewhere in FFmpeg
/// (such as AVFrame in libavcodec) is as follows:
///
/// @par
/// For planar sample formats, each audio channel is in a separate data plane,
/// and linesize is the buffer size, in bytes, for a single plane. All data
/// planes must be the same size. For packed sample formats, only the first data
/// plane is used, and samples for each channel are interleaved. In this case,
/// linesize is the buffer size, in bytes, for the 1 plane.
///
pub type AVSampleFormat = i32;
extern "C" {
    /// Return the name of sample_fmt, or NULL if sample_fmt is not
    /// recognized.
    pub fn av_get_sample_fmt_name(sample_fmt: AVSampleFormat) -> *const lang_items::c_char;
}
extern "C" {
    /// Return a sample format corresponding to name, or AV_SAMPLE_FMT_NONE
    /// on error.
    pub fn av_get_sample_fmt(name: *const lang_items::c_char) -> AVSampleFormat;
}
extern "C" {
    /// Return the planar<->packed alternative form of the given sample format, or
    /// AV_SAMPLE_FMT_NONE on error. If the passed sample_fmt is already in the
    /// requested planar/packed format, the format returned is the same as the
    /// input.
    pub fn av_get_alt_sample_fmt(
        sample_fmt: AVSampleFormat,
        planar: lang_items::c_int,
    ) -> AVSampleFormat;
}
extern "C" {
    /// Get the packed alternative form of the given sample format.
    ///
    /// If the passed sample_fmt is already in packed format, the format returned is
    /// the same as the input.
    ///
    /// @return  the packed alternative form of the given sample format or
    /// AV_SAMPLE_FMT_NONE on error.
    pub fn av_get_packed_sample_fmt(sample_fmt: AVSampleFormat) -> AVSampleFormat;
}
extern "C" {
    /// Get the planar alternative form of the given sample format.
    ///
    /// If the passed sample_fmt is already in planar format, the format returned is
    /// the same as the input.
    ///
    /// @return  the planar alternative form of the given sample format or
    /// AV_SAMPLE_FMT_NONE on error.
    pub fn av_get_planar_sample_fmt(sample_fmt: AVSampleFormat) -> AVSampleFormat;
}
extern "C" {
    /// Generate a string corresponding to the sample format with
    /// sample_fmt, or a header if sample_fmt is negative.
    ///
    /// @param buf the buffer where to write the string
    /// @param buf_size the size of buf
    /// @param sample_fmt the number of the sample format to print the
    /// corresponding info string, or a negative value to print the
    /// corresponding header.
    /// @return the pointer to the filled buffer or NULL if sample_fmt is
    /// unknown or in case of other errors
    pub fn av_get_sample_fmt_string(
        buf: *mut lang_items::c_char,
        buf_size: lang_items::c_int,
        sample_fmt: AVSampleFormat,
    ) -> *mut lang_items::c_char;
}
extern "C" {
    /// Return number of bytes per sample.
    ///
    /// @param sample_fmt the sample format
    /// @return number of bytes per sample or zero if unknown for the given
    /// sample format
    pub fn av_get_bytes_per_sample(sample_fmt: AVSampleFormat) -> lang_items::c_int;
}
extern "C" {
    /// Check if the sample format is planar.
    ///
    /// @param sample_fmt the sample format to inspect
    /// @return 1 if the sample format is planar, 0 if it is interleaved
    pub fn av_sample_fmt_is_planar(sample_fmt: AVSampleFormat) -> lang_items::c_int;
}
extern "C" {
    /// Get the required buffer size for the given audio parameters.
    ///
    /// @param[out] linesize calculated linesize, may be NULL
    /// @param nb_channels   the number of channels
    /// @param nb_samples    the number of samples in a single channel
    /// @param sample_fmt    the sample format
    /// @param align         buffer size alignment (0 = default, 1 = no alignment)
    /// @return              required buffer size, or negative error code on failure
    pub fn av_samples_get_buffer_size(
        linesize: *mut lang_items::c_int,
        nb_channels: lang_items::c_int,
        nb_samples: lang_items::c_int,
        sample_fmt: AVSampleFormat,
        align: lang_items::c_int,
    ) -> lang_items::c_int;
}
extern "C" {
    /// Fill plane data pointers and linesize for samples with sample
    /// format sample_fmt.
    ///
    /// The audio_data array is filled with the pointers to the samples data planes:
    /// for planar, set the start point of each channel's data within the buffer,
    /// for packed, set the start point of the entire buffer only.
    ///
    /// The value pointed to by linesize is set to the aligned size of each
    /// channel's data buffer for planar layout, or to the aligned size of the
    /// buffer for all channels for packed layout.
    ///
    /// The buffer in buf must be big enough to contain all the samples
    /// (use av_samples_get_buffer_size() to compute its minimum size),
    /// otherwise the audio_data pointers will point to invalid data.
    ///
    /// @see enum AVSampleFormat
    /// The documentation for AVSampleFormat describes the data layout.
    ///
    /// @param[out] audio_data  array to be filled with the pointer for each channel
    /// @param[out] linesize    calculated linesize, may be NULL
    /// @param buf              the pointer to a buffer containing the samples
    /// @param nb_channels      the number of channels
    /// @param nb_samples       the number of samples in a single channel
    /// @param sample_fmt       the sample format
    /// @param align            buffer size alignment (0 = default, 1 = no alignment)
    /// @return                 >=0 on success or a negative error code on failure
    /// @todo return minimum size in bytes required for the buffer in case
    /// of success at the next bump
    pub fn av_samples_fill_arrays(
        audio_data: *mut *mut u8,
        linesize: *mut lang_items::c_int,
        buf: *const u8,
        nb_channels: lang_items::c_int,
        nb_samples: lang_items::c_int,
        sample_fmt: AVSampleFormat,
        align: lang_items::c_int,
    ) -> lang_items::c_int;
}
extern "C" {
    /// Allocate a samples buffer for nb_samples samples, and fill data pointers and
    /// linesize accordingly.
    /// The allocated samples buffer can be freed by using av_freep(&audio_data[0])
    /// Allocated data will be initialized to silence.
    ///
    /// @see enum AVSampleFormat
    /// The documentation for AVSampleFormat describes the data layout.
    ///
    /// @param[out] audio_data  array to be filled with the pointer for each channel
    /// @param[out] linesize    aligned size for audio buffer(s), may be NULL
    /// @param nb_channels      number of audio channels
    /// @param nb_samples       number of samples per channel
    /// @param align            buffer size alignment (0 = default, 1 = no alignment)
    /// @return                 >=0 on success or a negative error code on failure
    /// @todo return the size of the allocated buffer in case of success at the next bump
    /// @see av_samples_fill_arrays()
    /// @see av_samples_alloc_array_and_samples()
    pub fn av_samples_alloc(
        audio_data: *mut *mut u8,
        linesize: *mut lang_items::c_int,
        nb_channels: lang_items::c_int,
        nb_samples: lang_items::c_int,
        sample_fmt: AVSampleFormat,
        align: lang_items::c_int,
    ) -> lang_items::c_int;
}
extern "C" {
    /// Allocate a data pointers array, samples buffer for nb_samples
    /// samples, and fill data pointers and linesize accordingly.
    ///
    /// This is the same as av_samples_alloc(), but also allocates the data
    /// pointers array.
    ///
    /// @see av_samples_alloc()
    pub fn av_samples_alloc_array_and_samples(
        audio_data: *mut *mut *mut u8,
        linesize: *mut lang_items::c_int,
        nb_channels: lang_items::c_int,
        nb_samples: lang_items::c_int,
        sample_fmt: AVSampleFormat,
        align: lang_items::c_int,
    ) -> lang_items::c_int;
}
extern "C" {
    /// Copy samples from src to dst.
    ///
    /// @param dst destination array of pointers to data planes
    /// @param src source array of pointers to data planes
    /// @param dst_offset offset in samples at which the data will be written to dst
    /// @param src_offset offset in samples at which the data will be read from src
    /// @param nb_samples number of samples to be copied
    /// @param nb_channels number of audio channels
    /// @param sample_fmt audio sample format
    pub fn av_samples_copy(
        dst: *mut *mut u8,
        src: *const *mut u8,
        dst_offset: lang_items::c_int,
        src_offset: lang_items::c_int,
        nb_samples: lang_items::c_int,
        nb_channels: lang_items::c_int,
        sample_fmt: AVSampleFormat,
    ) -> lang_items::c_int;
}
extern "C" {
    /// Fill an audio buffer with silence.
    ///
    /// @param audio_data  array of pointers to data planes
    /// @param offset      offset in samples at which to start filling
    /// @param nb_samples  number of samples to fill
    /// @param nb_channels number of audio channels
    /// @param sample_fmt  audio sample format
    pub fn av_samples_set_silence(
        audio_data: *mut *mut u8,
        offset: lang_items::c_int,
        nb_samples: lang_items::c_int,
        nb_channels: lang_items::c_int,
        sample_fmt: AVSampleFormat,
    ) -> lang_items::c_int;
}
pub const AVOptionType_AV_OPT_TYPE_FLAGS: AVOptionType = 0;
pub const AVOptionType_AV_OPT_TYPE_INT: AVOptionType = 1;
pub const AVOptionType_AV_OPT_TYPE_INT64: AVOptionType = 2;
pub const AVOptionType_AV_OPT_TYPE_DOUBLE: AVOptionType = 3;
pub const AVOptionType_AV_OPT_TYPE_FLOAT: AVOptionType = 4;
pub const AVOptionType_AV_OPT_TYPE_STRING: AVOptionType = 5;
pub const AVOptionType_AV_OPT_TYPE_RATIONAL: AVOptionType = 6;
/// < offset must point to a pointer immediately followed by an int for the length
pub const AVOptionType_AV_OPT_TYPE_BINARY: AVOptionType = 7;
pub const AVOptionType_AV_OPT_TYPE_DICT: AVOptionType = 8;
pub const AVOptionType_AV_OPT_TYPE_UINT64: AVOptionType = 9;
pub const AVOptionType_AV_OPT_TYPE_CONST: AVOptionType = 10;
/// < offset must point to two consecutive integers
pub const AVOptionType_AV_OPT_TYPE_IMAGE_SIZE: AVOptionType = 11;
pub const AVOptionType_AV_OPT_TYPE_PIXEL_FMT: AVOptionType = 12;
pub const AVOptionType_AV_OPT_TYPE_SAMPLE_FMT: AVOptionType = 13;
/// < offset must point to AVRational
pub const AVOptionType_AV_OPT_TYPE_VIDEO_RATE: AVOptionType = 14;
pub const AVOptionType_AV_OPT_TYPE_DURATION: AVOptionType = 15;
pub const AVOptionType_AV_OPT_TYPE_COLOR: AVOptionType = 16;
pub const AVOptionType_AV_OPT_TYPE_CHANNEL_LAYOUT: AVOptionType = 17;
pub const AVOptionType_AV_OPT_TYPE_BOOL: AVOptionType = 18;
/// @defgroup avoptions AVOptions
/// @ingroup lavu_data
/// @{
/// AVOptions provide a generic system to declare options on arbitrary structs
/// ("objects"). An option can have a help text, a type and a range of possible
/// values. Options may then be enumerated, read and written to.
///
/// @section avoptions_implement Implementing AVOptions
/// This section describes how to add AVOptions capabilities to a struct.
///
/// All AVOptions-related information is stored in an AVClass. Therefore
/// the first member of the struct should be a pointer to an AVClass describing it.
/// The option field of the AVClass must be set to a NULL-terminated static array
/// of AVOptions. Each AVOption must have a non-empty name, a type, a default
/// value and for number-type AVOptions also a range of allowed values. It must
/// also declare an offset in bytes from the start of the struct, where the field
/// associated with this AVOption is located. Other fields in the AVOption struct
/// should also be set when applicable, but are not required.
///
/// The following example illustrates an AVOptions-enabled struct:
/// @code
/// typedef struct test_struct {
/// const AVClass *class;
/// int      int_opt;
/// char    *str_opt;
/// uint8_t *bin_opt;
/// int      bin_len;
/// } test_struct;
///
/// static const AVOption test_options[] = {
/// { "test_int", "This is a test option of int type.", offsetof(test_struct, int_opt),
/// AV_OPT_TYPE_INT, { .i64 = -1 }, INT_MIN, INT_MAX },
/// { "test_str", "This is a test option of string type.", offsetof(test_struct, str_opt),
/// AV_OPT_TYPE_STRING },
/// { "test_bin", "This is a test option of binary type.", offsetof(test_struct, bin_opt),
/// AV_OPT_TYPE_BINARY },
/// { NULL },
/// };
///
/// static const AVClass test_class = {
/// .class_name = "test class",
/// .item_name  = av_default_item_name,
/// .option     = test_options,
/// .version    = LIBAVUTIL_VERSION_INT,
/// };
/// @endcode
///
/// Next, when allocating your struct, you must ensure that the AVClass pointer
/// is set to the correct value. Then, av_opt_set_defaults() can be called to
/// initialize defaults. After that the struct is ready to be used with the
/// AVOptions API.
///
/// When cleaning up, you may use the av_opt_free() function to automatically
/// free all the allocated string and binary options.
///
/// Continuing with the above example:
///
/// @code
/// test_struct *alloc_test_struct(void)
/// {
/// test_struct *ret = av_mallocz(sizeof(*ret));
/// ret->class = &test_class;
/// av_opt_set_defaults(ret);
/// return ret;
/// }
/// void free_test_struct(test_struct **foo)
/// {
/// av_opt_free(*foo);
/// av_freep(foo);
/// }
/// @endcode
///
/// @subsection avoptions_implement_nesting Nesting
/// It may happen that an AVOptions-enabled struct contains another
/// AVOptions-enabled struct as a member (e.g. AVCodecContext in
/// libavcodec exports generic options, while its priv_data field exports
/// codec-specific options). In such a case, it is possible to set up the
/// parent struct to export a child's options. To do that, simply
/// implement AVClass.child_next() and AVClass.child_class_next() in the
/// parent struct's AVClass.
/// Assuming that the test_struct from above now also contains a
/// child_struct field:
///
/// @code
/// typedef struct child_struct {
/// AVClass *class;
/// int flags_opt;
/// } child_struct;
/// static const AVOption child_opts[] = {
/// { "test_flags", "This is a test option of flags type.",
/// offsetof(child_struct, flags_opt), AV_OPT_TYPE_FLAGS, { .i64 = 0 }, INT_MIN, INT_MAX },
/// { NULL },
/// };
/// static const AVClass child_class = {
/// .class_name = "child class",
/// .item_name  = av_default_item_name,
/// .option     = child_opts,
/// .version    = LIBAVUTIL_VERSION_INT,
/// };
///
/// void *child_next(void *obj, void *prev)
/// {
/// test_struct *t = obj;
/// if (!prev && t->child_struct)
/// return t->child_struct;
/// return NULL
/// }
/// const AVClass child_class_next(const AVClass *prev)
/// {
/// return prev ? NULL : &child_class;
/// }
/// @endcode
/// Putting child_next() and child_class_next() as defined above into
/// test_class will now make child_struct's options accessible through
/// test_struct (again, proper setup as described above needs to be done on
/// child_struct right after it is created).
///
/// From the above example it might not be clear why both child_next()
/// and child_class_next() are needed. The distinction is that child_next()
/// iterates over actually existing objects, while child_class_next()
/// iterates over all possible child classes. E.g. if an AVCodecContext
/// was initialized to use a codec which has private options, then its
/// child_next() will return AVCodecContext.priv_data and finish
/// iterating. OTOH child_class_next() on AVCodecContext.av_class will
/// iterate over all available codecs with private options.
///
/// @subsection avoptions_implement_named_constants Named constants
/// It is possible to create named constants for options. Simply set the unit
/// field of the option the constants should apply to a string and
/// create the constants themselves as options of type AV_OPT_TYPE_CONST
/// with their unit field set to the same string.
/// Their default_val field should contain the value of the named
/// constant.
/// For example, to add some named constants for the test_flags option
/// above, put the following into the child_opts array:
/// @code
/// { "test_flags", "This is a test option of flags type.",
/// offsetof(child_struct, flags_opt), AV_OPT_TYPE_FLAGS, { .i64 = 0 }, INT_MIN, INT_MAX, "test_unit" },
/// { "flag1", "This is a flag with value 16", 0, AV_OPT_TYPE_CONST, { .i64 = 16 }, 0, 0, "test_unit" },
/// @endcode
///
/// @section avoptions_use Using AVOptions
/// This section deals with accessing options in an AVOptions-enabled struct.
/// Such structs in FFmpeg are e.g. AVCodecContext in libavcodec or
/// AVFormatContext in libavformat.
///
/// @subsection avoptions_use_examine Examining AVOptions
/// The basic functions for examining options are av_opt_next(), which iterates
/// over all options defined for one object, and av_opt_find(), which searches
/// for an option with the given name.
///
/// The situation is more complicated with nesting. An AVOptions-enabled struct
/// may have AVOptions-enabled children. Passing the AV_OPT_SEARCH_CHILDREN flag
/// to av_opt_find() will make the function search children recursively.
///
/// For enumerating there are basically two cases. The first is when you want to
/// get all options that may potentially exist on the struct and its children
/// (e.g.  when constructing documentation). In that case you should call
/// av_opt_child_class_next() recursively on the parent struct's AVClass.  The
/// second case is when you have an already initialized struct with all its
/// children and you want to get all options that can be actually written or read
/// from it. In that case you should call av_opt_child_next() recursively (and
/// av_opt_next() on each result).
///
/// @subsection avoptions_use_get_set Reading and writing AVOptions
/// When setting options, you often have a string read directly from the
/// user. In such a case, simply passing it to av_opt_set() is enough. For
/// non-string type options, av_opt_set() will parse the string according to the
/// option type.
///
/// Similarly av_opt_get() will read any option type and convert it to a string
/// which will be returned. Do not forget that the string is allocated, so you
/// have to free it with av_free().
///
/// In some cases it may be more convenient to put all options into an
/// AVDictionary and call av_opt_set_dict() on it. A specific case of this
/// are the format/codec open functions in lavf/lavc which take a dictionary
/// filled with option as a parameter. This makes it possible to set some options
/// that cannot be set otherwise, since e.g. the input file format is not known
/// before the file is actually opened.
pub type AVOptionType = u32;
/// AVOption
#[repr(C)]
#[derive(Copy, Clone)]
pub struct AVOption {
    pub name: *const lang_items::c_char,
    /// short English help text
    /// @todo What about other languages?
    pub help: *const lang_items::c_char,
    /// The offset relative to the context structure where the option
    /// value is stored. It should be 0 for named constants.
    pub offset: lang_items::c_int,
    pub type_: AVOptionType,
    pub default_val: AVOption__bindgen_ty_1,
    /// < minimum valid value for the option
    pub min: f64,
    /// < maximum valid value for the option
    pub max: f64,
    pub flags: lang_items::c_int,
    /// The logical unit to which the option belongs. Non-constant
    /// options and corresponding named constants share the same
    /// unit. May be NULL.
    pub unit: *const lang_items::c_char,
}
/// the default value for scalar options
#[repr(C)]
#[derive(Copy, Clone)]
pub union AVOption__bindgen_ty_1 {
    pub i64: i64,
    pub dbl: f64,
    pub str: *const lang_items::c_char,
    pub q: AVRational,
    _bindgen_union_align: u64,
}
#[test]
fn bindgen_test_layout_AVOption__bindgen_ty_1() {
    assert_eq!(
        std::mem::size_of::<AVOption__bindgen_ty_1>(),
        8usize,
        concat!("Size of: ", stringify!(AVOption__bindgen_ty_1))
    );
    assert_eq!(
        std::mem::align_of::<AVOption__bindgen_ty_1>(),
        8usize,
        concat!("Alignment of ", stringify!(AVOption__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { &(*(std::ptr::null::<AVOption__bindgen_ty_1>())).i64 as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(AVOption__bindgen_ty_1),
            "::",
            stringify!(i64)
        )
    );
    assert_eq!(
        unsafe { &(*(std::ptr::null::<AVOption__bindgen_ty_1>())).dbl as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(AVOption__bindgen_ty_1),
            "::",
            stringify!(dbl)
        )
    );
    assert_eq!(
        unsafe { &(*(std::ptr::null::<AVOption__bindgen_ty_1>())).str as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(AVOption__bindgen_ty_1),
            "::",
            stringify!(str)
        )
    );
    assert_eq!(
        unsafe { &(*(std::ptr::null::<AVOption__bindgen_ty_1>())).q as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(AVOption__bindgen_ty_1),
            "::",
            stringify!(q)
        )
    );
}
#[test]
fn bindgen_test_layout_AVOption() {
    assert_eq!(
        std::mem::size_of::<AVOption>(),
        64usize,
        concat!("Size of: ", stringify!(AVOption))
    );
    assert_eq!(
        std::mem::align_of::<AVOption>(),
        8usize,
        concat!("Alignment of ", stringify!(AVOption))
    );
    assert_eq!(
        unsafe { &(*(std::ptr::null::<AVOption>())).name as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(AVOption),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe { &(*(std::ptr::null::<AVOption>())).help as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(AVOption),
            "::",
            stringify!(help)
        )
    );
    assert_eq!(
        unsafe { &(*(std::ptr::null::<AVOption>())).offset as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(AVOption),
            "::",
            stringify!(offset)
        )
    );
    assert_eq!(
        unsafe { &(*(std::ptr::null::<AVOption>())).type_ as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(AVOption),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { &(*(std::ptr::null::<AVOption>())).default_val as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(AVOption),
            "::",
            stringify!(default_val)
        )
    );
    assert_eq!(
        unsafe { &(*(std::ptr::null::<AVOption>())).min as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(AVOption),
            "::",
            stringify!(min)
        )
    );
    assert_eq!(
        unsafe { &(*(std::ptr::null::<AVOption>())).max as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(AVOption),
            "::",
            stringify!(max)
        )
    );
    assert_eq!(
        unsafe { &(*(std::ptr::null::<AVOption>())).flags as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(AVOption),
            "::",
            stringify!(flags)
        )
    );
    assert_eq!(
        unsafe { &(*(std::ptr::null::<AVOption>())).unit as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(AVOption),
            "::",
            stringify!(unit)
        )
    );
}
/// A single allowed range of values, or a single allowed value.
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct AVOptionRange {
    pub str: *const lang_items::c_char,
    /// Value range.
    /// For string ranges this represents the min/max length.
    /// For dimensions this represents the min/max pixel count or width/height in multi-component case.
    pub value_min: f64,
    /// Value range.
    /// For string ranges this represents the min/max length.
    /// For dimensions this represents the min/max pixel count or width/height in multi-component case.
    pub value_max: f64,
    /// Value's component range.
    /// For string this represents the unicode range for chars, 0-127 limits to ASCII.
    pub component_min: f64,
    /// Value's component range.
    /// For string this represents the unicode range for chars, 0-127 limits to ASCII.
    pub component_max: f64,
    /// Range flag.
    /// If set to 1 the struct encodes a range, if set to 0 a single value.
    pub is_range: lang_items::c_int,
}
#[test]
fn bindgen_test_layout_AVOptionRange() {
    assert_eq!(
        std::mem::size_of::<AVOptionRange>(),
        48usize,
        concat!("Size of: ", stringify!(AVOptionRange))
    );
    assert_eq!(
        std::mem::align_of::<AVOptionRange>(),
        8usize,
        concat!("Alignment of ", stringify!(AVOptionRange))
    );
    assert_eq!(
        unsafe { &(*(std::ptr::null::<AVOptionRange>())).str as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(AVOptionRange),
            "::",
            stringify!(str)
        )
    );
    assert_eq!(
        unsafe { &(*(std::ptr::null::<AVOptionRange>())).value_min as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(AVOptionRange),
            "::",
            stringify!(value_min)
        )
    );
    assert_eq!(
        unsafe { &(*(std::ptr::null::<AVOptionRange>())).value_max as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(AVOptionRange),
            "::",
            stringify!(value_max)
        )
    );
    assert_eq!(
        unsafe { &(*(std::ptr::null::<AVOptionRange>())).component_min as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(AVOptionRange),
            "::",
            stringify!(component_min)
        )
    );
    assert_eq!(
        unsafe { &(*(std::ptr::null::<AVOptionRange>())).component_max as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(AVOptionRange),
            "::",
            stringify!(component_max)
        )
    );
    assert_eq!(
        unsafe { &(*(std::ptr::null::<AVOptionRange>())).is_range as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(AVOptionRange),
            "::",
            stringify!(is_range)
        )
    );
}
/// List of AVOptionRange structs.
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct AVOptionRanges {
    /// Array of option ranges.
    ///
    /// Most of option types use just one component.
    /// Following describes multi-component option types:
    ///
    /// AV_OPT_TYPE_IMAGE_SIZE:
    /// component index 0: range of pixel count (width * height).
    /// component index 1: range of width.
    /// component index 2: range of height.
    ///
    /// @note To obtain multi-component version of this structure, user must
    /// provide AV_OPT_MULTI_COMPONENT_RANGE to av_opt_query_ranges or
    /// av_opt_query_ranges_default function.
    ///
    /// Multi-component range can be read as in following example:
    ///
    /// @code
    /// int range_index, component_index;
    /// AVOptionRanges *ranges;
    /// AVOptionRange *range[3]; //may require more than 3 in the future.
    /// av_opt_query_ranges(&ranges, obj, key, AV_OPT_MULTI_COMPONENT_RANGE);
    /// for (range_index = 0; range_index < ranges->nb_ranges; range_index++) {
    /// for (component_index = 0; component_index < ranges->nb_components; component_index++)
    /// range[component_index] = ranges->range[ranges->nb_ranges * component_index + range_index];
    /// //do something with range here.
    /// }
    /// av_opt_freep_ranges(&ranges);
    /// @endcode
    pub range: *mut *mut AVOptionRange,
    /// Number of ranges per component.
    pub nb_ranges: lang_items::c_int,
    /// Number of componentes.
    pub nb_components: lang_items::c_int,
}
#[test]
fn bindgen_test_layout_AVOptionRanges() {
    assert_eq!(
        std::mem::size_of::<AVOptionRanges>(),
        16usize,
        concat!("Size of: ", stringify!(AVOptionRanges))
    );
    assert_eq!(
        std::mem::align_of::<AVOptionRanges>(),
        8usize,
        concat!("Alignment of ", stringify!(AVOptionRanges))
    );
    assert_eq!(
        unsafe { &(*(std::ptr::null::<AVOptionRanges>())).range as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(AVOptionRanges),
            "::",
            stringify!(range)
        )
    );
    assert_eq!(
        unsafe { &(*(std::ptr::null::<AVOptionRanges>())).nb_ranges as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(AVOptionRanges),
            "::",
            stringify!(nb_ranges)
        )
    );
    assert_eq!(
        unsafe { &(*(std::ptr::null::<AVOptionRanges>())).nb_components as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(AVOptionRanges),
            "::",
            stringify!(nb_components)
        )
    );
}
extern "C" {
    /// Show the obj options.
    ///
    /// @param req_flags requested flags for the options to show. Show only the
    /// options for which it is opt->flags & req_flags.
    /// @param rej_flags rejected flags for the options to show. Show only the
    /// options for which it is !(opt->flags & req_flags).
    /// @param av_log_obj log context to use for showing the options
    pub fn av_opt_show2(
        obj: *mut lang_items::c_void,
        av_log_obj: *mut lang_items::c_void,
        req_flags: lang_items::c_int,
        rej_flags: lang_items::c_int,
    ) -> lang_items::c_int;
}
extern "C" {
    /// Set the values of all AVOption fields to their default values.
    ///
    /// @param s an AVOption-enabled struct (its first member must be a pointer to AVClass)
    pub fn av_opt_set_defaults(s: *mut lang_items::c_void);
}
extern "C" {
    /// Set the values of all AVOption fields to their default values. Only these
    /// AVOption fields for which (opt->flags & mask) == flags will have their
    /// default applied to s.
    ///
    /// @param s an AVOption-enabled struct (its first member must be a pointer to AVClass)
    /// @param mask combination of AV_OPT_FLAG_*
    /// @param flags combination of AV_OPT_FLAG_*
    pub fn av_opt_set_defaults2(
        s: *mut lang_items::c_void,
        mask: lang_items::c_int,
        flags: lang_items::c_int,
    );
}
extern "C" {
    /// Parse the key/value pairs list in opts. For each key/value pair
    /// found, stores the value in the field in ctx that is named like the
    /// key. ctx must be an AVClass context, storing is done using
    /// AVOptions.
    ///
    /// @param opts options string to parse, may be NULL
    /// @param key_val_sep a 0-terminated list of characters used to
    /// separate key from value
    /// @param pairs_sep a 0-terminated list of characters used to separate
    /// two pairs from each other
    /// @return the number of successfully set key/value pairs, or a negative
    /// value corresponding to an AVERROR code in case of error:
    /// AVERROR(EINVAL) if opts cannot be parsed,
    /// the error code issued by av_opt_set() if a key/value pair
    /// cannot be set
    pub fn av_set_options_string(
        ctx: *mut lang_items::c_void,
        opts: *const lang_items::c_char,
        key_val_sep: *const lang_items::c_char,
        pairs_sep: *const lang_items::c_char,
    ) -> lang_items::c_int;
}
extern "C" {
    /// Parse the key-value pairs list in opts. For each key=value pair found,
    /// set the value of the corresponding option in ctx.
    ///
    /// @param ctx          the AVClass object to set options on
    /// @param opts         the options string, key-value pairs separated by a
    /// delimiter
    /// @param shorthand    a NULL-terminated array of options names for shorthand
    /// notation: if the first field in opts has no key part,
    /// the key is taken from the first element of shorthand;
    /// then again for the second, etc., until either opts is
    /// finished, shorthand is finished or a named option is
    /// found; after that, all options must be named
    /// @param key_val_sep  a 0-terminated list of characters used to separate
    /// key from value, for example '='
    /// @param pairs_sep    a 0-terminated list of characters used to separate
    /// two pairs from each other, for example ':' or ','
    /// @return  the number of successfully set key=value pairs, or a negative
    /// value corresponding to an AVERROR code in case of error:
    /// AVERROR(EINVAL) if opts cannot be parsed,
    /// the error code issued by av_set_string3() if a key/value pair
    /// cannot be set
    ///
    /// Options names must use only the following characters: a-z A-Z 0-9 - . / _
    /// Separators must use characters distinct from option names and from each
    /// other.
    pub fn av_opt_set_from_string(
        ctx: *mut lang_items::c_void,
        opts: *const lang_items::c_char,
        shorthand: *const *const lang_items::c_char,
        key_val_sep: *const lang_items::c_char,
        pairs_sep: *const lang_items::c_char,
    ) -> lang_items::c_int;
}
extern "C" {
    /// Free all allocated objects in obj.
    pub fn av_opt_free(obj: *mut lang_items::c_void);
}
extern "C" {
    /// Check whether a particular flag is set in a flags field.
    ///
    /// @param field_name the name of the flag field option
    /// @param flag_name the name of the flag to check
    /// @return non-zero if the flag is set, zero if the flag isn't set,
    /// isn't of the right type, or the flags field doesn't exist.
    pub fn av_opt_flag_is_set(
        obj: *mut lang_items::c_void,
        field_name: *const lang_items::c_char,
        flag_name: *const lang_items::c_char,
    ) -> lang_items::c_int;
}
extern "C" {
    /// Set all the options from a given dictionary on an object.
    ///
    /// @param obj a struct whose first element is a pointer to AVClass
    /// @param options options to process. This dictionary will be freed and replaced
    /// by a new one containing all options not found in obj.
    /// Of course this new dictionary needs to be freed by caller
    /// with av_dict_free().
    ///
    /// @return 0 on success, a negative AVERROR if some option was found in obj,
    /// but could not be set.
    ///
    /// @see av_dict_copy()
    pub fn av_opt_set_dict(
        obj: *mut lang_items::c_void,
        options: *mut *mut AVDictionary,
    ) -> lang_items::c_int;
}
extern "C" {
    /// Set all the options from a given dictionary on an object.
    ///
    /// @param obj a struct whose first element is a pointer to AVClass
    /// @param options options to process. This dictionary will be freed and replaced
    /// by a new one containing all options not found in obj.
    /// Of course this new dictionary needs to be freed by caller
    /// with av_dict_free().
    /// @param search_flags A combination of AV_OPT_SEARCH_*.
    ///
    /// @return 0 on success, a negative AVERROR if some option was found in obj,
    /// but could not be set.
    ///
    /// @see av_dict_copy()
    pub fn av_opt_set_dict2(
        obj: *mut lang_items::c_void,
        options: *mut *mut AVDictionary,
        search_flags: lang_items::c_int,
    ) -> lang_items::c_int;
}
extern "C" {
    /// Extract a key-value pair from the beginning of a string.
    ///
    /// @param ropts        pointer to the options string, will be updated to
    /// point to the rest of the string (one of the pairs_sep
    /// or the final NUL)
    /// @param key_val_sep  a 0-terminated list of characters used to separate
    /// key from value, for example '='
    /// @param pairs_sep    a 0-terminated list of characters used to separate
    /// two pairs from each other, for example ':' or ','
    /// @param flags        flags; see the AV_OPT_FLAG_* values below
    /// @param rkey         parsed key; must be freed using av_free()
    /// @param rval         parsed value; must be freed using av_free()
    ///
    /// @return  >=0 for success, or a negative value corresponding to an
    /// AVERROR code in case of error; in particular:
    /// AVERROR(EINVAL) if no key is present
    ///
    pub fn av_opt_get_key_value(
        ropts: *mut *const lang_items::c_char,
        key_val_sep: *const lang_items::c_char,
        pairs_sep: *const lang_items::c_char,
        flags: lang_items::c_uint,
        rkey: *mut *mut lang_items::c_char,
        rval: *mut *mut lang_items::c_char,
    ) -> lang_items::c_int;
}
/// Accept to parse a value without a key; the key will then be returned
/// as NULL.
pub const AV_OPT_FLAG_IMPLICIT_KEY: _bindgen_ty_1 = 1;
pub type _bindgen_ty_1 = u32;
extern "C" {
    /// @defgroup opt_eval_funcs Evaluating option strings
    /// @{
    /// This group of functions can be used to evaluate option strings
    /// and get numbers out of them. They do the same thing as av_opt_set(),
    /// except the result is written into the caller-supplied pointer.
    ///
    /// @param obj a struct whose first element is a pointer to AVClass.
    /// @param o an option for which the string is to be evaluated.
    /// @param val string to be evaluated.
    /// @param *_out value of the string will be written here.
    ///
    /// @return 0 on success, a negative number on failure.
    pub fn av_opt_eval_flags(
        obj: *mut lang_items::c_void,
        o: *const AVOption,
        val: *const lang_items::c_char,
        flags_out: *mut lang_items::c_int,
    ) -> lang_items::c_int;
}
extern "C" {
    pub fn av_opt_eval_int(
        obj: *mut lang_items::c_void,
        o: *const AVOption,
        val: *const lang_items::c_char,
        int_out: *mut lang_items::c_int,
    ) -> lang_items::c_int;
}
extern "C" {
    pub fn av_opt_eval_int64(
        obj: *mut lang_items::c_void,
        o: *const AVOption,
        val: *const lang_items::c_char,
        int64_out: *mut i64,
    ) -> lang_items::c_int;
}
extern "C" {
    pub fn av_opt_eval_float(
        obj: *mut lang_items::c_void,
        o: *const AVOption,
        val: *const lang_items::c_char,
        float_out: *mut f32,
    ) -> lang_items::c_int;
}
extern "C" {
    pub fn av_opt_eval_double(
        obj: *mut lang_items::c_void,
        o: *const AVOption,
        val: *const lang_items::c_char,
        double_out: *mut f64,
    ) -> lang_items::c_int;
}
extern "C" {
    pub fn av_opt_eval_q(
        obj: *mut lang_items::c_void,
        o: *const AVOption,
        val: *const lang_items::c_char,
        q_out: *mut AVRational,
    ) -> lang_items::c_int;
}
extern "C" {
    /// Look for an option in an object. Consider only options which
    /// have all the specified flags set.
    ///
    /// @param[in] obj A pointer to a struct whose first element is a
    /// pointer to an AVClass.
    /// Alternatively a double pointer to an AVClass, if
    /// AV_OPT_SEARCH_FAKE_OBJ search flag is set.
    /// @param[in] name The name of the option to look for.
    /// @param[in] unit When searching for named constants, name of the unit
    /// it belongs to.
    /// @param opt_flags Find only options with all the specified flags set (AV_OPT_FLAG).
    /// @param search_flags A combination of AV_OPT_SEARCH_*.
    ///
    /// @return A pointer to the option found, or NULL if no option
    /// was found.
    ///
    /// @note Options found with AV_OPT_SEARCH_CHILDREN flag may not be settable
    /// directly with av_opt_set(). Use special calls which take an options
    /// AVDictionary (e.g. avformat_open_input()) to set options found with this
    /// flag.
    pub fn av_opt_find(
        obj: *mut lang_items::c_void,
        name: *const lang_items::c_char,
        unit: *const lang_items::c_char,
        opt_flags: lang_items::c_int,
        search_flags: lang_items::c_int,
    ) -> *const AVOption;
}
extern "C" {
    /// Look for an option in an object. Consider only options which
    /// have all the specified flags set.
    ///
    /// @param[in] obj A pointer to a struct whose first element is a
    /// pointer to an AVClass.
    /// Alternatively a double pointer to an AVClass, if
    /// AV_OPT_SEARCH_FAKE_OBJ search flag is set.
    /// @param[in] name The name of the option to look for.
    /// @param[in] unit When searching for named constants, name of the unit
    /// it belongs to.
    /// @param opt_flags Find only options with all the specified flags set (AV_OPT_FLAG).
    /// @param search_flags A combination of AV_OPT_SEARCH_*.
    /// @param[out] target_obj if non-NULL, an object to which the option belongs will be
    /// written here. It may be different from obj if AV_OPT_SEARCH_CHILDREN is present
    /// in search_flags. This parameter is ignored if search_flags contain
    /// AV_OPT_SEARCH_FAKE_OBJ.
    ///
    /// @return A pointer to the option found, or NULL if no option
    /// was found.
    pub fn av_opt_find2(
        obj: *mut lang_items::c_void,
        name: *const lang_items::c_char,
        unit: *const lang_items::c_char,
        opt_flags: lang_items::c_int,
        search_flags: lang_items::c_int,
        target_obj: *mut *mut lang_items::c_void,
    ) -> *const AVOption;
}
extern "C" {
    /// Iterate over all AVOptions belonging to obj.
    ///
    /// @param obj an AVOptions-enabled struct or a double pointer to an
    /// AVClass describing it.
    /// @param prev result of the previous call to av_opt_next() on this object
    /// or NULL
    /// @return next AVOption or NULL
    pub fn av_opt_next(obj: *const lang_items::c_void, prev: *const AVOption) -> *const AVOption;
}
extern "C" {
    /// Iterate over AVOptions-enabled children of obj.
    ///
    /// @param prev result of a previous call to this function or NULL
    /// @return next AVOptions-enabled child or NULL
    pub fn av_opt_child_next(
        obj: *mut lang_items::c_void,
        prev: *mut lang_items::c_void,
    ) -> *mut lang_items::c_void;
}
extern "C" {
    /// Iterate over potential AVOptions-enabled children of parent.
    ///
    /// @param prev result of a previous call to this function or NULL
    /// @return AVClass corresponding to next potential child or NULL
    pub fn av_opt_child_class_next(parent: *const AVClass, prev: *const AVClass) -> *const AVClass;
}
extern "C" {
    /// @defgroup opt_set_funcs Option setting functions
    /// @{
    /// Those functions set the field of obj with the given name to value.
    ///
    /// @param[in] obj A struct whose first element is a pointer to an AVClass.
    /// @param[in] name the name of the field to set
    /// @param[in] val The value to set. In case of av_opt_set() if the field is not
    /// of a string type, then the given string is parsed.
    /// SI postfixes and some named scalars are supported.
    /// If the field is of a numeric type, it has to be a numeric or named
    /// scalar. Behavior with more than one scalar and +- infix operators
    /// is undefined.
    /// If the field is of a flags type, it has to be a sequence of numeric
    /// scalars or named flags separated by '+' or '-'. Prefixing a flag
    /// with '+' causes it to be set without affecting the other flags;
